from lib.hack.utils import ItemProvider


PERSONS = ('主角', '基里亚', '米卡', '拉希德', '夏莉', '阿尔法', '波奇', '达罗', '贝尔纳尔', '达利')
CHARIOTS = tuple('战车%d' % i for i in range(1, 9))


TITLES = (
    "菜鸟",
    "终于够格的人",
    "资深猎人",
    "精英猎人",
    "无敌之男",
    "战斗狂",
    "大富翁",
    "武器狂",
    "战车狂",
    "道具收集狂",
    "败家子",
    "传说之猎人",
    "巴特的挚友",
    "奥林匹亚先生",
    "舞者",
    "玩家",
    "后宫之主",
    "活在爱中的人",
    "妹控",
    "恋母君",
    "牵引专业户",
    "勇者",
    "购物狂",
    "幸运儿",
    "赌神",
    "屠夫",
    "垃圾回收者",
    "顶级饲养员",
    "沙门氏菌猿杀手",
    "租借王",
    "废柴",
    "巴特真正的朋友",
    "镜片之友",
    "放荡儿子",
    "用扳手的人",
    "机械的朋友",
    "战车技师",
    "坦克医生",
    "铁之魔术师",
    "神技修理师",
    "见习修理生",
    "美眉机械师",
    "旅行剑士",
    "钢之保镖",
    "沙漠武士",
    "沙漠将军",
    "剑圣",
    "无敌保镖",
    "火箭炮少女",
    "导弹女士",
    "枪手",
    "不死身之女",
    "最终兵器",
    "胭脂旗",
    "谜之少女",
)

ITEMS_DESC = (
    "人类用白刃战武器。折叠式的小刀。",
    "人类用白刃战武器。轻合金制",
    "人类用白刃战武器。刀身弯曲的短刀。",
    "人类用白刃战武器。适合户外使用的大型刀。",
    "人类用白刃战武器。固定在手甲上的铁爪。",
    "人类用白刃战武器。凸腹弯刀。",
    "人类用白刃战武器。半月形的弯刀。",
    "人类用白刃战武器。刀刃和刀柄上有绯牡丹的图案。",
    "人类用白刃战武器。带有怪物饰品的弯刀。",
    "人类用白刃战武器。常见的日本刀。",
    "人类用白刃战武器。黑色单刃剑，名字的意思就是「利刃」。",
    "人类用白刃战武器。利用振动能量来切断东西的特殊剑。",
    "人类用白刃战武器。刀身兼具强韧与美观。",
    "人类用白刃战武器。刀身又长又大的太刀。",
    "人类用白刃战武器。二刀流武器。以二把剑合为一体。",
    "人类用白刃战武器。二刀流武器。特殊的短刀。",
    "人类用白刃战武器。二刀流武器。掩蔽状态的敌人也能命中。",
    "人类用白刃战武器。二刀流武器。隐形状态的敌人也能命中。",
    "人类用白刃战武器。捣碎东西用的棍棒。具爆炸属性。",
    "人类用白刃战武器。使机械系敌人停止活动。",
    "人类用白刃战武器。青色刀身的曲子刀。具光束属性。",
    "人类用白刃战武器。刻有铭文的日本刀。具音波属性。",
    "人类用射击武器。杰克用来防身的小型枪。",
    "人类用白刃战武器。带有电流的警棍，对生物系敌人有麻痹效果。",
    "人类用白刃战武器。刻有铭文的日本刀。具冰冻属性",
    "人类用白刃战武器。镜片武器。具爆炸属性。",
    "人类用白刃战武器。镜片武器。对生物系敌人麻痹效果。",
    "人类用白刃战武器。镜片武器。具光束属性。",
    "人类用白刃战武器。镜片武器。具音波属性。",
    "人类用白刃战武器。镜片武器。具火焰属性。",
    "人类用白刃战武器。镜片武器。具电气属性。",
    "人类用白刃战武器。镜片武器。具冰冻属性。",
    "人类用白刃战武器。行家偏爱的武器",
    "人类用白刃战武器。光束属性的铁爪，确实是新颖的武器。",
    "人类用白刃战武器。进攻时会引发爆炸，对自己也可能造成损伤。",
    "人类用白刃战武器。非常厉害的刀，传持有者将具备降魔之力",
    "人类用白刃战武器。在降魔刀中也是千里挑一的宝刀。",
    "人类用射击武器。用橡皮筋的力量击发小钢珠。",
    "人类用射击武器。廉价的左轮手枪。",
    "人类用射击武器。小型的自动手枪。",
    "人类用射击武器。击发箭矢的手枪型十字弓。|",
    "人类用射击武器。老式的左轮手枪。",
    "人类用射击武器。很好使的自动手枪。",
    "人类用射击武器。强有力的大型左轮手枪。",
    "人类用射击武器。以飞行的拳套攻击的神秘武器。",
    "人类用射击武器。大型的自动手枪",
    "人类用射击武器。枪管锯短了的双简霰弹枪。",
    "人类用射击武器。狙击用步枪。",
    "人类用射击武器。攻击全体敌人。泵动式霰弹枪。",
    "人类用射击武器。攻击全体敌人。军用的小型冲锋枪。",
    "人类用射击武器。攻击全体敌人。老式的冲锋枪。",
    "人类用射击武器。攻击全体敌人。坚实牢靠的突击枪。",
    "人类用射击武器。攻击全体敌人。旋转式榴弹发射器。",
    "人类用射击武器。攻击全体敌人。小型的火神炮。",
    "人类用射击武器。机械师专用。空中的敌人也能命中。",
    "人类用射击武器。空中的敌人也能命中。",
    "人类用射击武器。机械师专用。高空的敌人也能命中。",
    "人类用射击武器。用信号枪改造的大口径手枪。",
    "人类用射击武器。攻击全体敌人。可靠性很高的突击步枪。",
    "人类用射击武器。具爆炸属性，攻击全体敌人。",
    "人类用射击武器。掩蔽状态的敌人也能命中。",
    "人类用射击武器。由红狐持有。攻击全体敌人。",
    "人类用射击武器。具光束属性。射程外的敌人也能命中。",
    "人类用射击武器。空中和射程外的敌人也命中。",
    "人类用射击武器。具音波属性，隐形状态的敌人也能命中。",
    "人类用射击武器。具火焰属性。",
    "人类用射击武器。具火焰属性，攻击全体敌人，隐形状态的也能命中。",
    "人类用射击武器。具电气属性的特殊枪。",
    "人类用射击武器。具冰冻属性的特殊枪。",
    "人类用射击武器。具冰冻属性的特殊枪。攻击全体敌人。",
    "人类用射击武器。对机械系敌人有麻痹效果。",
    "人类用射击武器。镜片武器。空中的敌人也能命中。",
    "人类用射击武器。镜片武器。地下的敌人也能命中。",
    "人类用射击武器。镜片武器。水中的敌人也能命中。",
    "人类用射击武器。镜片武器。射程外的敌人也能命中。",
    "人类用射击武器。镜片武器。高空的敌人也能命中。",
    "人类用射击武器。镜片武器。隐形状态的敌人也能命中。",
    "人类用射击武器。镜片武器。掩蔽状态的敌人也能命中。",
    "人类用射击武器。双持武器。树脂制枪身的自动手枪。",
    "人类用射击武器。双持武器。强有力的自动手枪。",
    "人类用射击武器。连射性能高的冲锋枪。",
    "人类用射击武器。形状特殊的冲锋枪。",
    "犬用射击武器。射程外的敌人也命中。",
    "犬用射击武器。攻击全体敌人。",
    "犬用射击武器。具爆炸属性。",
    "犬用白刃战武器",
    "犬用射击武器。具光束属性。",
    "犬用射击武器。具音波属性。隐形状态的敌人也能命中。",
    "犬用射击武器。具火焰属性。",
    "犬用射击武器。高空的敌人也能命中。具电气属性。",
    "犬用射击武器。带有冰冻属性。",
    "犬用射击武器。空中的敌人也能命中。",
    "头部防具。布制的帽子。",
    "头部防具。迷彩花纹帽子。",
    "头部防具。绒线织物，只露出眼睛的面具。",
    "头部防具。式样撲素的帽子，带有护目镜。",
    "头部防具。民族风格服装",
    "头部防具。考究的帽子。",
    "头部防具。西部男儿喜欢的帽子。",
    "头部防具。缠在头上的布。",
    "头部防具。热带战斗帽。",
    "头部防具。戴上后就会感觉到变强了的面具。",
    "头部防具。强化塑料制的工作头盔。",
    "头部防具。经过某种防弹处理的假发。",
    "头部防具。兼具高刚性·高耐热性的布制头巾。",
    "头部防具。战斗车辆乘员用头盔。",
    "头部防具。表面涂有特殊纤维的特殊树脂头盔。",
    "头部防具。据称是传说中的人物戴的头巾。",
    "头部防具。神风皇帝所戴王冠的复制品。",
    "头部防具。所谓的猫耳头饰。",
    "头部防具。所谓的兔耳头饰。",
    "躯干防具。布制工作服",
    "躯干防具。迷彩花纹衣服。",
    "躯干防具。原本是轰炸机机组人员的服装。",
    "躯干防具。真皮制的茄克。",
    "躯干防具。使用某种防弹纤维的夏威夷衫。",
    "躯干防具。多层特殊纤维制的防火服。",
    "躯干防具。很长很有型的外套。",
    "躯干防具。真皮制的衣服。",
    "躯干防具。一般的战斗服。",
    "躯干防具。绘有绯牡丹图案的漂亮便装。",
    "躯干防具。为了适应战地而开发的外套。",
    "躯干防具。完全由特殊纤维制成的服装。",
    "躯干防具。织入特殊金属的服装。",
    "躯干防具。耐热服。",
    "躯干防具。紧急医疗队专用的茄克。",
    "躯干防具。以古战场命名的战斗服。",
    "躯干防具。战斗车辆乘员用的防弹衣。",
    "躯干防具。以古战场命名的的防弹衣。",
    "躯干防具。步兵用特殊强化装甲服，所谓的动力甲胃。",
    "躯干防具。据称是传说中的人物穿的背心。",
    "躯干防具。带有神秘气息的上衣。",
    "躯干防具。某种特殊纤维制成的旗袍。",
    "躯干防具。不知是否有防御效果。",
    "躯干防具。特殊合金制的胸罩。",
    "手臂防具。棉手套。",
    "手臂防具。很普通的皮革手套。",
    "手臂防具。戴在手指上再握紧拳头。金属制。",
    "手臂防具。装有铆钉的黑色皮手套。",
    "手臂防具。铁指虎的强化版，看起来就觉得痛。",
    "手臂防具。从手腕到指尖全覆式金属手套。",
    "手臂防具。露出食指，方便射击。",
    "手臂防具。战斗车辆乘员用的手套",
    "手臂防具。戴上后感觉到变强了！",
    "手臂防具。不会妨碍手的活动，机械师专用的作业手套。",
    "脚部防具。比光脚好点。",
    "脚部防具。活动方便。",
    "脚部防具。皮制长简靴",
    "脚部防具。鞋尖放入铁板的靴子。",
    "脚部防具。有着美丽花样的皮靴。",
    "脚部防具。战斗专用钉鞋。",
    "脚部防具。金属制的护胫。",
    "脚部防具。带有绯牡丹图案的木展。",
    "脚部防具。战斗车辆乘员用。",
    "脚部防具。保护整个脚部。",
    "脚部防具。特殊金属制长靴。",
    "犬专用的防具。",
    "减轻10点来自敌人的伤害。",
    "减轻18点来自敌人的伤害。",
    "减轻42点来自敌人的伤害。",
    "减轻66点来自敌人的伤害。",
    "减轻98点来自敌人的伤害。",
    "减轻150点来自敌人的伤害。",
    "减轻200点来自敌人的伤害。",
    "减轻300点来自敌人的伤害。",
    "基本上完全防御爆炸属性的攻击。",
    "基本上完全防御贯通属性的攻击。",
    "基本上完全防御光束属性的攻击。",
    "基本上完全防御音波属性的攻击。",
    "基本上完全防御火焰属性的攻击。燃烧伤害无法防御。",
    "基本上完全防御电气属性的攻击。",
    "基本上完全防御冰冻属性的攻击。",
    "犬专用的护甲。",
    "坏掉的护甲。能在废甲店卖掉。",
    "[主炮]。消耗炮弹。",
    "[主炮]。二发连续发射。",
    "[主炮]。三发连续发射。",
    "[主炮]。特点是重量轻。",
    "[主炮]。电气属性攻击，使用普通炮弹。",
    "[主炮]。发射等离子弹，使用普通炮弹。",
    "[主炮]。对空战车专用。",
    "[主炮]。对空战车专用。攻击全体敌人。",
    "副炮。",
    "[副炮]。攻击全体敌人。",
    "[副炮]。具火焰属性。",
    "[副炮]。具火焰属性。攻击全体敌人。",
    "[副炮]。具电气属性。",
    "[副炮]。具电气属性。攻击全体敌人。",
    "[副炮]。具音波属性。",
    "[副炮]。具音波属性。攻击全体敌人。",
    "[副炮]。具光束属性。",
    "[副炮]。具光束属性。攻击全体敌人。",
    "[SE]。发射的弹头分裂为小型炸弹攻击全体敌人。",
    "[SE]。发射的光子弹分裂后攻击全体敌人。",
    "[SE]。在空中分裂，对全体敌人实行激烈的电击攻击。",
    "[SE]。典型的反坦克导弹夹舱。",
    "[SE]。追踪射程外的敌人并实施攻击的导弹。",
    "[SE]。攻击空中敌人的对空炮。",
    "[SE]。攻击空中全体敌人的对空炮。",
    "[SE]。发射的弹头分裂为火雨降下。",
    "[SE]。在空中分裂，对全体敌人放射光球。",
    "[SE]。对地下的敌人给予攻击。",
    "[SE]。可发射钻头导弹的夹舱。",
    "[SE]。发射热线横扫全体敌人。",
    "[SE]。放射音波攻击全体敌人",
    "[SE]。攻击隐形状态的全体敌人。",
    "[SE]。攻击高空的敌人的迎击系统。",
    "[SE]。攻击高空全体敌人的导弹。",
    "[SE]。放出剑形射线，攻击水中的全体敌人。",
    "[SE]。对全体敌人射出强烈冷气。",
    "[SE]。使用冲击波攻击掩蔽·隐形状态的全体敌人。",
    "[SE]。钻头导弹攻击水中和地下的敌人。",
    "[SE]。用电击攻击空中和高空的全体敌人。",
    "[SE]。发射小型弹头命中空中和射程外的敌人。",
    "[SE]。攻击空中，掩蔽，隐形状态的敌人。",
    "[SE]。看起来不过是普通的反坦克导弹夹舱。",
    "[底盘]。乘车时防御力+5。",
    "[底盘]。乘车时防御力+10。",
    "[底盘]。乘车时防御力+40。",
    "[底盘]。乘车时防御力+30。",
    "[底盘]。乘车时防御力+60。",
    "[底盘]。乘车时防御力+20。",
    "[底盘]。乘车时防御力+90。",
    "[出租坦克]。抢救严重损坏的战车最适合！",
    "[出租坦克]。SE属性守护你！",
    "[出租坦克]。主炮·副炮·SE，全套齐备，旅行无忧。",
    "[出租坦克]。有效解决射程外·空中的敌人。",
    "[出租坦克]。很受女性欢迎！最讨女孩欢心！",
    "[出租坦克]。地下敌人，毫不费力！",
    "[出租坦克]。空中敌人，轻松搞定！",
    "[出租坦克]。高空敌人，不在话下！",
    "[出租坦克]。双SE搭载，用灵魂之火将其点燃吧！",
    "[出租坦克]。最高级品，卓尔不群！",
    "[引擎]。决定战车的载重。",
    "[C单元]。乘车时防御力+19。",
    "[C单元]。乘车时防御力+30。",
    "[C单元]。乘车时防御力+37。",
    "[C单元]。乘车时防御力+44。",
    "[C单元]。乘车时防御力+78。",
    "[C单元]。乘车时防御力+116。",
    "[C单元]。乘车时防御力+182。",
    "[C单元]。乘车时防御力+284。",
    "[C单元]。乘车时防御力+442。",
    "[C单元]。乘车时防御力+644。",
    "回复50HP。",
    "回复100 HP。",
    "回复300 HP。",
    "回复1000 HP。",
    "回复全员100 HP。",
    "中和毒素。",
    "解除酸蚀。",
    "消除麻痹。",
    "？？？？",
    "战斗中提高攻击力的药。",
    "战斗中提高行动速度的药。",
    "战斗中同时提高攻击力和行动速度的药。",
    "毛色上升。",
    "复活死亡的同伴。",
    "回复车辆40 SP。",
    "回复车辆80 SP。",
    "回复车辆200 SP。",
    "回复车辆500 SP。",
    "回复车辆1000 SP。",
    "修复破损的[底盘]和[战车装备]。",
    "完全修复破损的[底盘]和[战车装备]。",
    "清除铅蘑菇和鸟粪。",
    "防止酸损坏战车。",
    "敌人的攻击很难命中。",
    "减弱光束和镭射系攻击的伤害。",
    "战斗中解除停止运行。",
    "战斗中投向敌人。具爆炸属性。",
    "战斗中射击敌人。掩蔽状态的敌人也能命中。",
    "战斗中投向敌人。具光束属性。",
    "战斗中投向敌人。具音波属性。",
    "战斗中投向敌人。使敌人燃烧起来。",
    "战斗中投向敌人。具电气属性。",
    "战斗中投向敌人。具冰冻属性。",
    "战斗中投向敌人。空中的敌人也能命中。",
    "战斗中投向敌人。地下的敌人也能命中。",
    "战斗中投向敌人。水中的敌人也能命中。",
    "战斗中投向敌人。射程外的敌人也能命中。",
    "战斗中投向敌人。高空的敌人也能命中。",
    "战斗中投向敌人。隐形状态的敌人也能命中。",
    "战斗中投向敌人。掩蔽状态的敌人也能命中。",
    "卖给酒吧店主。",
    "脏兮兮的硬币。",
    "音色雄壮的喇叭。",
    "写着难以理解的内容。",
    "深红口红。有点甜？",
    "高级肥皂。起泡，香气，润肤，无与伦比。",
    "高级拖鞋。穿起来感觉很软。",
    "高级浴袍。穿起来感觉真棒，都不想脱了。",
    "高级毛巾。绝佳的触感和吸水性。",
    "粘纸式纹身。",
    "艾米莉用的围裙。",
    "艾米莉房间里的毛巾。",
    "父母房间里的手帕。",
    "父母房间里的衬衫。",
    "蚊虫速死！",
    "液体蚊香。",
    "甜的。",
    "整个世界清静了。",
    "老式防毒面具。",
    "犬用防毒面具。",
    "Cosplay用？",
    "不知道是否有效！",
    "识别标签",
    "套在头上效果惊人！",
    "深红色的印花头巾。",
    "迷彩图案的大头巾。",
    "似乎很好投。",
    "似乎很难投。",
    "天知道好不好投。",
    "闪闪发光。",
    "王牌的证明。",
    "所谓软饮料，就是这东西。",
    "BS控制器专用皮带。",
    "大奖章。好象谁正在收藏……？",
    "流行的健身器材。",
    "健身前后喝效果不错。",
    "涂在身上闪闪发亮。",
    "雕刻着猛男的奖章。",
    "舞女送的礼物。",
    "单纯的摆设。",
    "可与商人兑换[战车装备]。",
    "感觉好像有点不对劲。",
    "神秘的道具。",
    "空中的机械系敌人强制着陆。",
    "挖掘出地下的敌人。",
    "水中的机械系敌人强制上浮。",
    "把射程外的敌人吸引到近处",
    "高空的全体机械系敌人强制下降。",
    "发现隐形状态的敌人。",
    "引出掩蔽状态的敌人。",
    "清除铅蘑菇。",
    "找到附近潜伏的敌人。",
    "吸引敌人攻击自己。",
    "把敌人的攻击转向主人公。",
    "阻止部分敌人自爆。",
    "80％的几率阻止敌人的逃跑。",
    "能灭火。",
    "一定时间内，提高先制攻击的概率。",
    "一定时间内，避免遇到低等级的敌人。",
    "一定时间内，降低遇敌概率。",
    "修复破损的部件。",
    "在地图上使用，发现地面下埋藏的物品。",
    "LOVE机器的部件。",
    "切勿直视太阳！",
    "红颜色的镜片。",
    "眼镜用的镜片。",
    "相机用的镜片。",
    "[主炮]系兵器的基础部件。",
    "[副炮]系兵器基础部件。",
    "[SE]系兵器的基础部件。",
    "可在西部[战车装备]的合成屋进行合成。",
    "不详物的部分。",
    "似能组装在什么东西上。",
    "野太刀的基础部件。",
    "野太刀的部件。",
    "两头剑的基础部件。",
    "两头剑的部件。",
    "拳刃的基础部件。",
    "拳刃的部件。",
    "烈风手枪的基础部件",
    "烈风手枪的部件。",
    "G3A3基础部件",
    "G3A3部件。",
    "可与西部商人交换废铁。",
    "水泥枪的基础部件。",
    "水泥枪的部件。",
    "龙息枪的基础部件。",
    "龙息枪的部件。",
    "USP的基础部件。",
    "USP的部件。",
    "AutoMag的基础部件。",
    "AutoMag的部件。",
    "英格拉姆的基础部件。",
    "英格拉姆的部件。",
    "某种基础部件。",
    "男人的浪漫，钻头爪的基础部件。",
    "男人的浪漫，钻头爪的部件。",
    "装载钻头爪的能量包。",
    "很明显能组装在什么东西上。",
    "试用看看！",
    "分解后降魔刀的本体。",
    "分解后降魔刀的一部分。",
    "在某个地方使用的话…。",
    "能和垃圾山的孩子交换部件。",
    "可去艾丽丝一号西边的商人营地鉴定。",
    "蕾切尔送的礼物。",
    "能打开各种门锁的钥匙。",
    "好象是生发剂。",
    "烧烤会很美味。",
    "看样子很美味。",
    "布制的小袋子。",
    "毛绒玩具。",
    "壁挂系室内装饰。笔法有力。",
    "壁挂系室内装饰。「玫瑰红时期」作品的复制品。",
    "壁挂系室内装饰。超现实类作品。",
    "壁挂系室内装饰。给人恬静寂然之感。",
    "壁挂系室内装饰。感觉相当俊俏风流。",
    "壁挂系室内装饰。看惯的话，还是很可爱的。",
    "壁挂系室内装饰。静音式的壁挂钟。",
    "壁挂系室内装饰。一目了然的大地图。",
    "地板系室内装饰。感觉很高级的地毯。",
    "地板系室内装饰。感觉很温馨。",
    "地板系室内装饰。感觉很和谐。",
    "摆设系室内装饰。经典款式。",
    "小摆设系室内装饰。吉祥物。",
    "小摆设系室内装饰。演奏优美的乐曲。",
    "小摆设系室内装饰。感觉很喜庆。",
    "小摆设系室内装饰。治愈系啊。",
    "古董系室内装饰。美丽典雅的杰作。",
    "古董系室内装饰。花样生动的大碟子。",
    "古董系室内装饰。没有题铭，但相当出色的作品。",
    "古董系室内装饰。不依比例的模型，涂装完毕。",
    "插在花瓶里的花。",
    "桌子系室内装饰。古色古香的感觉。",
    "桌子系室内装饰。暖烘烘的，想睡觉。",
    "桌子系室内装饰。感觉很时尚。",
    "桌子系室内装饰。很撲素的样子。",
    "食金虫居住的笼子。",
    "杂物系室内装饰。狸猫小摆设。",
    "杂物系室内装饰。让房间有点绿意。",
    "杂物系室内装饰。取暖用的。",
    "杂物系室内装饰。吹起来凉快。",
    "箱系室内装饰。欣赏音乐。",
    "箱系室内装饰。水槽中有生物。",
    "箱系室内装饰。水槽中再现生态系统。",
    "箱系室内装饰。内有温湿度计。",
    "箱系室内装饰。放屋里很方便？",
    "橱柜系室内装饰。放衣服用。",
    "家电系室内装饰。小体积冰箱。",
    "家电系室内装饰。主流的冰箱。",
    "家电系室内装饰。多功能冰箱",
    "家电系室内装饰。沾满泥砂的衣服也洗得干干净净！",
    "家电系室内装饰。雨天不愁。",
    "家电系室内装饰。最强二合一！",
    "成年人的服饰……本店的最高级品。",
    "包括着物·带·襦袢·腰带·袴·上衣正式套装！",
    "包括耳朵·女装·尾巴·领结·袖扣的成套装束。",
    "适合正式场合，精心裁剪的式样。",
    "雪白的丝织品，为了她一生最重要的庆典。",
    "独创立体式裁剪。凸显身体的优美曲线。",
    "女仆控必看！以低廉的价格拥有憧憬的女仆。",
    "穿这样一身衣服就像中意的店里那个女孩一样！",
    "款式颜色都按您的要求量身定做。",
    "传送到曾经去过的城镇，脱离迷宫。",
    "战车用的超闪亮饰品。",
    "只能在洗车后除掉。",
    "较轻的废铁。",
    "中等的废铁。",
    "很重的废铁。",
    "预备炮弹。普通炮弹。",
    "预备炮弹。爆炸属性。",
    "预备炮弹。光束属性。",
    "预备炮弹。音波属性。",
    "预备炮弹。火焰属性。",
    "预备炮弹。电气属性。",
    "预备炮弹。冷气属性。",
    "预备炮弹。对空中用。",
    "预备炮弹。",
    "预备炮弹。对射程外用。",
    "预备炮弹。对掩蔽用。",
    "使用型:找到附近潜伏的敌人。",
    "使用型:找到附近潜伏的敌人，先制攻击。",
    "使用型:修复破损的战车装备。",
    "使用型:完全修复破损的战车装备。",
    "使用型:清除铅蘑菇。",
    "使用型:把未装备的战车装备变成废铁。",
    "使用型:一定时间内提高先制攻击的概率。",
    "使用型:发现附近地面上的物品。",
    "使用型:一定时间内不会遇见低等级的敌人。",
    "使用型:回复250HP。",
    "使用型:回复500HP。",
    "使用型:战斗中回复250HP。",
    "使用型:回复全员200HP。",
    "使用型:回复全员500HP。",
    "使用型:从卫星射下镭射攻击敌人。",
    "使用型:BS镭射的扩充服务版。",
    "常驻型:学会后，战斗中回避率上升。",
    "常驻型:学会后，战斗中攻击力上升。",
    "常驻型:学会后，战斗中对空命中率上升。",
    "使用型:装备撞击板后可以冲撞敌人。",
    "使用型:战斗中修复破损的装备。",
    "使用型:战斗中完全修复破损的装备。",
    "使用型:给机械系敌人造成电击伤害。",
    "使用型:即席制作炸弹攻击敌人。",
    "使用型:低几率使包括通缉犯在内的机械系敌人停止运行。",
    "使用型:使机械载体系的敌人停止运行。",
    "使用型:使机械载体系的全体敌人停止运行。",
    "使用型:战斗中全员回复100HP。",
    "使用型:战斗中全员攻击力上升。",
    "使用型:双持武器专用。狙击空中和隐形状态敌人。",
    "常驻型:学会后，战斗中敌人的射击攻击一定几率无效化。",
    "使用型:狙击射程外和高空敌人的最强必杀技。",
    "常驻型:学会后，战斗中对普通敌人的命中率上升。",
    "使用型:麻痹生物系敌人。",
    "使用型:狙击地下和水中敌人的必杀技。",
    "使用型:二刀流专用。攻击隐形和掩蔽状态敌人的必杀技。",
    "常驻型:学会后，战斗中防御力上升。",
    "使用型:对敌人的攻击进行反击。",
    "使用型:使敌人攻击队伍前排人员。",
    "使用型:光束属性的攻击技。",
    "使用型:铁爪式攻击技。",
    "使用型:冲击椎式攻击技。",
    "使用型:爆炸属性的全体攻击技。",
    "使用系:火焰属性的全体攻击技。",
    "常驻型:学会后，战斗中渐渐回复HP。",
    "使用型:跃起攻击，予敌重创。",
    "使用型:攻击空中的敌人。",
    "使用型:用身体冲撞敌人。",
    "使用型:用身体冲撞全体敌人。",
    "攻击空中的敌人。",
    "使用型:麻痹敌人",
    "使用型:防御力上升",
    "使用型:火焰属性的攻击技。",
    "使用型:吸收对方的攻击技。",
    "使用型:进入隐形状态。",
    "使用型:吸引敌人攻击自己。",
    "使用型:把敌人的攻击转向主人公。",
    "使用型:空中的机械系敌人强制着陆。",
    "使用型:挖掘出地下的敌人。",
    "使用型:水中的机械系敌人强制上浮。",
    "使用型:使隐形的敌人显形。",
    "使用型:把射程外敌人引到射程内。",
    "使用型:高空的全体机械系敌人强制下降。",
    "使用型:发现隐形状态的敌人。",
    "使用型:引出掩蔽状态的小型敌人。",
    "使用型:阻止部分敌人自爆。",
    "使用型:80％的几率阻止敌人逃跑。",
    "[C单元]。乘车时防御力+700。",
    "筋肉圣教的书。",
    "比恩钓的鱼。看起来还是不吃为妙。",
    "低俗物品。",
    "低价出售。",
    "均价出售。",
    "高价出售。",
    "天价出售。",
    "机械兵残留下的记忆单元。",
    "标着宝物所在位置的地图。",
    "很棒的大奖章。",
    "宝物地图的碎片。",
    "钻头爪的做法。",
    "光束爪的做法。",
    "爆弹爪的做法。",
    "真·降魔小刀的做法。",
    "真·降魔刀的做法。",
    "165mm幽灵炮的做法。",
    "205mm绯牡丹的做法。",
    "绯牡丹火神炮的做法。",
    "财宝地图的做法。",
    "传说地图的做法。",
    "咖喱包子便当。",
    "桌类室内摆设。",
    "最强的证明。",
    "人类用射击武器。发射电网的网枪。",
    "十连胜的证明。",
    "二十连胜的证明。",
    "三十连胜的证明。",
    "巨大的金属手套。又大又沉，无法装备。",
    "巨大的金属长靴。前所未见的尺寸，穿上后寸步难行。",
    "巨大的金属头盔。头盔很重，戴上后看起来很可笑。",
    "巨大的金属铠甲。似乎能完全钻进去，里面真宽敞。",
    "巨大的金属阔剑。与其说是剑不如说像是铁块。",
)

D = ITEMS_DESC
ITEMS_DATA = (
    "空", # 0000
    # 人类装备
    ("蝴蝶刀", D[0], 12), # 0001
    ("金属棒", D[1], 20), # 0002
    ("双刃弯刀", D[2], 28), # 0003
    ("大砍刀", D[3], 36), # 0004
    ("虎爪", D[4], 45), # 0005
    ("青龙刀", D[5], 59), # 0006
    ("波斯长刀", D[6], 79), # 0007
    ("绯牡丹匕首", D[7], 107), # 0008
    ("锡兰弯刀", D[8], 172), # 0009
    ("无铭刀", D[9], 286), # 000A
    ("Keen Edge", D[10], 330), # 000B
    ("高速振动剑", D[11], 702), # 000C
    ("大马士革剑", D[12], 124), # 000D
    ("野太刀", D[13], 59), # 000E
    ("两头剑", D[14], 28), # 000F
    ("拳刃", D[15], 36), # 0000
    ("破甲刀", D[16], 124), # 0011
    ("双鬼丸", D[17], 172), # 0012
    ("徒手", "", 0), # 0013
    ("粉碎棒", D[18], 24), # 0014
    ("喷射军刀", D[19], 124), # 0015
    ("蓝月刀", D[20], 90), # 0016
    ("和泉守兼定", D[21], 124), # 0017
    ("德林格手枪", D[22], 68), # 0018
    ("电击警棍", D[23], 16), # 0019
    ("崛川国広", D[24], 330), # 001A
    ("晶体军刀1", D[25], 242), # 001B
    ("晶体军刀2", D[26], 242), # 001C
    ("晶体军刀3", D[27], 242), # 001D
    ("晶体军刀4", D[28], 242), # 001E
    ("晶体军刀5", D[29], 242), # 001F
    ("晶体军刀6", D[30], 242), # 0020
    ("晶体军刀7", D[31], 242), # 0021
    ("钻头爪", D[32], 24), # 0022
    ("光束爪", D[33], 172), # 0023
    ("爆弹爪", D[34], 32), # 0024
    ("降魔刀", D[35], 59), # 0025
    ("真·降魔刀", D[36], 516), # 0026
    ("钢珠弹弓", D[37], 8), # 0027
    ("左轮手枪", D[38], 16), # 0028
    ("PPK", D[39], 24), # 0029
    ("弩枪", D[40], 32), # 002A
    ("柯尔特左轮", D[41], 40), # 002B
    ("贝瑞塔", D[42], 50), # 002C
    ("UDAR", D[43], 68), # 002D
    ("火箭飞拳", D[44], 90), # 002E
    ("沙漠之鹰", D[45], 124), # 002F
    ("吉布森霰弹枪", D[46], 172), # 0030
    ("SVD狙击枪", D[47], 242), # 0031
    ("霰弹枪", D[48], 2), # 0032
    ("乌兹冲锋枪", D[49], 4), # 0033
    ("PPsh41", D[50], 6), # 0034
    ("AK47", D[51], 8), # 0035
    ("汤普森冲锋枪", D[50], 10), # 0036
    ("榴弹枪", D[52], 13), # 0037
    ("微型火神炮", D[53], 17), # 0038
    ("回旋扳手", D[54], 20), # 0039
    ("飞刀", D[55], 45), # 003A
    ("遥控扳手", D[56], 207), # 003B
    ("烈风手枪", D[57], 45), # 003C
    ("G3A3", D[58], 10), # 003D
    ("TNT偏执狂", D[59], 8), # 003E
    ("铆钉枪", D[60], 124), # 003F
    ("Pzb39·改", D[61], 175), # 0040
    ("终极风暴枪", D[62], 90), # 0041
    ("毒刺飞弹", D[63], 150), # 0042
    ("声纳枪", D[64], 124), # 0043
    ("火焰枪", D[65], 50), # 0044
    ("烈焰炮", D[66], 13), # 0045
    ("硝酸连射枪", D[66], 50), # 0046
    ("电气枪", D[67], 16), # 0047
    ("冷冻枪", D[68], 330), # 0048
    ("暴雪光束", D[69], 83), # 0049
    ("徒手", "", 0), # 004A
    ("水泥枪", D[70], 45), # 004B
    ("龙息枪", D[65], 59), # 004C
    ("镭射炮1", D[71], 242), # 004D
    ("镭射炮2", D[72], 242), # 004E
    ("镭射炮3", D[73], 242), # 004F
    ("镭射炮4", D[74], 242), # 0050
    ("镭射炮5", D[75], 242), # 0051
    ("镭射炮6", D[76], 242), # 0052
    ("镭射炮7", D[77], 242), # 0053
    ("USP", D[78], 28), # 0054
    ("AutoMag", D[79], 286), # 0055
    ("英格拉姆冲锋枪", D[80], 10), # 0056
    ("P90", D[81], 83), # 0057
    ("犬用枪", D[82], 32), # 0058
    ("犬用火神炮", D[83], 61), # 0059
    ("犬用加农炮", D[84], 24), # 005A
    ("犬用反坦克导弹", D[85], 68), # 005B
    ("犬用激光枪", D[86], 90), # 005C
    ("犬用声纳枪", D[87], 124), # 005D
    ("犬用火焰喷射器", D[88], 50), # 005E
    ("犬用雷电枪", D[89], 172), # 005F
    ("犬用暴雪炮", D[90], 330), # 0060
    ("犬用臼炮", D[91], 40), # 0061
    ("犬用飞翼", D[84], 50), # 0062
    ("犬用火箭炮", D[84], 242), # 0063
    ("作业帽", D[92], 3), # 0064
    ("迷彩帽", D[93], 5), # 0065
    ("头套", D[94], 7), # 0066
    ("护目镜头盔", D[95], 9), # 0067
    ("埃及头巾", D[96], 11), # 0068
    ("软礼帽", D[97], 13), # 0069
    ("牛仔帽", D[98], 16), # 006A
    ("缠头巾", D[99], 19), # 006B
    ("奔尼帽", D[100], 21), # 006C
    ("曲棍球面具", D[101], 27), # 006D
    ("安全头盔", D[102], 32), # 006E
    ("防弹假发", D[103], 47), # 006F
    ("芳纶纤维头巾", D[104], 58), # 0070
    ("CVC头盔", D[105], 70), # 0071
    ("人造纤维头盔", D[106], 103), # 0072
    ("阿里巴巴头巾", D[107], 153), # 0073
    ("凯撒冠", D[108], 217), # 0074
    ("猫耳头饰", D[109], 14), # 0075
    ("兔女郎帽", D[110], 128), # 0076
    ("牛仔衣", D[111], 2), # 0077
    ("迷彩服", D[112], 4), # 0078
    ("飞行茄克", D[113], 5), # 0079
    ("皮夹克", D[114], 7), # 007A
    ("防弹花衬衫", D[115], 9), # 007B
    ("消防服", D[116], 11), # 007C
    ("长风衣", D[117], 13), # 007D
    ("骑手套装", D[118], 14), # 007E
    ("BDU茄克", D[119], 16), # 007F
    ("绯牡丹便装", D[120], 19), # 0080
    ("军用雨衣", D[121], 21), # 0081
    ("高能聚合衣", D[122], 27), # 0082
    ("金属套装", D[123], 32), # 0083
    ("高温作业服", D[124], 39), # 0084
    ("医疗套装", D[125], 47), # 0085
    ("萨拉托加套装", D[126], 58), # 0086
    ("CVC护甲", D[127], 70), # 0087
    ("萨拉托加护甲", D[128], 86), # 0088
    ("突击甲", D[129], 103), # 0089
    ("阿里巴巴背心", D[130], 153), # 008A
    ("圣痕麻衣", D[131], 217), # 008B
    ("防弹旗袍", D[132], 153), # 008C
    ("高叉护甲", D[133], 217), # 008D
    ("女仆服", D[133], 247), # 008E
    ("铁胸衣", D[134], 103), # 008F
    ("手套", D[135], 1), # 0090
    ("皮手套", D[136], 4), # 0091
    ("铁指虎", D[137], 6), # 0092
    ("重金属手套", D[138], 8), # 0093
    ("战斗铁莲花", D[139], 11), # 0094
    ("铁手套", D[140], 14), # 0095
    ("扳机臂套", D[141], 31), # 0096
    ("CVC手套", D[142], 69), # 0097
    ("力量手套", D[143], 145), # 0098
    ("机械师手套", D[144], 22), # 0099
    ("分趾鞋", D[145], 1), # 009A
    ("运动鞋", D[146], 4), # 009B
    ("休闲靴", D[147], 6), # 009C
    ("安全靴", D[148], 8), # 009D
    ("西式长靴", D[149], 11), # 009E
    ("战斗钉鞋", D[150], 14), # 009F
    ("金属护胫", D[151], 22), # 00A0
    ("绯牡丹木展", D[152], 31), # 00A1
    ("CVC长靴", D[153], 46), # 00A2
    ("包钢长靴", D[154], 69), # 00A3
    ("军用护胫", D[155], 145), # 00A4
    ("犬用战甲LV1", D[156], 42), # 00A5
    ("犬用战甲LV2", D[156], 54), # 00A6
    ("犬用战甲LV3", D[156], 71), # 00A7
    ("犬用战甲LV4", D[156], 108), # 00A8
    ("犬用战甲LV5", D[156], 155), # 00A9
    ("犬用战甲LV6", D[156], 232), # 00AA
    ("犬用战甲LV7", D[156], 344), # 00AB
    ("犬用战甲LV8", D[156], 511), # 00AC
    ("犬用战甲LV9", D[156], 723), # 00AD
    ("防护贴条", D[157], 10), # 00AE
    ("炉盖", D[158], 18), # 00AF
    ("绯牡丹腰带", D[159], 42), # 00B0
    ("防弹背心", D[160], 66), # 00B1
    ("硅胶护垫", D[161], 98), # 00B2
    ("陶瓷护垫", D[162], 150), # 00B3
    ("护体挡板", D[163], 200), # 00B4
    ("晶体护盾", D[164], 300), # 00B5
    ("缓冲护甲", D[165], 26), # 00B6
    ("APP背心", D[166], 0), # 00B7
    ("镜铠", D[167], 106), # 00B8
    ("滤音护甲", D[168], 74), # 00B9
    ("耐火护甲", D[169], 90), # 00BA
    ("避雷护甲", D[170], 98), # 00BB
    ("防寒护甲", D[171], 50), # 00BC
    ("犬用护甲", D[172], 400), # 00BD
    ("废甲", D[173], 0), # 00BE

    # 坦克装备 强度, 重量, 攻击, 弹仓
    ("37mm炮", D[174], 20, 100, 50, 20), # 00BF
    ("50mm炮", D[174], 25, 134, 60, 20), # 00C0
    ("75mm炮S", D[174], 30, 168, 70, 20), # 00C1
    ("75mm炮L", D[174], 35, 202, 80, 20), # 00C2
    ("88mm炮", D[174], 40, 236, 90, 20), # 00C3
    ("76mmT型炮", D[174], 45, 270, 100, 20), # 00C4
    ("90mmT型炮", D[174], 50, 305, 110, 20), # 00C5
    ("105mm线膛炮", D[174], 55, 339, 120, 20), # 00C6
    ("120mm线膛炮", D[174], 60, 373, 130, 20), # 00C7
    ("92mm火花炮", D[174], 65, 407, 143, 20), # 00C8
    ("160mm火花炮", D[174], 70, 441, 155, 20), # 00C9
    ("120mm滑膛炮", D[174], 75, 475, 178, 20), # 00CA
    ("140mm滑膛炮", D[174], 80, 509, 200, 20), # 00CB
    ("177mm无常炮", D[174], 85, 543, 228, 20), # 00CC
    ("205mm加农炮", D[174], 90, 577, 255, 20), # 00CD
    ("205mm绯牡丹", D[174], 100, 168, 340, 20), # 00CE
    ("220mm盖亚炮", D[174], 110, 714, 460, 20), # 00CF
    ("225mm九头蛇炮", D[174], 120, 782, 635, 20), # 00D0
    ("轨道加农炮", D[174], 130, 850, 855, 20), # 00D1
    ("180mm连射炮", D[175], 70, 645, 255, 20), # 00D2
    ("190mm连射炮", D[175], 80, 714, 340, 20), # 00D3
    ("三发连射炮", D[176], 90, 782, 460, 20), # 00D4
    ("165mm幽灵炮", D[177], 110, 100, 340, 20), # 00D5
    ("雷电加农炮", D[178], 120, 782, 635, 20), # 00D6
    ("等离子加农炮", D[179], 140, 850, 1027, 20), # 00D7
    ("20mm机关炮", D[180], 50, 152, 55, 20), # 00D8
    ("25mm机关炮", D[180], 55, 169, 45, 20), # 00D9
    ("30mm机关炮", D[181], 60, 186, 35, 10), # 00DA
    ("35mm机关炮", D[180], 110, 357, 230, 20), # 00DB
    ("57mm机关炮", D[181], 115, 391, 161, 10), # 00DC
    ("7.62mm机关枪", D[182], 20, 80, 30, 0), # 00DD
    ("9mm火神炮", D[183], 30, 135, 20, 0), # 00DE
    ("9mm机关枪", D[182], 40, 189, 50, 0), # 00DF
    ("12.7mm火神炮", D[183], 50, 244, 30, 0), # 00E0
    ("12.7mm机关枪", D[182], 60, 298, 70, 0), # 00E1
    ("20mm火神炮", D[183], 70, 353, 41, 0), # 00E2
    ("20mm机关枪", D[182], 80, 407, 105, 0), # 00E3
    ("30mm火神炮", D[183], 90, 462, 66, 0), # 00E4
    ("30mm机关枪", D[182], 100, 516, 175, 0), # 00E5
    ("35mm火神炮", D[183], 110, 571, 118, 0), # 00E6
    ("35mm机关枪", D[182], 120, 625, 323, 0), # 00E7
    ("绯牡丹火神炮", D[183], 130, 80, 216, 0), # 00E8
    ("火焰喷射器", D[184], 70, 353, 41, 0), # 00E9
    ("火龙", D[185], 70, 353, 83, 0), # 00EA
    ("雷电连射炮", D[186], 30, 135, 40, 0), # 00EB
    ("雷暴机关炮", D[187], 30, 135, 20, 0), # 00EC
    ("冲锋号机枪", D[188], 100, 516, 175, 0), # 00ED
    ("破坏笛机枪", D[189], 100, 516, 88, 0), # 00EE
    ("光束爆发枪", D[190], 90, 462, 133, 0), # 00EF
    ("扫射激光枪", D[191], 90, 462, 66, 0), # 00F0
    ("蛇头激光枪", D[191], 130, 680, 433, 0), # 00F1
    ("榴弹投射器", D[192], 20, 100, 30, 6), # 00F2
    ("踢踏舞者炮", D[193], 30, 168, 40, 6), # 00F3
    ("IM脏躁炮", D[194], 30, 168, 40, 6), # 00F4
    ("AT导弹", D[195], 40, 236, 90, 6), # 00F5
    ("寻血猎狗式", D[196], 50, 305, 110, 10), # 00F6
    ("拍击者", D[197], 60, 305, 130, 10), # 00F7
    ("蒸馏器", D[198], 60, 373, 70, 6), # 00F8
    ("凝固汽油炮", D[199], 70, 441, 155, 6), # 00F9
    ("狂厨式", D[200], 70, 441, 83, 6), # 00FA
    ("TNT榴弹炮", D[201], 80, 509, 200, 10), # 00FB
    ("钻头导弹", D[202], 80, 509, 200, 10), # 00FC
    ("日炙弹XX", D[203], 90, 577, 133, 6), # 00FD
    ("高音粒子弹", D[204], 100, 645, 175, 6), # 00FE
    ("气旋加农炮", D[205], 100, 645, 175, 6), # 00FF
    ("CIWS", D[206], 110, 714, 460, 10), # 0100
    ("RAM", D[207], 110, 714, 235, 6), # 0101
    ("剑舞式", D[208], 120, 782, 323, 6), # 0102
    ("北风式", D[209], 130, 850, 433, 6), # 0103
    ("摇滚式", D[210], 120, 782, 323, 6), # 0104
    ("贯雷枪式", D[211], 120, 782, 635, 10), # 0105
    ("露雳领域式", D[212], 120, 782, 323, 6), # 0106
    ("汀达罗斯式", D[213], 120, 782, 635, 10), # 0107
    ("削钢剑式", D[214], 120, 782, 635, 10), # 0108
    ("ATM绯牡丹", D[215], 130, 236, 1027, 4), # 0109
    ("越野车", D[216]), # 010A
    ("德马格", D[216]), # 010B
    ("蚊式", D[217]), # 010C
    ("野巴士", D[218]), # 010D
    ("旋风(对空)", D[219]), # 010E
    ("突击炮", D[219]), # 010F
    ("巴巴罗萨", D[218]), # 0110
    ("消防车", D[220]), # 0111
    ("虎式", D[220]), # 0112
    ("罗西纳", D[220]), # 0113
    ("伏尔甘", D[220]), # 0114
    ("猎豹(对空)", D[221]), # 0115
    ("梅卡瓦", D[222]), # 0116
    ("露露贝尔", D[218]), # 0117
    ("隆美尔", D[220]), # 0118
    ("艾布兰", D[220]), # 0119
    ("零式", D[220]), # 011A
    ("豹式", D[220]), # 011B
    ("鼠式", D[222]), # 011C
    ("猎杀者号", ""), # 011D
    ("虎王式", ""), # 011E
    ("黑豹式G", ""), # 011F
    ("士魂号（74式）", ""), # 0120
    ("出租战车1号", D[223]), # 0121
    ("出租战车2号", D[224]), # 0122
    ("出租战车3号", D[225]), # 0123
    ("出租战车4号", D[226]), # 0124
    ("出租战车5号", D[227]), # 0125
    ("出租战车6号", D[228]), # 0126
    ("出租战车7号", D[229]), # 0127
    ("出租战车8号", D[230]), # 0128
    ("出租战车9号", D[231]), # 0129
    ("出租战车10号", D[232]), # 012A
    # 主炮, 强度, 重量, 载重
    ("驴式", D[233], 20, 20, 800), # 012B
    ("力士式", D[233], 30, 39, 1340), # 012C
    ("公牛式", D[233], 50, 58, 1880), # 012D
    ("苦力式", D[233], 60, 96, 2960), # 012E
    ("V24巨人式", D[233], 80, 135, 4040), # 012F
    ("鲁道夫式", D[233], 90, 154, 4580), # 0130
    ("友式", D[233], 100, 173, 5120), # 0131
    ("OHC卡门式", D[233], 110, 192, 5660), # 0132
    ("V48金刚式", D[233], 120, 211, 6200), # 0133
    ("精灵式", D[233], 130, 230, 6740), # 0134
    # 主炮, 强度, 重量, 防御+
    ("感恩II", D[234], 20, 95, 19), # 0135
    ("伍兹奈克SI", D[235], 40, 224, 30), # 0136
    ("99式神话", D[236], 50, 290, 37), # 0137
    ("艾米", D[237], 60, 354, 44), # 0138
    ("健谈者", D[238], 80, 484, 78), # 0139
    ("诺伊曼", D[239], 90, 548, 116), # 013A
    ("达洛斯", D[240], 100, 613, 182), # 013B
    ("所罗门2", D[241], 110, 678, 284), # 013C
    ("梅塔特隆", D[242], 120, 743, 442), # 013D
    ("西格马80", D[243], 130, 808, 644), # 013E

    # 人类道具
    ("回复胶囊", D[244]), # 013F
    ("回复饮料", D[245]), # 0140
    ("能量胶囊", D[246]), # 0141
    ("能量饮料", D[247]), # 0142
    ("波奇气瓶", D[248]), # 0143
    ("中和剂", D[249]), # 0144
    ("碱性喷雾", D[250]), # 0145
    ("麻痹散", D[251]), # 0146
    ("超级麻痹散", D[251]), # 0147
    ("瞬间怀炉", D[252]), # 0148
    ("兴奋剂20", D[253]), # 0149
    ("兴奋剂50", D[253]), # 014A
    ("敏捷剂20", D[254]), # 014B
    ("敏捷剂50", D[254]), # 014C
    ("主助推器", D[255]), # 014D
    ("汪汪美食家", D[256]), # 014E
    ("怀旧照片", D[252]), # 014F
    ("再生胶囊", D[257]), # 0150
    ("装甲包40", D[258]), # 0151
    ("装甲包80", D[259]), # 0152
    ("装甲包L", D[260]), # 0153
    ("装甲包XL", D[261]), # 0154
    ("装甲包XXL", D[262]), # 0155
    ("修理工具箱", D[263]), # 0156
    ("机械工具箱", D[264]), # 0157
    ("去污剂", D[265]), # 0158
    ("碱性车蜡", D[250]), # 0159
    ("碱性涂层", D[266]), # 015A
    ("隐形涂层", D[267]), # 015B
    ("镜面涂层", D[268]), # 015C
    ("再启动钥匙", D[269]), # 015D
    
    # 攻击类道具
    ("手榴弹", D[270]), # 015E
    ("APAP毒刺飞弹", D[271]), # 015F
    ("光子手榴弹", D[272]), # 0160
    ("音波手榴弹", D[273]), # 0161
    ("火炎瓶", D[274]), # 0162
    ("电击手榴弹", D[275]), # 0163
    ("冰冻手榴弹", D[276]), # 0164
    ("对空手榴弹", D[277]), # 0165
    ("鼹鼠手榴弹", D[278]), # 0166
    ("水雷手榴弹", D[279]), # 0167
    ("远程手榴弹", D[280]), # 0168
    ("飞行炸弹", D[281]), # 0169
    ("追踪炸弹", D[282]), # 016A
    ("胡桃钳", D[283]), # 016B
    ("手榴弹", ""), # 016C
    ("火箭烟花", ""), # 016D
    ("烟花束", ""), # 016E
    ("铅笔飞弹", ""), # 016F
    ("DDパゥD菠萝弹", ""), # 0170
    ("火箭简", ""), # 0171
    ("冷冻瓶", ""), # 0172
    ("催眠瓶", ""), # 0173
    ("恐吓瓶", ""), # 0174
    ("火炎瓶", ""), # 0175
    ("硝化甘油瓶", ""), # 0176
    ("莫洛托夫鸡尾酒", ""), # 0177
    ("浓缩甲醇", ""), # 0178
    ("电击网", ""), # 0179

    # 卖钱用掉落道具
    ("粘糊糊细胞", D[284]), # 017A
    ("颤巍巍细胞", D[284]), # 017B
    ("眼球", D[284]), # 017C
    ("米饭", D[284]), # 017D
    ("狗尾", D[284]), # 017E
    ("滑溜溜细胞", D[284]), # 017F
    ("奢侈品", D[284]), # 0180
    ("蚁肠", D[284]), # 0181
    ("安全鸡肉", D[284]), # 0182
    ("卷饵（暂定）", D[284]), # 0183
    ("蜂蜜", D[284]), # 0184
    ("傻", D[284]), # 0185
    ("鱼肉", D[284]), # 0186
    ("高级鱼肉", D[284]), # 0187
    ("章鱼爪", D[284]), # 0188
    ("软软的果子", D[284]), # 0189
    ("收获铅蘑菇", D[284]), # 018A
    ("神圣蛋白质", D[284]), # 018B
    ("冷冰冰细胞", D[284]), # 018C
    ("硬邦邦细胞", D[284]), # 018D
    ("砂金", D[284]), # 018E
    ("蛇尾", D[284]), # 018F
    ("贝壳", D[284]), # 0190
    ("铜条", D[284]), # 0191
    ("银条", D[284]), # 0192
    ("金条", D[284]), # 0193
    ("银斧", D[284]), # 0194
    ("金斧", D[284]), # 0195

    # 其他类道具
    ("古币", D[285]), # 0196
    ("军号", D[286]), # 0197
    ("圣经", D[287]), # 0198
    ("草莓口红", D[288]), # 0199
    ("松的肥皂", D[289]), # 019A
    ("松的拖鞋", D[290]), # 019B
    ("松的浴袍", D[291]), # 019C
    ("松的毛巾", D[292]), # 019D
    ("纹身贴纸", D[293]), # 019E
    ("妹妹的围裙", D[294]), # 019F
    ("妹妹的毛巾", D[295]), # 01A0
    ("妈妈的手帕", D[296]), # 01A1
    ("爸爸的衬衫", D[297]), # 01A2
    ("杀虫药", D[298]), # 01A3
    ("杀虫剂", D[299]), # 01A4
    ("口香糖", D[300]), # 01A5
    ("耳塞", D[301]), # 01A6
    ("防毒面具", D[302]), # 01A7
    ("犬用面具", D[303]), # 01A8
    ("兔耳", D[304]), # 01A9
    ("兔尾", D[304]), # 01AA
    ("猫耳", D[304]), # 01AB
    ("猫尾", D[304]), # 01AC
    ("接地链条", D[305]), # 01AD
    ("犬标签", D[306]), # 01AE
    ("除蚤项圈", D[307]), # 01AF
    ("红色头巾", D[308]), # 01B0
    ("迷彩头巾", D[309]), # 01B1
    ("易投的石块", D[310]), # 01B2
    ("难投的石块", D[311]), # 01B3
    ("微妙的石头", D[312]), # 01B4
    ("美丽的石头", D[313]), # 01B5
    ("铜战车击破章", D[314]), # 01B6
    ("银战车击破章", D[314]), # 01B7
    ("金战车击破章", D[314]), # 01B8
    ("铂战车击破章", D[314]), # 01B9
    ("果汁", D[315]), # 01BA
    ("BS背带", D[316]), # 01BB
    ("大奖章", D[317]), # 01BC
    ("哑铃", D[318]), # 01BD
    ("筋肉饮料", D[319]), # 01BE
    ("超级凡士林", D[320]), # 01BF
    ("筋肉奖章", D[321]), # 01C0
    ("舞者耳环", D[322]), # 01C1
    ("舞者项链", D[322]), # 01C2
    ("舞者之鞋", D[322]), # 01C3
    ("舞者手套", D[322]), # 01C4

    # 古董品
    ("禽龙", D[323]), # 01C5
    ("畸形禽龙", D[323]), # 01C6
    ("暴龙", D[323]), # 01C7
    ("猿人", D[323]), # 01C8
    ("猛犸", D[323]), # 01C9
    ("绳文土器", D[323]), # 01CA
    ("土偶", D[323]), # 01CB
    ("埴轮", D[323]), # 01CC
    ("机器人", D[323]), # 01CD
    ("假人", ""), # 01CE
    
    # 核心
    ("180mm连射炮核心", D[324]), # 01CF
    ("190mm连射炮核心", D[324]), # 01D0
    ("三发连射炮核心", D[324]), # 01D1
    ("165mm幽灵炮核心", D[324]), # 01D2
    ("雷电加农炮核心", D[324]), # 01D3
    ("等离子加农炮核心", D[324]), # 01D4
    ("TNT榴弹炮核心", D[324]), # 01D5
    ("钻头导弹核心", D[324]), # 01D6
    ("日炙弹XX核心", D[324]), # 01D7
    ("高音粒子弹核心", D[324]), # 01D8
    ("气旋加农炮核心", D[324]), # 01D9
    ("CIWS核心", D[324]), # 01DA
    ("RAM核心", D[324]), # 01DB
    ("剑舞式核心", D[324]), # 01DC
    ("北风式核心", D[324]), # 01DD
    ("摇滚式核心", D[324]), # 01DE
    ("贯雷枪式核心", D[324]), # 01DF
    ("露雳领域式核心", D[324]), # 01E0
    ("汀达罗斯式核心", D[324]), # 01E1
    ("削钢剑式核心", D[324]), # 01E2
    ("ATM绯牡丹核心", D[324]), # 01E3
    ("冲锋号机枪核心", D[324]), # 01E4
    ("破坏笛机枪核心", D[324]), # 01E5
    ("光束爆发枪核心", D[324]), # 01E6
    ("扫射激光枪核心", D[324]), # 01E7
    ("蛇头激光枪核心", D[324]), # 01E8

    # LOVE机器
    ("LOVE机器1111", D[270]), # 01E9
    ("LOVE机器1112", D[272]), # 01EA
    ("LOVE机器1113", D[273]), # 01EB
    ("LOVE机器1121", D[274]), # 01EC
    ("LOVE机器1122", D[275]), # 01ED
    ("LOVE机器1123", D[276]), # 01EE
    ("LOVE机器1131", D[325]), # 01EF
    ("LOVE机器1132", D[325]), # 01F0
    ("LOVE机器1133", D[326]), # 01F1
    ("LOVE机器1211", D[277]), # 01F2
    ("LOVE机器1212", D[278]), # 01F3
    ("LOVE机器1213", D[279]), # 01F4
    ("LOVE机器1221", D[280]), # 01F5
    ("LOVE机器1222", D[281]), # 01F6
    ("LOVE机器1223", D[282]), # 01F7
    ("LOVE机器1231", D[283]), # 01F8
    ("LOVE机器1232", D[325]), # 01F9
    ("LOVE机器1233", D[286]), # 01FA
    ("LOVE机器1311", D[327]), # 01FB
    ("LOVE机器1312", D[328]), # 01FC
    ("LOVE机器1313", D[329]), # 01FD
    ("LOVE机器1321", D[330]), # 01FE
    ("LOVE机器1322", D[331]), # 01FF
    ("LOVE机器1323", D[332]), # 0200
    ("LOVE机器1331", D[333]), # 0201
    ("LOVE机器1332", D[325]), # 0202
    ("LOVE机器1333", D[325]), # 0203
    ("LOVE机器2111", D[325]), # 0204
    ("LOVE机器2112", D[325]), # 0205
    ("LOVE机器2113", D[325]), # 0206
    ("LOVE机器2121", D[334]), # 0207
    ("LOVE机器2122", D[325]), # 0208
    ("LOVE机器2123", D[325]), # 0209
    ("LOVE机器2131", D[325]), # 020A
    ("LOVE机器2132", D[335]), # 020B
    ("LOVE机器2133", D[325]), # 020C
    ("LOVE机器2211", D[336]), # 020D
    ("LOVE机器2212", D[337]), # 020E
    ("LOVE机器2213", D[338]), # 020F
    ("LOVE机器2221", D[339]), # 0210
    ("LOVE机器2222", D[325]), # 0211
    ("LOVE机器2223", D[325]), # 0212
    ("LOVE机器2231", D[325]), # 0213
    ("LOVE机器2232", D[325]), # 0214
    ("LOVE机器2233", D[325]), # 0215
    ("LOVE机器2311", D[340]), # 0216
    ("LOVE机器2312", D[250]), # 0217
    ("LOVE机器2313", D[269]), # 0218
    ("LOVE机器2321", D[249]), # 0219
    ("LOVE机器2323", D[251]), # 021A
    ("LOVE机器2323", D[325]), # 021B
    ("LOVE机器2331", D[325]), # 021C
    ("LOVE机器2332", D[325]), # 021D
    ("LOVE机器2333", D[325]), # 021E
    ("LOVE机器3111", D[253]), # 021F
    ("LOVE机器3112", D[253]), # 0220
    ("LOVE机器3113", D[254]), # 0221
    ("LOVE机器3121", D[254]), # 0222
    ("LOVE机器3122", D[325]), # 0223
    ("LOVE机器3123", D[325]), # 0224
    ("LOVE机器3131", D[325]), # 0225
    ("LOVE机器3132", D[325]), # 0226
    ("LOVE机器3133", D[325]), # 0227
    ("LOVE机器3211", D[341]), # 0228
    ("LOVE机器3212", D[342]), # 0229
    ("LOVE机器3213", D[343]), # 022A
    ("LOVE机器3221", D[344]), # 022B
    ("LOVE机器3222", D[345]), # 022C
    ("LOVE机器3233", D[325]), # 022D
    ("LOVE机器3231", D[325]), # 022E
    ("LOVE机器3232", D[325]), # 022F
    ("LOVE机器3233", D[325]), # 0230
    ("LOVE机器3311", D[326]), # 0231
    ("LOVE机器3312", D[326]), # 0232
    ("LOVE机器3313", D[326]), # 0233
    ("LOVE机器3321", D[326]), # 0234
    ("LOVE机器3322", D[326]), # 0235
    ("LOVE机器3323", D[326]), # 0236
    ("LOVE机器3331", D[325]), # 0237
    ("LOVE机器3332", D[325]), # 0238
    ("LOVE机器3333", D[325]), # 0239
    ("L1芯片", D[346]), # 023A
    ("L2芯片", D[346]), # 023B
    ("L3芯片", D[346]), # 023C
    ("O1芯片", D[346]), # 023D
    ("O2芯片", D[346]), # 023E
    ("O3芯片", D[346]), # 023F
    ("V1芯片", D[346]), # 0240
    ("V2芯片", D[346]), # 0241
    ("V3芯片", D[346]), # 0242
    ("E1芯片", D[346]), # 0243
    ("E2芯片", D[346]), # 0244
    ("E3芯片", D[346]), # 0245

    # 透镜
    ("太阳镜", D[347]), # 0246
    ("宝石镜", D[348]), # 0247
    ("眼镜", D[349]), # 0248
    ("光镜", D[350]), # 0249

    # 合成素材和其他东西
    ("炮管", D[351]), # 024A
    ("导向器", D[352]), # 024B
    ("金属板", D[353]), # 024C
    ("猴眼", D[354]), # 024D
    ("鹰眼", D[354]), # 024E
    ("鼹眼", D[354]), # 024F
    ("鱼眼", D[354]), # 0250
    ("狗眼", D[354]), # 0251
    ("鹫眼", D[354]), # 0252
    ("蛇眼", D[354]), # 0253
    ("鸦眼", D[354]), # 0254
    ("铁锤", D[354]), # 0255
    ("爆裂铁锤", D[354]), # 0256
    ("闪光灯", D[354]), # 0257
    ("增幅器", D[354]), # 0258
    ("喷嘴", D[354]), # 0259
    ("电容器", D[354]), # 025A
    ("增压器", D[354]), # 025B
    ("安全插件7", D[354]), # 025C
    ("安全插件8", D[354]), # 025D
    ("安全插件9", D[354]), # 025E
    ("安全插件10", D[354]), # 025F
    ("安全插件11", D[354]), # 0260
    ("安全插件12", D[354]), # 0261
    ("安全插件13", D[354]), # 0262
    ("蛇的炮管", D[354]), # 0263
    ("蛇的爆缩机", D[354]), # 0264
    ("蛇的图标", D[354]), # 0265
    ("等离子炮管", D[354]), # 0266
    ("等离子电磁线圈", D[354]), # 0267
    ("等离子电容器", D[354]), # 0268
    ("绯牡丹炮管", D[354]), # 0269
    ("绯牡丹速射装置", D[354]), # 026A
    ("雄性激素", D[354]), # 026B
    ("尖爪之石", D[355]), # 026C
    ("鬣蜥齿之石", D[356]), # 026D
    ("角之石", D[356]), # 026E
    ("大颚之石", D[355]), # 026F
    ("小手之石", D[356]), # 0270
    ("牙之石", D[356]), # 0271
    ("巨大背骨之石", D[356]), # 0272
    ("头颅之石", D[355]), # 0273
    ("背骨之石", D[356]), # 0274
    ("腕之石", D[356]), # 0275
    ("化石花束之石", D[356]), # 0276
    ("巨牙之石", D[355]), # 0277
    ("大耳之石", D[356]), # 0278
    ("独眼巨人头颅之石", D[356]), # 0279
    ("圆形肉之石", D[356]), # 027A
    ("圆简状碎片", D[355]), # 027B
    ("把手碎片", D[356]), # 027C
    ("未知碎片", D[356]), # 027D
    ("躯干碎片", D[355]), # 027E
    ("头部碎片", D[356]), # 027F
    ("胸部碎片", D[356]), # 0280
    ("举起的手碎片", D[355]), # 0281
    ("垂下的手碎片", D[356]), # 0282
    ("简状身体碎片", D[356]), # 0283
    ("裙子碎片", D[356]), # 0284
    ("手腕部件碎片", D[355]), # 0285
    ("太阳镜碎片", D[356]), # 0286
    ("皮夹克碎片", D[356]), # 0287
    ("咖啡罐碎片", D[356]), # 0288
    ("伪装", ""), # 0289
    ("刀身", D[357]), # 028A
    ("刀柄", D[358]), # 028B
    ("刀鞘", D[358]), # 028C
    ("小型刀身", D[359]), # 028D
    ("小型刀柄", D[360]), # 028E
    ("小型刀鞘", D[360]), # 028F
    ("怪刀身", D[361]), # 0290
    ("怪刀柄", D[362]), # 0291
    ("怪刀鞘", D[362]), # 0292
    ("烈风枪身", D[363]), # 0293
    ("烈风枪管", D[364]), # 0294
    ("烈风滑套", D[364]), # 0295
    ("突击枪身", D[365]), # 0296
    ("突击枪管", D[366]), # 0297
    ("突击滑套", D[366]), # 0298
    ("未知块", D[367]), # 0299
    ("中型块", D[367]), # 029A
    ("大型块", D[367]), # 029B
    ("水泥枪枪身", D[368]), # 029C
    ("水泥枪枪管", D[369]), # 029D
    ("水泥枪滑套", D[369]), # 029E
    ("龙枪身", D[370]), # 029F
    ("龙枪管", D[371]), # 02A0
    ("龙滑套", D[371]), # 02A1
    ("USP枪身", D[372]), # 02A2
    ("USP枪管", D[373]), # 02A3
    ("USP滑套", D[373]), # 02A4
    ("麦林枪身", D[374]), # 02A5
    ("麦林枪管", D[375]), # 02A6
    ("麦林滑套", D[375]), # 02A7
    ("英格拉枪身", D[376]), # 02A8
    ("英格拉枪管", D[377]), # 02A9
    ("英格拉滑套", D[377]), # 02AA
    ("汪汪炮管", D[378]), # 02AB
    ("犬用轭具", D[356]), # 02AC
    ("犬接合器", D[356]), # 02AD
    ("钻头刃", D[379]), # 02AE
    ("爪柄", D[380]), # 02AF
    ("钻头鞘", D[380]), # 02B0
    ("光束包", D[381]), # 02B1
    ("爆弹包", D[381]), # 02B2
    ("降魔刀助推器", D[382]), # 02B3
    ("真·降魔小刀", D[383]), # 02B4
    ("魔刀身", D[384]), # 02B5
    ("呼魔玉", D[385]), # 02B6
    ("巴士牌", D[386]), # 02B7
    ("205mm绯牡丹核心", D[324]), # 02B8
    ("绯牡丹火神炮核心", D[324]), # 02B9
    ("假人", ""), # 02BA
    ("垃圾", D[387]), # 02BB
    ("生化垃圾", D[388]), # 02BC
    ("数码垃圾", D[388]), # 02BD
    ("机械垃圾", D[388]), # 02BE
    ("车体垃圾", D[388]), # 02BF
    ("未知垃圾", D[388]), # 02C0
    ("特别垃圾", D[388]), # 02C1
    ("不寻常的垃圾", D[388]), # 02C2
    ("非常棒的垃圾", D[388]), # 02C3
    ("一流机械垃圾", D[388]), # 02C4
    ("旧文明的垃圾", D[388]), # 02C5
    ("地雷探测器", D[345]), # 02C6
    ("金属探测器", D[345]), # 02C7
    ("BS控制器", ""), # 02C8
    ("挂件", D[389]), # 02C9
    ("万能钥匙", D[390]), # 02CA
    ("生发剂", D[391]), # 02CB
    ("生发剂3", D[391]), # 02CC
    ("生发剂T", D[391]), # 02CD
    ("生发剂L", D[391]), # 02CE
    ("生发剂A", D[391]), # 02CF
    ("山芋", D[392]), # 02D0
    ("烤山芋", D[393]), # 02D1
    ("护身符", D[394]), # 02D2
    ("泰迪熊", D[395]), # 02D3
    
    # 装饰用家具
    ("写着\"根性\"字画", D[396]), # 02D4
    ("毕加索的名画", D[397]), # 02D5
    ("达利的名画", D[398]), # 02D6
    ("山水画", D[399]), # 02D7
    ("浮世绘", D[400]), # 02D8
    ("河豚君", D[401]), # 02D9
    ("壁挂钟", D[402]), # 02DA
    ("世界地图", D[403]), # 02DB
    ("波斯地毯", D[404]), # 02DC
    ("榻榻米", D[405]), # 02DD
    ("木质地板", D[406]), # 02DE
    ("木雕熊", D[407]), # 02DF
    ("招财猫", D[408]), # 02E0
    ("八音盒", D[409]), # 02E1
    ("七福神", D[410]), # 02E2
    ("金鱼缸", D[411]), # 02E3
    ("仙人掌盆栽", D[411]), # 02E4
    ("青瓷壶", D[412]), # 02E5
    ("景德镇瓷器", D[413]), # 02E6
    ("花瓶", D[414]), # 02E7
    ("战车模型", D[415]), # 02E8
    ("蔷薇花束", D[416]), # 02E9
    ("向日葵花束", D[416]), # 02EA
    ("非洲菊花束", D[416]), # 02EB
    ("饭桌", D[417]), # 02EC
    ("暖桌", D[418]), # 02ED
    ("时髦桌子", D[419]), # 02EE
    ("地炉", D[420]), # 02EF
    ("食金虫的笼子", D[421]), # 02F0
    ("信乐烧狸", D[422]), # 02F1
    ("观叶植物", D[423]), # 02F2
    ("火盆", D[424]), # 02F3
    ("电风扇", D[425]), # 02F4
    ("点唱机", D[426]), # 02F5
    ("点唱机DX", D[426]), # 02F6
    ("观赏鱼缸", D[427]), # 02F7
    ("饲养箱", D[428]), # 02F8
    ("百叶箱", D[429]), # 02F9
    ("自动售货机", D[430]), # 02FA
    ("衣橱", D[431]), # 02FB
    ("壁橱", D[431]), # 02FC
    ("日式衣柜", D[431]), # 02FD
    ("多屉衣柜", D[431]), # 02FE
    ("带锁的柜子", D[431]), # 02FF
    ("单门电冰箱", D[432]), # 02F0
    ("双门电冰箱", D[433]), # 02F1
    ("豪华电冰箱", D[434]), # 02F2
    ("洗衣机", D[435]), # 02F3
    ("干衣机", D[436]), # 02F4
    ("洗干一体机", D[437]), # 02F5
    ("和服", D[438]), # 02F6
    ("巫服", D[439]), # 02F7
    ("兔女郎装", D[440]), # 02F8
    ("礼服", D[441]), # 02F9
    ("婚纱", D[442]), # 02FA
    ("旗袍", D[443]), # 02FB
    ("女仆装", D[444]), # 02FC
    ("女侍装", D[445]), # 02FD
    ("紧身衣", ""), # 02FE
    ("泳装", D[446]), # 02FF

    # 坦克道具
    ("传真", D[447]), # 0310
    ("探照灯", ""), # 0311
    ("夜视装置", ""), # 0312
    ("灭火装置", ""), # 0313
    ("医疗装置", ""), # 0314
    ("[空栏]", ""), # 0315
    ("换气装置", ""), # 0316
    ("冷气", ""), # 0317
    ("暖气", ""), # 0318
    ("空调", ""), # 0319
    ("[空栏]", ""), # 031A
    ("[空栏]", ""), # 031B
    ("[空栏]", ""), # 031C
    ("迷彩伪装", ""), # 031D
    ("接地链条", D[448]), # 031E
    ("电磁护屏", ""), # 031F
    ("雷达示波器", ""), # 0320
    ("撞击板", D[448]), # 0321
    ("[空栏]", ""), # 0322
    ("[空栏]", ""), # 0323
    ("[空栏]", ""), # 0324
    ("[空栏]", ""), # 0325
    ("[空栏]", ""), # 0326
    ("车喇叭L2", ""), # 0327
    ("车喇叭R2", ""), # 0328
    ("警报器RA", ""), # 0329
    ("除臭剂", ""), # 032A
    ("皮革车座", ""), # 032B
    ("花纹车座套", ""), # 032C
    ("丝绸车座套", ""), # 032D
    ("迷彩车座套", ""), # 032E
    ("泰迪熊玩具", ""), # 032F
    ("嫩叶标志", D[448]), # 0330
    ("欢迎超车标志", D[448]), # 0331
    ("小兔挂饰", ""), # 0332
    ("安全护身符", ""), # 0333
    ("铅蘑菇", D[449]), # 0334
    ("鸟粪", D[449]), # 0335
    ("废铁", D[450]), # 0336
    ("废铁", D[451]), # 0337
    ("废铁", D[452]), # 0338
    ("烟雾", ""), # 0339
    ("红旗", D[448]), # 033A
    ("蓝旗", D[448]), # 033B
    ("绿旗", D[448]), # 033C
    ("黄旗", D[448]), # 033D
    ("黑旗", D[448]), # 033E
    ("鲤鱼幡", D[448]), # 033F
    ("风向鸡", D[448]), # 0340
    ("大渔旗", D[448]), # 0341
    ("旗帜", D[448]), # 0342

    # 炮弹
    ("预备弹", D[453]), # 0343
    ("爆裂弹", D[454]), # 0344
    ("光子弹", D[455]), # 0345
    ("声波弹", D[456]), # 0346
    ("凝固汽油弹", D[457]), # 0347
    ("电磁弹", D[458]), # 0348
    ("冷冻弹", D[459]), # 0349
    ("短箭弹", D[460]), # 035A
    ("炮弹（对地下）", D[461]), # 035B
    ("炮弹（对水中）", D[461]), # 035C
    ("RAP弹", D[462]), # 035D
    ("炮弹（对高空）", D[461]), # 035E
    ("炮弹（对隐形）", D[461]), # 035F
    ("APFSDS弹", D[463]), # 0350
    ("炮弹（部件破坏）", D[461]), # 0351

    # 特技
    ("探索", D[464]), # 0352
    ("探索＆消灭", D[465]), # 0353
    ("修理Lv1", D[466]), # 0354
    ("修理Lv2", D[467]), # 0355
    ("洗车", D[468]), # 0356
    ("轻量化", ""), # 0357
    ("中国菜", ""), # 0358
    ("废物利用", D[469]), # 0359
    ("特价预感", ""), # 035A
    ("工装天使", ""), # 035B
    ("家常菜", ""), # 035C
    ("战士感觉", D[470]), # 035D
    ("感应器", D[470]), # 035E
    ("超嗅觉", D[471]), # 035F
    ("兽气息", D[472]), # 0360
    ("再生", ""), # 0361
    ("药酒桶Lv1", D[473]), # 0362
    ("药酒桶Lv2", D[474]), # 0363
    ("药酒桶Lv3", D[475]), # 0364
    ("药酒桶Lv4", ""), # 0365
    ("药酒桶Lv1+", D[476]), # 0366
    ("药酒桶Lv2+", D[477]), # 0367
    ("药酒桶Lv3+", ""), # 0368
    ("药酒桶Lv4+", ""), # 0369
    ("BS激光", D[478]), # 036A
    ("扩散型BS激光", D[479]), # 036B
    ("穿刺", ""), # 036C
    ("鹰眼", ""), # 036D
    ("闪避", D[480]), # 036E
    ("牛眼", D[481]), # 036F
    ("对空炮火", D[482]), # 0370
    ("钢铁之城", ""), # 0371
    ("冲撞", D[483]), # 0372
    ("火箭启动", ""), # 0373
    ("配合行动", ""), # 0374
    ("高速机动", ""), # 0375
    ("斗志", ""), # 0376
    ("突破", ""), # 0377
    ("狂奔", ""), # 0378
    ("高速驾驶", ""), # 0379
    ("火力全开", ""), # 037A
    ("自动模式", ""), # 037B
    ("即时修理Lv1", D[484]), # 037C
    ("即时修理Lv2", D[485]), # 037D
    ("弱点看破", ""), # 037E
    ("小鬼攻击", ""), # 037F
    ("短路", D[486]), # 0380
    ("速制炸弹", D[487]), # 0381
    ("拆解魔", D[488]), # 0382
    ("破车", ""), # 0383
    ("信号中断", D[489]), # 0384
    ("机械停止", D[490]), # 0385
    ("增压", ""), # 0386
    ("解除警报", ""), # 0387
    ("工服天使", D[491]), # 0388
    ("支援", D[492]), # 0389
    ("双手枪乱射", D[493]), # 038A
    ("拦截", D[494]), # 038B
    ("远距离狙击", D[495]), # 038C
    ("第三次行动", ""), # 038D
    ("快速瞄准", D[496]), # 038E
    ("死神之矢", D[481]), # 038F
    ("猎鸟", D[482]), # 0390
    ("精确射击", ""), # 0391
    ("死点射击", ""), # 0392
    ("缚影", D[497]), # 0393
    ("最后行动", ""), # 0394
    ("弹幕射击", ""), # 0395
    ("先手必胜", ""), # 0396
    ("零点行动", ""), # 0397
    ("致命一击", ""), # 0398
    ("枪之舞", ""), # 0399
    ("地面突刺", D[498]), # 039A
    ("破箭式", D[494]), # 039B
    ("大回旋斩", D[499]), # 039C
    ("燕返", ""), # 039D
    ("真空斩", ""), # 039E
    ("见切", ""), # 039F
    ("心头灭却", D[500]), # 03A0
    ("修罗", D[481]), # 03A1
    ("霞斩", ""), # 03A2
    ("死线斩", ""), # 03A3
    ("愤怒", ""), # 03A4
    ("最后的一太刀", ""), # 03A5
    ("分身斩", ""), # 03A6
    ("罗刹", ""), # 03A7
    ("死神之手", ""), # 03A8
    ("死亡之舞", ""), # 03A9
    ("自我修复", ""), # 03AA
    ("预备能量", ""), # 03AB
    ("预测反击", D[501]), # 03AC
    ("宙斯盾系统", D[502]), # 03AD
    ("宙斯盾系统II", ""), # 03AE
    ("手持火神炮", ""), # 03AF
    ("集束枪", ""), # 03B0
    ("激光步枪", D[503]), # 03B1
    ("榴弹枪", ""), # 03B2
    ("关节射击", ""), # 03B3
    ("光剑", ""), # 03B4
    ("钢铁之爪", D[504]), # 03B5
    ("破坏冲击椎", D[505]), # 03B6
    ("长程追踪导弹", D[506]), # 03B7
    ("电击触发器", ""), # 03B8
    ("爆炎连射导弹", D[507]), # 03B9
    ("榴弹发射机", ""), # 03BA
    ("金属翼", ""), # 03BB
    ("光之翼", ""), # 03BC
    ("复仇女神I", ""), # 03BD
    ("复仇女神II", ""), # 03BE
    ("兽气息", ""), # 03BF
    ("再生", D[508]), # 03C0
    ("掩护", ""), # 03C1
    ("第二次行动", ""), # 03C2
    ("流星", D[509]), # 03C3
    ("流星冲击", D[510]), # 03C4
    ("狗的斗志", ""), # 03C5
    ("战号", ""), # 03C6
    ("弹头冲撞", D[511]), # 03C7
    ("狂乱冲撞", D[512]), # 03C8
    ("对空冲撞", D[513]), # 03C9
    ("践踏", D[514]), # 03CA
    ("强化皮肤", D[500]), # 03CB
    ("防护罩", D[515]), # 03CC
    ("火焰呼吸", D[516]), # 03CD
    ("眼部光束", D[503]), # 03CE
    ("牵引车光束", D[517]), # 03CF
    ("变色龙光束", ""), # 03D0
    ("透明化", D[518]), # 03D1
    ("诱骗", D[519]), # 03D2
    ("保卫", D[520]), # 03D3
    ("迫降", D[521]), # 03D4
    ("挖掘", D[522]), # 03D5
    ("上浮", D[523]), # 03D6
    ("再现", D[524]), # 03D7
    ("追击", D[525]), # 03D8
    ("下降", D[526]), # 03D9
    ("观察迹象", D[527]), # 03DA
    ("破除防护", D[528]), # 03DB
    ("自爆禁止", D[529]), # 03DC
    ("退却阻止", D[530]), # 03DD

    ("阿尔法", D[531]), # 03DE

    # 其他类道具
    ("节子的照片1", D[326]), # 03DF
    ("节子的照片2", D[326]), # 03E0
    ("节子的照片3", D[326]), # 03E1
    ("节子的照片4", D[326]), # 03E2
    ("节子的照片5", D[326]), # 03E3
    ("节子的照片6", D[326]), # 03E4
    ("节子的照片7", D[326]), # 03E5
    ("节子的照片8", D[326]), # 03E6
    ("节子的照片9", D[326]), # 03E7
    ("小孩的照片", D[326]), # 03E8
    ("全家福", D[326]), # 03E9
    ("筋肉宝典", D[532]), # 03EA
    ("怪鱼", D[533]), # 03EB
    ("H书", D[534]), # 03EC
    ("破洞长靴", D[326]), # 03ED
    ("铜奖章", D[535]), # 03EE
    ("银奖章", D[536]), # 03EF
    ("金奖章", D[537]), # 03F0
    ("金块", D[538]), # 03F1
    ("黄金像", D[538]), # 03F2
    ("财宝", D[538]), # 03F3
    ("存储装置", D[539]), # 03F4
    ("宝物地图", D[540]), # 03F5
    ("秘密藏宝图", D[540]), # 03F6
    ("私房钱地图", D[540]), # 03F7
    ("旧地图", D[540]), # 03F8
    ("海盗的地图", D[540]), # 03F9
    ("奇怪的地图", D[540]), # 03FA
    ("豪华的地图", D[540]), # 03FB
    ("超大型奖章", D[541]), # 03FC
    ("只有一半的地图", D[542]), # 03FD
    ("财宝地图", D[540]), # 03FE
    ("传说地图", D[540]), # 03FF
    ("古文书", D[326]), # 0400
    ("钻头爪的笔记", D[543]), # 0401
    ("光束爪的笔记", D[544]), # 0402
    ("爆弹爪的笔记", D[545]), # 0403
    ("真·降魔小刀的笔记", D[546]), # 0404
    ("真·降魔刀的笔记", D[547]), # 0405
    ("165mm幽灵炮的笔记", D[548]), # 0406
    ("205mm绯牡丹的笔记", D[549]), # 0407
    ("绯牡丹火神炮的笔记", D[550]), # 0408
    ("财宝地图的笔记", D[551]), # 0409
    ("传说地图的笔记", D[552]), # 040A
    ("咖喱便当", D[553]), # 040B
    ("游艺桌", D[554]), # 040C
    ("最强之证", D[555]), # 040D
    ("破碎的地图", D[542]), # 040E
    ("地图的碎片", D[542]), # 040F
    ("只有一半的地图", D[542]), # 0410
    ("地图一角", D[542]), # 0411
    ("电击网", D[556]), # 0412
    ("十连胜之证", D[557]), # 0413
    ("二十连胜之证", D[558]), # 0414
    ("三十连胜之证", D[559]), # 0415
    ("所罗门手套", D[560]), # 0416
    ("所罗门之靴", D[561]), # 0417
    ("所罗门之盔", D[562]), # 0418
    ("所罗门之铠", D[563]), # 0419
    ("所罗门之剑", D[564]), # 041A
)
del D

ITEMS = tuple(item[0] for item in ITEMS_DATA)

def itemof(start, end, can_empty=True):
    return ItemProvider(ITEMS, start, end, can_empty)

HUMEN_ITEMS = itemof(0x013F, 0x0310) # 人类道具
EQUIP_WEAPON = itemof(0x0001, 0x0064) # 武器
EQUIP_HEAD = itemof(0x0064, 0x0077) # 头部装备
EQUIP_BODY = itemof(0x0077, 0x0090) # 上身装备
EQUIP_HAND = itemof(0x0090, 0x009A) # 手部装备
EQUIP_FOOT = itemof(0x009A, 0x00A5) # 脚部装备
EQUIP_ORN = itemof(0x00A5, 0x00BF) # 装饰
ALL_EQUIP = itemof(0x0001, 0x00BF) # 全部人类装备
CHARIOT_CHASSIS = itemof(0x010A, 0x012B) # 底盘
CHARIOT_ITEM = itemof(0x0310, 0x0343) # 战车道具
CHARIOT_ALL_ITEM = itemof(0x00BF, 0x013F) + CHARIOT_ITEM # 全部战车物品
SPECIAL_BULLETS = itemof(0x0343, 0x0352) # 特殊炮弹
SPECIAL_SKILLS = itemof(0x0352, 0x03DF) # 特技
OTHER_ITEMS = itemof(0x03DF, 0x041B) # 其他类道具
ALL_HUMEN_ITEM = HUMEN_ITEMS + ALL_EQUIP + OTHER_ITEMS

ITEM_HEADS = (
    ("名称", "说明", "人攻/人防/强度", "重量", "攻击/载重/防御+", "弹仓"),
    (240, 400, 200, 80, 200, 80),
)

SPECIAL_BULLETS = ()


WANTED_LIST = (

)
WANTED_STATUS = ("未击败", "击破", "已领赏金")
WANTED_STATUS_VALUES = (0, 0x63, 0xE3)
