from lib import utils
from lib.hack.utils import ItemProvider


PERSONS = ("主角",) + tuple("同伴%d" % i for i in range(1, 16))
CHARIOTS = tuple("No.%d" % i for i in range(1, 13))

RATE = ('1', '2', '4', '8', '16', '32', '64', '128')
RATE_VALUES = (0x00, 0x00C8, 0x0190, 0x0320, 0x0640, 0x0C80, 0x1900, 0x3200)

FIGURES = ("主角(男)", "猎人(男)", "机械师(男)", "战士(男)", "护士(男)", "摔跤手(男)", "艺术家(男)", "艾克赛尔",
    "主角(女)", "猎人(女)", "机械师(女)", "战士(女)", "护士(女)", "摔跤手(女)", "艺术家(女)",
    "波奇(狗)", "贝罗(狗)", "哈奇(狗)", "米西卡", "食金虫",
)

SUBPROFS = ("猎人", "机械师", "战士", "护士", "摔跤手", "艺术家", "狗(慎用)", "食金虫(慎用)")

HOLE_TYPE, HOLE_TYPE_VALUES = utils.split_value_label((
    (0x0, "关"),
    (0x1, "主炮类"),
    (0x11, "副炮类"),
    (0x13, "副炮类"),
    (0x1F, "S-E类"),
))

DOUBLE_TYPE = ("单引擎 单C装置", "双引擎", "", "双C装置")


ITEMS = (
    "无", # 000
# 炮弹
    "榴弹", # 001
    "凝固气体弹", # 002
    "冷冻弹", # 003
    "毒气弹", # 004
    "催眠瓦斯弹", # 005
    "麻痹瓦斯弹", # 006
    "钢弹", # 007
    "定向爆破弹", # 008
    "APFSDS弹", # 009
    "水泥弹", # 00A
    "钻头弹", # 00B
    "火箭弹", # 00C
    "哑弹", # 00D
    "恐慌弹", # 00E
    "鱼类弹", # 00F

# 恢复道具
    "无掉落物", # 010
    "全恢复饮料", # 011
    "魔女之药", # 012
    "回復饮料ＥＸ", # 013
    "桑波斯饮料", # 014
    "能量注射器", # 015
    "大神社的清水", # 016
    "能量胶囊", # 017
    "回復饮料", # 018
    "感克星Ｚ", # 019
    "回復胶囊", # 01A
    "麻醉胶囊", # 01B
    "沙华根", # 01C
    "拉面罐头", # 01D
    "咖喱便当", # 01E
    "海女便当", # 01F
    "活力便当", # 020
    "甜蜜瓜", # 021
    "再生胶囊", # 022
    "最強蜂王浆", # 023
    "ＤＸ按摩棒", # 024
    "超级解麻药", # 025
    "解麻药", # 026
    "碱性石蜡", # 027
    "除酸喷雾", # 028
    "除酸乳液", # 029
    "咖啡因药剂", # 02A
    "急救包", # 02B

# 战斗道具
    "观察仪", # 02C
    "侦查仪", # 02D
    "ＤＤＴ喷雾", # 02E
    "浓缩甲基", # 02F
    "冰冻酒瓶ＤＸ", # 030
    "冰冻酒瓶", # 031
    "硝化酒瓶ＤＸ", # 032
    "硝化酒瓶", # 033
    "火炎瓶", # 034
    "危险的蜡烛", # 035
    "狂战士罐头", # 036
    "外道兴奋剂", # 037
    "龙舌兰提取物", # 038
    "兴奋剂", # 039
    "提速剂", # 03A
    "炎热克星", # 03B
    "灭火器", # 03C
    "寒冷克星", # 03D
    "热电磁怀炉", # 03E
    "携带保护罩Ｌ", # 03F
    "携带保护罩Ｓ", # 040
    "错乱ＨＩ", # 041
    "睡眠ＤＸ", # 042
    "发烟筒", # 043
    "烟幕火花", # 044
    "沙华菠萝弹", # 045
    "ＲＰＧ７", # 046
    "ＤＤ菠萝弹", # 047
    "金造的盂兰盆", # 048
    "母老虎炸弹", # 049
    "手榴弹", # 04A
    "铅笔导弹", # 04B
    "火箭礼花", # 04C
    "易投的石头", # 04D
    "难投的石头", # 04E
    "轻石", # 04F
    "奇怪海带", # 050
    "藤壶手枪", # 051
    "超级波奇能量瓶", # 052
    "波奇能量瓶", # 053
    "波奇骨头", # 054
    "汪汪能量剂", # 055
    "汪汪饮料", # 056
    "信号弹", # 057
    "食金虫的箱子", # 058
    "装有食金虫的瓶子", # 059

# 道具
    "H书籍", # 05A
    "i护目镜", # 05B
    "LOVE机器(小回复)", # 05C
    "LOVE机器(中回复)", # 05D
    "LOVE机器(大回复)", # 05E
    "LOVE机器(去除人类酸腐蚀)", # 05F
    "LOVE机器(灭火，去冷气)", # 060
    "LOVE机器(点唱机)", # 061
    "LOVE机器(强化战犬)", # 062
    "LOVE机器(强化女性角色)", # 063
    "LOVE机器(模仿猫叫)", # 064
    "LOVE机器(改主角名)", # 065
    "LOVE机器(减小遇敌几率)", # 066
    "LOVE机器(战斗中挖洞)", # 067
    "LOVE机器(敌人随机异常状态)", # 068
    "LOVE机器(游戏机)", # 069
    "LOVE机器(两倍金钱)", # 06A
    "LOVE机器(攻击昆虫敌人)", # 06B
    "LOVE机器(可爱贴纸)", # 06C
    "LOVE机器(毒气攻击)", # 06D
    "LOVE机器(音波攻击)", # 06E
    "LOVE机器(电气攻击)", # 06F
    "LOVE机器(火焰攻击)", # 070
    "LOVE机器(冷气攻击)", # 071
    "LOVE机器(光束攻击)", # 072
    "LOVE机器(笑声)", # 073
    "LOVE机器(改全体同伴名)", # 074
    "LOVE机器(电磁防护罩)", # 075
    "LOVE机器(改全体同伴名)", # 076
    "LOVE机器(解除单体麻痹、睡眠、混乱)", # 077
    "LOVE机器(解除全体麻痹、睡眠、混乱)", # 078
    "LOVE机器(多种喷漆效果)", # 079
    "LOVE机器(几率复活)", # 07A
    "LOVE机器(两倍经验)", # 07B
    "LOVE机器(提升速度)", # 07C
    "LOVE机器(提升攻击力)", # 07D
    "LOVE机器(提升能力)", # 07E
    "LOVE机器(提高火焰、冷气攻击效果)", # 07F
    "LOVE机器(提高毒气、闪电攻击效果)", # 080
    "LOVE机器(提高光束、音波攻击效果)", # 081
    "LOVE机器(提升多种能力)", # 082
    "LOVE机器(战斗中补充装甲)", # 083
    "LOVE机器(提高遇敌几率)", # 084
    "LOVE机器(全体HP小回复)", # 085
    "LOVE机器(全体HP中回复)", # 086
    "LOVE机器(全体HP大回复)", # 087
    "LOVE机器(怪物闪光)", # 088
    "LOVE机器(怪物闪(强)光)", # 089
    "LOVE机器(怪物闪(刺眼)光)", # 08A
    "LOVE机器(音波保护罩)", # 08B
    "LOVE机器(电气保护罩)", # 08C
    "LOVE机器(光束保护罩)", # 08D
    "LOVE机器(毒气保护罩)", # 08E
    "LOVE机器(火焰保护罩)", # 08F
    "LOVE机器(冷气保护罩)", # 090
    "LOVE机器(怪物闪(微)光)", # 091
    "LOVE机器(烟幕)", # 092
    "究极金属探测器", # 093
    "超级金属探测器", # 094
    "金属探测器", # 095
    "地雷探测器", # 096
    "避敌喷雾", # 097
    "遇敌喷雾", # 098
    "迈克尔头盔", # 099
    "金轮际拖把", # 09A
    "洗车拖把", # 09B
    "黑客钥匙", # 09C
    "同步装置", # 09D
    "神秘的钥匙", # 09E
    "禁闭室的钥匙", # 09F
    "门多萨的钥匙", # 0A0
    "游戏君", # 0A1
    "恶之福袋", # 0A2
    "什锦蚊香", # 0A3
    "筋肉美容套件", # 0A4
    "礼花套装", # 0A5
    "汪汪美食", # 0A6
    "重命名贴纸", # 0A7
    "界限突破因子", # 0A8
    "胡须定型液", # 0A9
    "假眉毛", # 0AA
    "纹身贴纸", # 0AB
    "男人精华", # 0AC
    "草莓口紅", # 0AD
    "苹果腮红", # 0AE
    "美肌乳液", # 0AF
    "緑色喷漆罐", # 0B0
    "赤色喷漆罐", # 0B1
    "青色喷漆罐", # 0B2
    "甜点喷漆", # 0B3
    "桃色喷漆罐", # 0B4
    "白金喷漆", # 0B5
    "秘密贴纸", # 0B6
    "欢乐贴纸", # 0B7
    "豪华贴纸", # 0B8
    "随意贴纸", # 0B9
    "邪恶贴纸", # 0BA
    "可爱贴纸", # 0BB
    "白金贴纸", # 0BC
    "坷垃碳", # 0BD
    "进军喇叭", # 0BE
    "灭蚊喷雾", # 0BF
    "液体蚊香", # 0C0
    "蚊香", # 0C1
    "腐烂的高汤", # 0C2
    "Ｌ１－ＩＣ芯片", # 0C3
    "Ｌ２－ＩＣ芯片", # 0C4
    "Ｌ３－ＩＣ芯片", # 0C5
    "Ｏ１－ＩＣ芯片", # 0C6
    "Ｏ２－ＩＣ芯片", # 0C7
    "Ｏ３－ＩＣ芯片", # 0C8
    "Ｖ１－ＩＣ芯片", # 0C9
    "Ｖ２－ＩＣ芯片", # 0CA
    "Ｖ３－ＩＣ芯片", # 0CB
    "Ｅ１－ＩＣ芯片", # 0CC
    "Ｅ２－ＩＣ芯片", # 0CD
    "Ｅ３－ＩＣ芯片", # 0CE
    "恶之照片", # 0CF
    "恶之照片", # 0D0
    "恶之照片", # 0D1
    "恶之照片", # 0D2
    "恶之照片", # 0D3
    "恶之照片", # 0D4
    "恶之照片", # 0D5
    "恶之照片", # 0D6
    "恶之照片", # 0D7
    "恶之照片", # 0D8
    "恶之照片", # 0D9
    "恶之照片", # 0DA
    "恶之照片", # 0DB
    "恶之照片", # 0DC
    "恶之照片", # 0DD
    "潜能耳机", # 0DE
    "宇宙炮说明书", # 0DF
    "会员卡", # 0E0
    "修理包", # 0E1
    "机械师套装", # 0E2
    "超级稀有金属", # 0E3
    "稀有金属", # 0E4
    "高纯度金属", # 0E5
    "普通金属", # 0E6
    "硬弹壳", # 0E7
    "软弹壳", # 0E8
    "ＡＰＦＳ弹壳", # 0E9
    "锥形聚能弹壳", # 0EA
    "金属弹壳", # 0EB
    "钻头", # 0EC
    "穿甲弹壳", # 0ED
    "火箭弹壳", # 0EE
    "炸药", # 0EF
    "凝固汽油罐", # 0F0
    "冷冻气体罐", # 0F1
    "毒气罐", # 0F2
    "催眠气体罐", # 0F3
    "麻痹气体罐", # 0F4
    "黏着剂罐", # 0F5
    "混乱气体罐", # 0F6
    "推进剂罐", # 0F7
    "接近触发保险", # 0F8
    "冲级触发保险", # 0F9
    "汇流环", # 0FA
    "门罗炸药", # 0FB
    "含碘海带", # 0FC
    "迷之橡胶气球", # 0FD
    "铁鱼翅", # 0FE
    "亚当蚁羽翼", # 0FF
    "变种犀牛角", # 100
    "超流动核心", # 101
    "某种电子零件", # 102
    "白金棒", # 103
    "金棒", # 104
    "银锭", # 105
    "铜锭", # 106
    "金假牙", # 107
    "银假牙", # 108
    "金戒指", # 109
    "陈年葡萄酒", # 10A
    "陈年威士忌", # 10B
    "陈年白兰地", # 10C
    "陈年龙舌兰", # 10D
    "陈年伏特加", # 10E
    "陈年利口酒", # 10F
    "魔芋", # 110
    "滑溜溜细胞", # 111
    "冷冰冰细胞", # 112
    "兔肉", # 113
    "猪肉", # 114
    "蛇肉", # 115
    "蚂蚁腿", # 116
    "龟肉", # 117
    "迷之肉", # 118
    "鼠肉", # 119
    "恐贝刺身", # 11A
    "信天翁胸肉", # 11B
    "信天翁翅膀", # 11C
    "鳄鱼腿", # 11D
    "注射鸟羽", # 11E
    "巨大鱼翅", # 11F
    "水母的触手", # 120
    "海参片", # 121
    "滑溜溜黄金細胞", # 122
    "黄金兔子肉", # 123
    "黄金猪肉", # 124
    "黄金蛇肉", # 125
    "黄金蚂蚁腿", # 126
    "黄金龟肉", # 127
    "沙漠萝卜根", # 128
    "水母的心脏", # 129
    "蓝色蟹钳", # 12A
    "波波毛", # 12B
    "蚂蚁卵", # 12C
    "辐射花汁", # 12D
    "古旧的硬币", # 12E
    "肮脏的硬币", # 12F
    "某人的钱包", # 130
    "达拉斯的钱包", # 131
    "姐姐的毛巾", # 132
    "妹妹的毛巾", # 133
    "蓝色的羽毛", # 134
    "圣经", # 135
    "玛利亚的项链", # 136
    "料理本", # 137
    "咖喱粉", # 138
    "电击遥控器", # 139
    "金项链", # 13A
    "银项链", # 13B
    "购买物品列表", # 13C
    "给维罗纳的信", # 13D
    "间谍笔记", # 13E
    "白色纸片", # 13F
    "红色纸片", # 140
    "密码纸条１", # 141
    "密码纸条２", # 142
    "密码纸条３", # 143
    "艾巴的笔记", # 144
    "破破烂烂的信", # 145
    "阿丽的信", # 146
    "阿丽的戒指", # 147
    "陈旧的笔记", # 148
    "达尼的日记", # 149
    "大佐的日记", # 14A
    "船员的航海日记", # 14B
    "银制八音盒", # 14C
    "卡特的行李", # 14D
    "依琪的行李", # 14E
    "妮露的礼物", # 14F
    "大佐的识别证", # 150
    "发电所的ＩＤ卡", # 151
    "ＩＤ卡Ａ", # 152
    "ＩＤ卡Ｂ", # 153
    "大佐的ＩＤ卡", # 154
    "发电厂ID卡", # 155
    "贵宾卡", # 156
    "伏思明的写真", # 157
    "摩托的钥匙", # 158
    "马达", # 159
    "螺旋桨", # 15A
    "燃料电池", # 15B
    "原子力电池", # 15C
    "安妮的戒指", # 15D
    "破碎的项圈", # 15E
    "防腐剤", # 15F
    "麻药素", # 160
    "退烧药", # 161
    "原子稳定剂", # 162
    "弹珠", # 163
    "古老的纸币", # 164
    "陈旧的卡", # 165
    "老旧的漫画书", # 166
    "２０００円札", # 167
    "耀眼的圆盘", # 168
    "录影带Ｈ", # 169
    "认证芯片", # 16A
    "神经元", # 16B
    "神经元", # 16C
    "神经元", # 16D
    "神经元", # 16E

# 头部装备
    "男子汉头带", # 16F
    "朴素的帽子", # 170
    "锅盖", # 171
    "野球帽", # 172
    "虎纹帽", # 173
    "波奇头盔", # 174
    "波奇护目镜", # 175
    "护目镜帽", # 176
    "焊接安全盔", # 177
    "战士包头巾", # 178
    "护士帽", # 179
    "迷彩贝雷帽", # 17A
    "ＶＩＰ浴帽", # 17B
    "埃及帽", # 17C
    "斯坎克斯贝雷帽", # 17D
    "复制贝雷帽", # 17E
    "正坐帽子", # 17F
    "护目镜帽Ⅱ", # 180
    "蓝色护目镜", # 181
    "怪力包头巾", # 182
    "安全帽", # 183
    "防弹假发", # 184
    "医用面具", # 185
    "波奇面具", # 186
    "铁锅", # 187
    "战国头盔", # 188
    "纤维帽子", # 189
    "波奇安全盔", # 18A
    "ＣＶＣ安全帽", # 18B
    "塞西尔帽子", # 18C
    "英雄假面", # 18D
    "神风王冠", # 18E
    "曲棍球面具", # 18F
    "布鲁头盔", # 190
    "萨拉托加头盔", # 191
    "斯特的宽边帽", # 192
    "奥托的宽边帽", # 193
    "鹰假面", # 194
    "LOVE机器", # 195
    "长田英树狐耳", # 196
    "快乐头盔", # 197
    "多明毛", # 198
    "缪特假发", # 199
    "蛾帽子", # 19A

# 上身装备
    "男子汉腹卷", # 19B
    "红色内裤", # 19C
    "便衣", # 19D
    "骷髅夹克", # 19E
    "人妻连衣裙", # 19F
    "运动裤", # 1A0
    "华丽的裙子", # 1A1
    "女仆装", # 1A2
    "穿旧了的西装", # 1A3
    "牛仔工作服", # 1A4
    "人妻浴衣", # 1A5
    "抗弾白衣", # 1A6
    "活力裤袜", # 1A7
    "黒色棒球服", # 1A8
    "人妻睡衣", # 1A9
    "蓝领布衣", # 1AA
    "迷彩服", # 1AB
    "皮制工作服", # 1AC
    "红色队服", # 1AD
    "波奇运动服", # 1AE
    "ＶＩＰ浴衣", # 1AF
    "桑拿紧身衣", # 1B0
    "飞行服", # 1B1
    "安全服", # 1B2
    "波奇背心", # 1B3
    "战斗紧身衣", # 1B4
    "潜水服", # 1B5
    "医疗服", # 1B6
    "波奇夹克", # 1B7
    "铁文胸", # 1B8
    "反射西装", # 1B9
    "迷彩西装", # 1BA
    "迷彩紧身衣", # 1BB
    "沙华叶", # 1BC
    "消防服", # 1BD
    "特技服", # 1BE
    "高开叉装甲", # 1BF
    "加西亚披风", # 1C0
    "战国铠甲", # 1C1
    "ＣＶＣ服", # 1C2
    "塞西尔的背心", # 1C3
    "波奇服", # 1C4
    "防弹旗袍", # 1C5
    "护盾披风", # 1C6
    "防虫装", # 1C7
    "天鹅紧身衣", # 1C8
    "筋肉比基尼", # 1C9
    "金属外套", # 1CA
    "波奇金属装", # 1CB
    "透视装甲", # 1CC
    "炙热行者", # 1CD
    "弗洛克护甲", # 1CE
    "波奇护甲", # 1CF
    "萨拉托加服", # 1D0
    "萨拉托加护甲", # 1D1
    "镜面比基尼", # 1D2
    "LOVE机器", # 1D3
    "烧焦的夹克", # 1D4
    "缪特之皮", # 1D5
    "阿梅达尔背心", # 1D6
    "蒸镀盔甲", # 1D7

# 手部装备
    "男子汉手套", # 1D8
    "橡胶手套", # 1D9
    "厨师手套", # 1DA
    "军手", # 1DB
    "格斗护手", # 1DC
    "皮手套", # 1DD
    "波奇铁爪", # 1DE
    "银手套", # 1DF
    "美式指套", # 1E0
    "艺术手套", # 1E1
    "波奇钢爪", # 1E2
    "摔跤手套", # 1E3
    "重金属手套", # 1E4
    "力量输液手套", # 1E5
    "敏捷输液手套", # 1E6
    "驾驶员手套", # 1E7
    "黄金手套", # 1E8
    "回復输液手套", # 1E9
    "技师手套", # 1EA
    "推力手套", # 1EB
    "怪力手套", # 1EC
    "CVC手套", # 1ED
    "塞西尔的手套", # 1EE
    "大夫力士的手套", # 1EF
    "防弹手套", # 1F0
    "护手甲", # 1F1
    "萨拉托加手套", # 1F2
    "奥托皮奇手套", # 1F3
    "横纲力士手套", # 1F4
    "三冠手套", # 1F5
    "猛虎手套", # 1F6
    "LOVE机器", # 1F7
    "缪特之爪", # 1F8

# 脚部装备
    "男人味袜子", # 1F9
    "减肥拖鞋", # 1FA
    "胶底袜子", # 1FB
    "长满苔藓的凉鞋", # 1FC
    "足球鞋", # 1FD
    "满是海藻的鞋子", # 1FE
    "英式长靴", # 1FF
    "橡胶长靴", # 200
    "人妻长筒袜", # 201
    "猎人靴", # 202
    "焊接靴", # 203
    "斗技靴", # 204
    "艺术靴", # 205
    "牛仔靴", # 206
    "铁束靴", # 207
    "商人靴", # 208
    "厚底靴", # 209
    "战斗钉鞋", # 20A
    "士兵长靴", # 20B
    "波奇紧身裤", # 20C
    "战斗长筒袜", # 20D
    "铁木屐", # 20E
    "安全靴", # 20F
    "神风高跟鞋", # 210
    "神风长靴", # 211
    "医用靴", # 212
    "鳄鱼长靴", # 213
    "战国靴", # 214
    "波奇护腿", # 215
    "金属护腿", # 216
    "CVC靴", # 217
    "塞西尔的袜子", # 218
    "多层靴", # 219
    "夫人长靴", # 21A
    "料斗鞋", # 21B
    "萨拉托加鞋", # 21C
    "斯特皮奇鞋", # 21D
    "保镖鞋", # 21E
    "LOVE机器", # 21F
    "缪特之鞋", # 220
    "太妹皮靴", # 221

# 装饰
    "伊米尔的挂饰", # 222
    "天使头环", # 223
    "粗制的围巾", # 224
    "邹巴巴的领带", # 225
    "艾丽泽的耳塞", # 226
    "太阳镜", # 227
    "红宝石吊坠", # 228
    "宝石发饰", # 229
    "水间勇一的眼镜", # 22A
    "古洛文血细胞", # 22B
    "藤壶眼镜", # 22C
    "喀秋莎发箍", # 22D
    "接地尾巴", # 22E
    "亚当蚁的晶体", # 22F
    "人妻耳环", # 230
    "骷髅吊坠", # 231
    "低应力安眠枕", # 232
    "红色围巾", # 233
    "钢之发饰", # 234
    "防毒面具", # 235
    "尘埃羽饰", # 236
    "镜面面纱", # 237
    "纤维耳机", # 238
    "中奖芯片", # 239
    "旗鱼玛瑙眼", # 23A
    "危险导火线", # 23B
    "塞西尔的手带", # 23C
    "雪莉爱塔帽子", # 23D
    "猎人探测器", # 23E
    "公子核心", # 23F
    "海星細胞", # 240
    "卡里奥披风", # 241
    "天鹅戒指", # 242
    "大人的披风", # 243
    "三冠腰带", # 244
    "活体细胞", # 245
    "防弹衣碎片", # 246
    "屏障贴纸", # 247
    "绯牡丹缠腰布", # 248
    "防弹马甲", # 249
    "硅胶胸垫", # 24A
    "陶瓷片", # 24B
    "液态聚合物", # 24C
    "洛斯特背心", # 24D
    "医用护盾", # 24E
    "护士铁牌", # 24F
    "护士护盾", # 250
    "生命护盾", # 251
    "树怪护盾", # 252
    "波奇衣领", # 253
    "波奇自行车", # 254
    "波奇汽车", # 255
    "波奇坦克", # 256
    "超级波奇坦克", # 257
    "LOVE机器(男子气概+99)", # 258
    "LOVE机器(男子气概-99)", # 259
    "手织围巾", # 25A
    "欢乐戒指", # 25B
    "碳素纳米触角", # 25C
    "缪特之尾", # 25D
    "奥尔加眼镜", # 25E
    "金手指披风", # 25F

# 武器
    "空手", # 260
    "弹弓", # 261
    "散射弩", # 262
    "铁管", # 263
    "金轮际圆月轮", # 264
    "弩枪", # 265
    "前端开叉的勺子", # 266
    "铁鹿角", # 267
    "折椅", # 268
    "燃烧炮", # 269
    "水中銃", # 26A
    "亚当蚁的前足", # 26B
    "手枪", # 26C
    "豪爽三振斧", # 26D
    "艺术麦克风", # 26E
    "散弹枪", # 26F
    "回旋镖扳手", # 270
    "巨大注射器", # 271
    "危险的球棒", # 272
    "贝罗伊德连射枪", # 273
    "ＳＭＧ乌兹", # 274
    "波奇枪", # 275
    "超合金椅子", # 276
    "危险的匕首", # 277
    "毒气枪", # 278
    "铆钉枪", # 279
    "电击统", # 27A
    "萝卜棍", # 27B
    "Ｗ－链锯", # 27C
    "激光枪", # 27D
    "音波枪", # 27E
    "危险的斧头", # 27F
    "大马士革菜刀", # 280
    "黄金麦克风", # 281
    "黄金伐木斧", # 282
    "波奇火焰炮", # 283
    "火炎銃", # 284
    "手持火神炮", # 285
    "双管猎枪", # 286
    "绯牡丹短刀", # 287
    "波奇火神炮", # 288
    "超声波扩音器", # 289
    "４４马格南", # 28A
    "冷冻銃", # 28B
    "沙蛟弯刀", # 28C
    "遥控扳手", # 28D
    "杀虫枪", # 28E
    "刺锤", # 28F
    "超级光线枪", # 290
    "飞龙火", # 291
    "火焰枪", # 292
    "８１ｍｍ战锤", # 293
    "电击鞭", # 294
    "火箭炮", # 295
    "波奇火箭炮", # 296
    "超级扳手", # 297
    "超级注射器", # 298
    "激光来福枪", # 299
    "青龙刀", # 29A
    "超级麦克风", # 29B
    "斯坎枪", # 29C
    "沙藻土爆药弓", # 29D
    "波奇镭射枪", # 29E
    "暴雪弓", # 29F
    "棱镜枪", # 2A0
    "重金属枪", # 2A1
    "波奇超声波", # 2A2
    "火炎放射器", # 2A3
    "超音波銃", # 2A4
    "超氧化物巴特雷枪", # 2A5
    "酸铁炮", # 2A6
    "木村麦克风", # 2A7
    "波奇之血", # 2A8
    "改良型边缘发火枪", # 2A9
    "楼梯肝", # 2AA
    "暴雪激光枪", # 2AB
    "ＳＭＧ榴弹炮", # 2AC
    "闪电天鹅", # 2AD
    "波奇防护罩", # 2AE
    "杀人电锯", # 2AF
    "象牙装饰的手枪", # 2B0
    "波奇火箭发射器", # 2B1
    "介错刀", # 2B2
    "冲击鞭", # 2B3
    "加西亚枪", # 2B4
    "性感双剑", # 2B5
    "改造斯坎枪", # 2B6
    "１３０ｍｍ宙斯", # 2B7
    "究极老鹰", # 2B8
    "火箭飞拳", # 2B9
    "波奇翼炮", # 2BA
    "保镖光线", # 2BB
    "波奇电钻", # 2BC
    "超级杀虫枪", # 2BD
    "片腕翼炮", # 2BE
    "波奇闪电", # 2BF
    "马赫声波枪", # 2C0
    "古洛文之眼", # 2C1
    "剪刀手", # 2C2
    "汉子马格南", # 2C3
    "往复式扳手", # 2C4
    "波奇暴风雪", # 2C5
    "多弾发射暴动枪", # 2C6
    "鬼厨刀", # 2C7
    "絶命注射器", # 2C8
    "佐藤安烈麦克风", # 2C9
    "荒野烈火", # 2CA
    "寒冰巨龙", # 2CB
    "光束刀", # 2CC
    "音速扳手", # 2CD
    "波奇加农炮", # 2CE
    "啸声炮", # 2CF
    "浪潮针刺", # 2D0
    "布罗拉喷焰器", # 2D1
    "等离子风暴", # 2D2
    "空间麦克风", # 2D3
    "卡里奥麦克风", # 2D4
    "硝基花洒", # 2D5
    "电子旗鱼Ｍｋ５０", # 2D6
    "电磁啸清者", # 2D7
    "ＴＮＴ偏执狂", # 2D8
    "欧米茄冲击波", # 2D9
    "激光炮", # 2DA
    "波奇地狱炎", # 2DB
    "巫毒炮筒", # 2DC
    "单手持突击步枪", # 2DD
    "光粒子电光", # 2DE
    "雷电之羽", # 2DF
    "莫西干切割者", # 2E0
    "LOVE机器(火炎)", # 2E1
    "LOVE机器(音波)", # 2E2
    "LOVE机器(冷气)", # 2E3
    "LOVE机器(瓦斯)", # 2E4
    "LOVE机器(光束)", # 2E5
    "LOVE机器(电气)", # 2E6
    "LOVE机器(通常)", # 2E7
    "LOVE机器(通常)", # 2E8
    "LOVE机器(通常)", # 2E9
    "蟹背喷火器", # 2EA
    "蜈蚣火炬", # 2EB
    "树怪棒槌", # 2EC
    "阿梅达尔钢爪", # 2ED
    "多明戈斯机枪", # 2EE
    "喷射链锯", # 2EF
    "蜈蚣马格南", # 2F0
    "斩车刀", # 2F1
    "６６６群蜂炮", # 2F2
    "６６６火箭炮", # 2F3

# 战车物品
    "空", # 2F4
    "传真系统", # 2F5
    "露营好帮手", # 2F6
    "医疗箱", # 2F7
    "装甲包１００", # 2F8
    "装甲包２５０", # 2F9
    "装甲包５００", # 2FA
    "装甲包Ｌ", # 2FB
    "装甲包ＬＬ", # 2FC
    "雷龙装甲片", # 2FD
    "医疗装置", # 2FE
    "换气装置", # 2FF
    "迷彩伪装", # 300
    "迷彩伪装Ｇ", # 301
    "叫卖扬声器", # 302
    "电气喇叭Ｌ", # 303
    "碱性防护膜", # 304
    "镜面防护膜", # 305
    "静默防护膜", # 306
    "防火防护膜", # 307
    "耐寒防护膜", # 308
    "接地链", # 309
    "海龟蓑衣", # 30A
    "毛绒兔兔", # 30B
    "安全护符", # 30C
    "废铁", # 30D
    "废铁", # 30E
    "废铁", # 30F
    "废铁", # 310
    "废铁", # 311
    "废铁", # 312
    "废铁", # 313
    "废铁", # 314
    "废铁", # 315
    "废铁", # 316
    "钢铁之卵", # 317
    "高科技废铁", # 318
    "高科技废铁", # 319
    "高科技废铁", # 31A
    "高科技废铁", # 31B
    "高科技废铁", # 31C
    "阿朵的行李", # 31D
    "德尔塔利奥的货物", # 31E
    "以斯拉港的货物", # 31F
    "摩罗波克的货物", # 320
    "可疑的货物", # 321
    "实时连击内核", # 322
    "宇宙零件＋", # 323
    "宇宙零件＋＋＋", # 324
    "宇宙零件＋１０", # 325
    "宇宙零件＋", # 326
    "宇宙零件＋＋＋", # 327
    "宇宙零件＋１０", # 328
    "宇宙零件＋", # 329
    "宇宙零件＋＋＋", # 32A
    "宇宙零件＋", # 32B
    "宇宙零件＋５", # 32C
    "宇宙零件＋", # 32D
    "宇宙零件＋＋＋", # 32E
    "宇宙零件＋１０", # 32F
    "宇宙零件＋", # 330
    "宇宙零件＋＋＋", # 331
    "宇宙零件＋１０", # 332
    "宇宙零件＋", # 333
    "宇宙零件＋＋＋", # 334
    "宇宙零件＋１０", # 335
    "超光速物质", # 336
    "铅化蘑菇", # 337
    "巨大铅化蘑菇", # 338
    "鸟粪", # 339
    "LOVE机器(换气)", # 33A
    "稀有金属玉", # 33B
    "冥界车轮", # 33C
    "黑钢锁", # 33D
    "金色头冠", # 33E
    "医疗箱ＥＸ", # 33F
    "梦幻铁块", # 340

# 引擎
    "生锈的引擎", # 341
    "锨头引擎", # 342
    "锨头引擎改", # 343
    "锨头引擎Ｔ", # 344
    "锨头引擎ＴＴ", # 345
    "村正", # 346
    "涡轮村正", # 347
    "硝基村正", # 348
    "火箭村正", # 349
    "甲壳虫", # 34A
    "甲壳虫改", # 34B
    "涡轮甲壳虫", # 34C
    "涡轮甲壳虫Ⅱ", # 34D
    "强哥", # 34E
    "猛力强哥", # 34F
    "ＤＯＨＣ强哥", # 350
    "电子制御强哥", # 351
    "千代富士", # 352
    "千代富士涡轮", # 353
    "双驱动千代富士Ｔ", # 354
    "三驱动千代富士Ｔ", # 355
    "柴油３０００", # 356
    "公牛", # 357
    "强力公牛", # 358
    "欧米茄公牛", # 359
    "神奇公牛", # 35A
    "苦力", # 35B
    "強力苦力", # 35C
    "最強苦力", # 35D
    "超絶苦力", # 35E
    "虎式涡轮", # 35F
    "龙卷", # 360
    "龙卷Ⅱ", # 361
    "龙卷Ⅲ", # 362
    "龙卷Ⅳ", # 363
    "龙卷Ⅴ", # 364
    "脉冲", # 365
    "脉冲涡轮", # 366
    "脉冲涡轮Ⅱ", # 367
    "脉冲涡轮Ⅲ", # 368
    "超级脉冲", # 369
    "鲤鱼引擎１", # 36A
    "鲤鱼引擎２", # 36B
    "鲤鱼引擎３", # 36C
    "鲤鱼引擎４", # 36D
    "鲤鱼引擎５", # 36E
    "鲤鱼引擎６", # 36F
    "火箭青龙", # 370
    "Ｖ６天马", # 371
    "白虎加速器", # 372
    "延克公牛", # 373
    "辅助增压涡轮", # 374
    "Ｖ２４巨人", # 375
    "Ｖ３２巨人", # 376
    "Ｖ４８巨人", # 377
    "Ｖ６４巨人", # 378
    "鲁道夫", # 379
    "鲁道夫涡轮", # 37A
    "鲁道夫双驱动Ｔ", # 37B
    "鲁道夫变气门引擎", # 37C
    "旋风", # 37D
    "慢爬", # 37E
    "螺旋", # 37F
    "风精灵α", # 380
    "风精灵β", # 381
    "风精灵γ", # 382
    "风精灵Ω", # 383
    "裸装卡门", # 384
    "ＯＨＣ卡门", # 385
    "涡轮卡门", # 386
    "火箭卡门", # 387
    "二重火箭卡门", # 388
    "雷龙引擎", # 389
    "超级雷龙引擎", # 38A
    "究极雷龙引擎", # 38B
    "雷龙王引擎", # 38C
    "朋友", # 38D
    "好朋友", # 38E
    "千兆朋友", # 38F
    "強力朋友", # 390
    "黄金朋友", # 391
    "欧米茄朋友", # 392
    "最终朋友", # 393
    "上帝朋友", # 394
    "幼师鱼涡轮", # 395
    "小师鱼涡轮", # 396
    "中师鱼涡轮", # 397
    "成年师鱼涡轮", # 398
    "大师鱼涡轮", # 399
    "巨师鱼涡轮", # 39A
    "千年师鱼涡轮", # 39B
    "千年师鱼涡轮Ｆ", # 39C
    "千年师鱼涡轮Ｇ", # 39D
    "玄武涡轮", # 39E
    "玄武双涡轮", # 39F
    "玄武涡轮Ⅲ", # 3A0
    "玄武涡轮Ｚ", # 3A1
    "维纳斯喷气", # 3A2
    "维纳斯喷气Ｗ", # 3A3
    "维纳斯喷气Ｓ", # 3A4
    "Ｖ４８金刚", # 3A5
    "Ｖ６６金刚", # 3A6
    "Ｖ１００金刚", # 3A7
    "Ｔ－暴龙改", # 3A8
    "飞鱼引擎α", # 3A9
    "飞鱼引擎Δ", # 3AA
    "飞鱼引擎Θ", # 3AB
    "戴达罗斯", # 3AC
    "戴达罗斯Ⅱ", # 3AD
    "戴达罗斯Ⅲ", # 3AE
    "无双驱动", # 3AF
    "生物引擎", # 3B0
    "涡轮生物", # 3B1
    "ＤＯＨＣ生物", # 3B2
    "电子制御生物", # 3B3
    "喷气式生物", # 3B4
    "欧米茄生物", # 3B5
    "光子力喷气", # 3B6
    "LOVE机器(49.00)", # 3B7
    "LOVE机器(68.00)", # 3B8
    "LOVE机器(83.00)", # 3B9
    "前兆", # 3BA
    "陨石驱动", # 3BB

# C装置
    "生锈的C装置", # 3BC
    "出租系统", # 3BD
    "ＨＡＬ９００", # 3BE
    "骑手主脑", # 3BF
    "无线警察", # 3C0
    "感恩Ⅱ", # 3C1
    "沃兹尼亚克Ⅱ", # 3C2
    "ＨＡＬ８００", # 3C3
    "感恩Ⅲ", # 3C4
    "艾米", # 3C5
    "卡巴雷罗２０２２", # 3C6
    "爱丽丝２０２７", # 3C7
    "沃兹尼亚克ＳⅠ", # 3C8
    "ＳＯＬＯＭＯＮ２", # 3C9
    "ＳＯＬＯＭＯＮ３", # 3CA
    "拉克塔", # 3CB
    "９９式神話", # 3CC
    "死亡１３", # 3CD
    "诺依曼加速器", # 3CE
    "主炮核心", # 3CF
    "副炮核心", # 3D0
    "SE核心", # 3D1
    "跳舞人偶", # 3D2
    "天空观察者", # 3D3
    "ＡＴ打击者", # 3D4
    "空冷雷神", # 3D5
    "蛛网系统", # 3D6
    "天才７７７", # 3D7
    "神经ＰＡＣ", # 3D8
    "实时连击内核", # 3D9
    "双子星发射器", # 3DA
    "悦动哈利", # 3DB
    "联动双面神", # 3DC
    "飞鱼控制器", # 3DD
    "达罗斯１０００", # 3DE
    "达罗斯３０００", # 3DF
    "寂静达罗斯", # 3E0
    "母舰总控", # 3E1
    "电击密友", # 3E2
    "LOVE机器(迎击辅助)", # 3E3
    "LOVE机器(迎击能力)", # 3E4
    "LOVE机器(三重射击)", # 3E5
    "生化大脑", # 3E6
    "桑巴狂欢节", # 3E7
    "塞纳２０２２", # 3E8
    "孤独杰克", # 3E9
    "19式改", # 3EA
    "泰坦巨人改", # 3EB
    "阿波罗尼亚改", # 3EC
    "埃及艳后改", # 3ED
    "冥王星改", # 3EE

# 主炮
    "无(主炮)", # 3EF
    "主炮类型", # 3F0
    "锈蚀的大炮", # 3F1
    "生锈的大炮", # 3F2
    "３７ＭＭ炮", # 3F3
    "４５ＭＭ炮", # 3F4
    "４８ＭＭ炮", # 3F5
    "５５ＭＭ炮", # 3F6
    "７５ＭＭ炮", # 3F7
    "冰冻炮", # 3F8
    "７７ＭＭ爆射炮", # 3F9
    "８０ＭＭ火花炮", # 3FA
    "８８ＭＭ炮", # 3FB
    "９０ＭＭ远程Ｔ型", # 3FC
    "８８ＭＭ火花炮", # 3FD
    "白薯爆射炮", # 3FE
    "９５ＭＭ炮", # 3FF
    "９２ＭＭ火花炮", # 400
    "萌萌火炮", # 401
    "９８ＭＭ炮", # 402
    "１０５ＭＭ加农炮", # 403
    "吊车炮", # 404
    "１１０ＭＭ低位炮", # 405
    "１０５ＭＭ爆射炮", # 406
    "１１５ＭＭ远程Ｔ型", # 407
    "１２０ＭＭ加农炮", # 408
    "１２５ＭＭ犀牛炮", # 409
    "１２０ＭＭ远程Ｔ型", # 40A
    "激光加农炮", # 40B
    "１２５ＭＭ加农炮", # 40C
    "１１５ＭＭ火花炮", # 40D
    "Ｕ鲨潜艇炮", # 40E
    "犀牛粉碎者", # 40F
    "１１５ＭＭ爆射炮", # 410
    "１２５ＭＭ远程Ｔ型", # 411
    "１２０ＭＭ火花炮", # 412
    "白金殿堂炮", # 413
    "火神加农炮", # 414
    "１３５ＭＭ加农炮", # 415
    "１５０ＭＭ加农炮", # 416
    "１４０ＭＭ火花炮", # 417
    "１５５ＭＭ加农炮", # 418
    "火炉加农炮", # 419
    "友情炮", # 41A
    "１６０ＭＭ非晶态炮", # 41B
    "寒冰加农炮", # 41C
    "钻头加农炮", # 41D
    "达罗斯加农炮", # 41E
    "雷电加农炮", # 41F
    "１５５ＭＭ火花炮", # 420
    "１６５ＭＭ幽灵炮", # 421
    "八歧大蛇", # 422
    "超声波加农炮", # 423
    "Ｕ爆射炮炮", # 424
    "ＵＵ爆射炮炮", # 425
    "１８０ＭＭ爆射炮", # 426
    "１６５ＭＭ远程Ｔ型", # 427
    "死神加农炮", # 428
    "爆裂军刀炮", # 429
    "巡洋舰炮", # 42A
    "１７５ＭＭ加农炮", # 42B
    "１７７ＭＭ非晶态炮", # 42C
    "１９５ＭＭ加农炮", # 42D
    "１９５ＭＭ爆射炮", # 42E
    "电磁投射炮", # 42F
    "灾星炮", # 430
    "２０５ＭＭ绯牡丹炮", # 431
    "ＵＵ鲨潜艇炮", # 432
    "１８０ＭＭ火花炮", # 433
    "电击炮", # 434
    "２０５ＭＭ加农炮", # 435
    "１９５ＭＭ远程Ｔ型", # 436
    "２１０ＭＭ火花炮", # 437
    "ＥＸ达罗斯加农炮", # 438
    "２２５ＭＭ许德拉炮", # 439
    "雷电钻头", # 43A
    "导弹加农炮", # 43B
    "２２０ＭＭ盖亚炮", # 43C
    "量子崩壊炮", # 43D
    "雷龙炮", # 43E
    "母艦炮", # 43F
    "帝王爆射炮", # 440
    "宇宙炮", # 441
    "LOVE机器(666)", # 442
    "LOVE机器(900)", # 443
    "LOVE机器(555)", # 444
    "圣十字双钻炮", # 445
    "８３２激光炮", # 446
    "猴子加农炮", # 447
    "火星爆射炮", # 448
    "土星爆射炮", # 449
    "特利昂炮", # 44A
    "噩运振动炮", # 44B
    "灵子加农炮", # 44C
    "杰克未完成炮", # 44D
    "基多拉炮", # 44E
    "虎王旋风", # 44F

# 机枪
    "机枪类型", # 450
    "生锈机枪", # 451
    "７ＭＭ机枪", # 452
    "７．７ＭＭ机枪", # 453
    "９ＭＭ机枪", # 454
    "加特林炮", # 455
    "１３ＭＭ机枪", # 456
    "火焰散弹", # 457
    "１１ＭＭ火神炮", # 458
    "冷气放射器", # 459
    "武魂火神炮", # 45A
    "９ＭＭ重机枪", # 45B
    "１５ＭＭ火神炮", # 45C
    "激光破坏者", # 45D
    "雷击闪电", # 45E
    "眼镜王蛇", # 45F
    "镭射扫描炮", # 460
    "音痴扩音器", # 461
    "１６ＭＭ机枪", # 462
    "激光枪骑兵", # 463
    "雷电炸裂炮", # 464
    "爆炎喷射器", # 465
    "１３ＭＭ重机枪", # 466
    "巨炮", # 467
    "重击角笛", # 468
    "光线枪", # 469
    "突击镭射炮", # 46A
    "１８ＭＭ火神炮", # 46B
    "时间静止器", # 46C
    "巨型长笛", # 46D
    "蛇头激光枪", # 46E
    "烈焰机枪", # 46F
    "寒冰机枪", # 470
    "ＭＲ．烟囱", # 471
    "重型机枪", # 472
    "火龙炮", # 473
    "２２ＭＭ火神炮", # 474
    "绯牡丹火神炮", # 475
    "楊貴妃火神炮", # 476
    "雷电风暴", # 477
    "狼犬火神炮", # 478
    "火箭管炮", # 479
    "加农管炮", # 47A
    "鲨鱼机枪", # 47B
    "超声波管炮", # 47C
    "猛牛骂流管", # 47D
    "土星冻结炮", # 47E
    "巨人炮", # 47F
    "杰克清道夫", # 480
    "炫日光束", # 481
    "玫瑰火神炮改", # 482

# SE
    "Ｓ－Ｅ类型", # 483
    "生锈导弹", # 484
    "小型导弹", # 485
    "光速抹杀炮", # 486
    "导弹发射器", # 487
    "ＡＴＭ导弹", # 488
    "３的奇迹", # 489
    "ＡＴＭ恶魔", # 48A
    "踢踏舞者", # 48B
    "扩散光束炮", # 48C
    "大蛇导弹", # 48D
    "爆炎炸裂弹", # 48E
    "潇洒豆荚", # 48F
    "超级导弹１号", # 490
    "诱导ＣＡＴ", # 491
    "棒球发球机", # 492
    "疯狂厨师", # 493
    "狼犬火箭炮", # 494
    "生化破坏炮", # 495
    "机械粉碎者", # 496
    "轰天弾", # 497
    "凝固汽油包装袋", # 498
    "雷电鸟", # 499
    "超声波扬声器", # 49A
    "蜈蚣炸弹", # 49B
    "双火箭行者", # 49C
    "米加粒子炮", # 49D
    "巨大钻孔器", # 49E
    "ＴＮＴ龙卷", # 49F
    "风林火山", # 4A0
    "托比翁群集", # 4A1
    "ＲＤ汽油弹", # 4A2
    "番茄台风", # 4A3
    "铁球巨人", # 4A4
    "海洋猎手", # 4A5
    "ＬＩ花生仁", # 4A6
    "火焰球", # 4A7
    "反重力铁球", # 4A8
    "音响必罚", # 4A9
    "烈焰吐息５", # 4AA
    "ＡＣＥ火炎", # 4AB
    "圆周破坏者", # 4AC
    "硝基清道夫", # 4AD
    "连续凤凰", # 4AE
    "金球Ｚ", # 4AF
    "钢球巨人", # 4B0
    "一发逆转神话", # 4B1
    "二重身", # 4B2
    "疾风骤雨", # 4B3
    "加农导弹", # 4B4
    "超级手臂", # 4B5
    "红莲必罚", # 4B6
    "北极风", # 4B7
    "雷霆之冠", # 4B8
    "红莲女武神", # 4B9
    "ＴＴ冻结者", # 4BA
    "闪光必罚", # 4BB
    "ＤＤＴ暴雨", # 4BC
    "ＡＴＭ绯牡丹", # 4BD
    "Ｆ－龙卷", # 4BE
    "灼热凤凰", # 4BF
    "高音风暴", # 4C0
    "极光冻结者", # 4C1
    "超越彩虹", # 4C2
    "ＩＭ狂躁电击", # 4C3
    "Ｗ－龙卷", # 4C4
    "海星号角", # 4C5
    "ＭＣ前锋", # 4C6
    "重力飘升机", # 4C7
    "一击必杀神话", # 4C8
    "ＤＤ疯狂者", # 4C9
    "超低音", # 4CA
    "晒斑ＸＸ", # 4CB
    "妨碍者", # 4CC
    "圣剑导弹", # 4CD
    "怪鸟音叉", # 4CE
    "雷龙三叉戟导弹", # 4CF
    "ＡＴ爱国者", # 4D0
    "光束守护者", # 4D1
    "激光蛇妖", # 4D2
    "扩散方阵", # 4D3
    "鼻子探测器", # 4D4
    "超光速雷达", # 4D5
    "卡里奥烟雾弹", # 4D6
    "LOVE机器(迎击,光束)", # 4D7
    "小型包装袋", # 4D8
    "沙门氏菌荚", # 4D9
    "沙门氏菌荚α", # 4DA
    "宇宙炸弹人", # 4DB
    "Ｓ－龙卷", # 4DC
    "闪光迎击神话", # 4DD

# 固定武器
    "饿狼火花炮", # 4DE
    "饿狼火花炮Ⅱ", # 4DF
    "饿狼火花炮Ⅲ", # 4E0
    "雷光炮", # 4E1
    "电磁热线炮", # 4E2
    "超电磁热线炮", # 4E3
    "零度冲击波", # 4E4
    "烈火爆射", # 4E4
    "烈火爆射Ⅱ", # 4E6
    "烈火爆射Ⅲ", # 4E7
    "二重加农炮", # 4E8
    "二重加农炮Ⅱ", # 4E9
    "二重加农炮Ⅲ", # 4EA
    "双子加农炮", # 4EB
    "第１大和炮", # 4EC
    "第２大和炮", # 4ED
    "１１式火神炮", # 4EE
    "１１式火神炮改", # 4EF
    "１１式火神炮极", # 4F0
    "４２ＭＭ対空炮", # 4F1
    "天箭", # 4F2
    "４连机关炮", # 4F3
    "二重拉斯特", # 4F4
    "决胜拉斯特", # 4F5
    "骑手火神炮", # 4F6
    "骑手火神炮Ⅱ", # 4F7
    "骑手火神炮Ⅲ", # 4F8
    "微型火神炮", # 4F9
    "微型火神炮Ⅱ", # 4FA
    "微型火神炮Ⅲ", # 4FB
    "塔式火神炮", # 4FC
    "塔式火神炮Ⅱ", # 4FD
    "前置式火神炮", # 4FE
    "前置式火神炮Ⅱ", # 4FF
    "小型火神炮", # 500
    "门式火神炮", # 501
    "门式火神炮Ⅱ", # 502
    "骑手激光", # 503
    "火祭火焰炮", # 504
    "火祭火焰炮Ⅱ", # 505
    "火祭火焰炮Ⅲ", # 506
    "电磁炮", # 507
    "拳击家手臂", # 508
    "泰森手臂", # 509
    "恶魔手臂", # 50A
    "奇迹手臂", # 50B
    "对空导弹炮", # 50C
    "多弹头巴尔蒙克", # 50D
    "钻头拉斯特", # 50E
    "钻头拉斯特Ⅱ", # 50F
    "2重反转钻头", # 510
    "2重反转钻头Ⅱ", # 511
    "双子钻头", # 512
    "双子钻头Ⅱ", # 513
    "钛合金钻头", # 514
    "锆石钻头", # 515
    "钻石钻头", # 516
    "钛合金巨剑", # 517
    "百万钻头", # 518
    "亿万钻头", # 519
    "亿兆钻头", # 51A
    "螺旋银角", # 51B
    "超螺旋银角", # 51C
    "激光竞速器", # 51D
    "激光竞速器Ⅱ", # 51E
    "激光赛车手", # 51F
    "骑手之翼", # 520
    "天使之翼", # 521
    "恶魔之翼", # 522
    "神之翼", # 523
    "越野车导弹", # 524
    "越野车导弹Ⅱ", # 525
    "骑手导弹", # 526
    "骑手导弹Ⅱ", # 527
    "氧元素导弹", # 528
    "恶魔导弹", # 529
    "天神导弹", # 52A
    "公路爆弹魔", # 52B
    "公路爆弹魔Ⅱ", # 52C
    "鲨鱼导弹舱", # 52D
    "鲨鱼导弹舱Ⅱ", # 52E
    "导弹小丑", # 52F
    "超级小丑", # 530
    "前部导弹", # 531
    "前部导弹Ⅱ", # 532
    "塔楼导弹舱", # 533
    "塔楼导弹舱Ⅱ", # 534
    "大门导弹舱", # 535
    "大门导弹舱Ⅱ", # 536
    "Ｗ大门导弹舱", # 537
    "Ｗ大门导弹舱Ⅱ", # 538
    "侧部导弹舱", # 539
    "侧部导弹舱Ⅱ", # 53A
    "收束音波炮", # 53B
    "收束音波炮Ⅱ", # 53C
    "狱炎炮", # 53D
    "狱炎炮Ⅱ", # 53E
    "小型火焰", # 53F
    "车轮导弹", # 540
    "短发状导弹", # 541
    "迎击电光象牙", # 542

# 底盘
    "越野车", # 543
    "高速越野车", # 544
    "风暴越野车", # 545
    "热沙行者", # 546
    "伟大越野车", # 547
    "飓风越野车", # 548
    "热沙行者＋", # 549
    "热沙行者Ｓ", # 54A
    "全方位博天族", # 54B
    "台风越野车", # 54C
    "羚羊", # 54D
    "ＳＥ羚羊", # 54E
    "２ＳＥ羚羊", # 54F
    "３ＳＥ羚羊", # 550
    "疯狂越野车", # 551
    "黑斑羚", # 552
    "ＳＥ黑斑羚", # 553
    "２ＳＥ黑斑羚", # 554
    "佐鸟越野车", # 555
    "装甲车", # 556
    "１１式装甲警戒", # 557
    "１１式装甲侦察", # 558
    "１１式装甲雷击", # 559
    "１１式重装甲车", # 55A
    "１１式２连装甲炮", # 55B
    "１１式装甲侦察改", # 55C
    "１１式装甲巡逻", # 55D
    "１１式装甲强袭", # 55E
    "１１式装甲雷击＋", # 55F
    "１１式烈风", # 560
    "１１式铁锤", # 561
    "１１式双龙", # 562
    "１１式３连装甲炮", # 563
    "１１式２连装甲改", # 564
    "１１式装甲制圧", # 565
    "１１式无限巡逻", # 566
    "１１式装甲强袭改", # 567
    "１１式装甲粉碎", # 568
    "１１式雷电", # 569
    "１１式烈风改", # 56A
    "１１式玄武", # 56B
    "１１式铁锤改", # 56C
    "１１式Ｋ号双龙", # 56D
    "１１式Ｓ号双龙", # 56E
    "１１式双龙改", # 56F
    "Ｋ号１１式重爆", # 570
    "Ｓ号１１式重爆", # 571
    "１１式３连雷击", # 572
    "１１式３连装甲改", # 573
    "１１式２连机动", # 574
    "１１式无限改", # 575
    "１１式雷电改", # 576
    "１１式神风", # 577
    "１１式风神", # 578
    "１１式Ｋ号双龙改", # 579
    "１１式双龙ＳＳＳ", # 57A
    "１１式Ｓ号双龙改", # 57B
    "１１式Ｋ号龙神", # 57C
    "１１式Ｓ号龙神", # 57D
    "１１式炮王", # 57E
    "１１式天罚", # 57F
    "野巴士", # 580
    "号角巴士", # 581
    "兽牙巴士", # 582
    "羽根巴士", # 583
    "号角羽根巴士", # 584
    "二本号角巴士", # 585
    "号角兽牙巴士", # 586
    "二本兽牙巴士", # 587
    "兽牙羽根巴士", # 588
    "二本羽根巴士", # 589
    "犀牛巴士", # 58A
    "大象巴士", # 58B
    "愤怒巴士", # 58C
    "三犄龙巴士", # 58D
    "麋鹿巴士", # 58E
    "旗鱼巴士", # 58F
    "野猫巴士", # 590
    "猛虎巴士", # 591
    "鳄鱼巴士", # 592
    "飞鹰巴士", # 593
    "野牛伽鲁", # 594
    "犀牛莱恩", # 595
    "暴君河马", # 596
    "猛犸隼", # 597
    "美洲野牛", # 598
    "三犄龙登陆者", # 599
    "烈马登陆者", # 59A
    "三犄龙列车", # 59B
    "缪斯", # 59C
    "混沌托纳", # 59D
    "独角鲸之叹息", # 59E
    "美洲狮机炮式", # 59F
    "美洲虎式", # 5A0
    "音叉式", # 5A1
    "鳄鱼晚餐", # 5A2
    "食火鸡", # 5A3
    "三犄龙拉托拉库斯", # 5A4
    "陆地野牛", # 5A5
    "陆地野牛Ｘ", # 5A6
    "犀牛首领", # 5A7
    "犀牛大公", # 5A8
    "猛犸扫荡车", # 5A9
    "猛犸杀手", # 5AA
    "豪华缪斯", # 5AB
    "三犄龙领主", # 5AC
    "豪华烈马", # 5AD
    "五组式拉克斯", # 5AE
    "横断美洲烈马", # 5AF
    "三犄龙猛禽", # 5B0
    "缪斯里昂", # 5B1
    "轮鲸", # 5B2
    "超级猫", # 5B3
    "危险小猫", # 5B4
    "狩猎制表者", # 5B5
    "豪华狩猎者", # 5B6
    "珊瑚领主", # 5B7
    "食火鸡Ｖ", # 5B8
    "狼", # 5B9
    "Ｒ狼", # 5BA
    "Ｒ狼ⅡＶ", # 5BB
    "Ｒ狼ⅡＳ", # 5BC
    "Ｒ狼Ⅲ", # 5BD
    "Ｒ狼ⅣＷ", # 5BE
    "Ｒ狼ⅣＭ", # 5BF
    "Ｒ狼ⅣＸ", # 5C0
    "Ｒ狼ⅤＷＸ", # 5C1
    "Ｒ狼ⅤＭＸ", # 5C2
    "Ｒ狼ⅥＷＷ", # 5C3
    "Ｒ狼ⅥＷＸ", # 5C4
    "Ｒ狼ⅥＭＷ", # 5C5
    "Ｒ狼ⅥＭＸ", # 5C6
    "Ｒ狼ⅦＷＷ", # 5C7
    "Ｒ狼ⅦＭＷ", # 5C8
    "Ｒ狼Ⅷ", # 5C9
    "Ｓ狼", # 5CA
    "Ｓ狼ⅡＶ", # 5CB
    "Ｓ狼ⅡＳ", # 5CC
    "Ｓ狼ⅡＣ", # 5CD
    "Ｓ狼ⅢＶＶ", # 5CE
    "Ｓ狼ⅢＶＣ", # 5CF
    "Ｓ狼ⅢＶＳ", # 5D0
    "Ｓ狼ⅢＳＳ", # 5D1
    "Ｓ狼ⅢＣＳ", # 5D2
    "Ｓ狼ⅢＣＣ", # 5D3
    "Ｓ狼ⅣＳＸ", # 5D4
    "Ｓ狼ⅣＣＸ", # 5D5
    "Ｓ狼ⅣＣＣ", # 5D6
    "Ｓ狼ⅣＦ", # 5D7
    "Ｓ狼ⅤＳＸ", # 5D8
    "Ｓ狼ⅤＣＸ", # 5D9
    "Ｓ狼ⅤＣＣ", # 5DA
    "Ｓ狼ⅤＦ", # 5DB
    "防空猎豹", # 5DC
    "防空猎豹Ｇ", # 5DD
    "防空猎豹ＳＥ", # 5DE
    "防空猎豹Ｇ２", # 5DF
    "防空猎豹ＧＳＥ", # 5E0
    "防空猎豹ＳＥ２", # 5E1
    "防空猎豹Ｇ３", # 5E2
    "防空猎豹Ｇ２ＳＥ", # 5E3
    "防空猎豹ＧＳＥ", # 5E4
    "防空猎豹ＳＥ３", # 5E5
    "防空猎豹Ｇ４", # 5E6
    "防空猎豹Ｇ３ＳＥ", # 5E7
    "防空猎豹Ｇ２ＳＥ２", # 5E8
    "防空猎豹ＧＳＥ３", # 5E9
    "防空猎豹ＳＥ４", # 5EA
    "防空猎豹骑士Ｘ", # 5EB
    "防空猎豹骑士", # 5EC
    "防空猎豹猎人", # 5ED
    "防空猎豹魔女", # 5EE
    "防空猎豹魔女Ｓ", # 5EF
    "防空猎豹魔女ＳＸ", # 5F0
    "防空猎豹国王", # 5F1
    "防空猎豹皇帝", # 5F2
    "防空猎豹侯爵", # 5F3
    "防空猎豹总统", # 5F4
    "防空猎豹女王", # 5F5
    "防空猎豹ＳＥ３Ｒ", # 5F6
    "猛犸", # 5F7
    "猛犸２００", # 5F8
    "猛犸１１０", # 5F9
    "猛犸１０１", # 5FA
    "乳齿象", # 5FB
    "猛犸３００", # 5FC
    "猛犸２１０", # 5FD
    "猛犸１２０", # 5FE
    "猛犸１１１", # 5FF
    "猛犸１０２", # 600
    "乳齿象Ｘ", # 601
    "乳齿象Ｑ", # 602
    "猛犸之魂", # 603
    "疾风猛犸", # 604
    "力量猛犸", # 605
    "猛犸电压", # 606
    "沃特猛犸", # 607
    "闪电猛犸", # 608
    "极光猛犸", # 609
    "疾风乳齿象", # 60A
    "力量幼齿象", # 60B
    "穆斯凯尔猛犸", # 60C
    "沃特猛犸", # 60D
    "闪电猛犸", # 60E
    "超重猛犸Ｃ", # 60F
    "密林猛犸", # 610
    "热帯猛犸", # 611
    "草原猛犸", # 612
    "龙巻猛犸", # 613
    "旋风猛犸", # 614
    "苔原猛犸", # 615
    "北极猛犸", # 616
    "超重猛犸Ｓ", # 617
    "超重乳齿象", # 618
    "热帯乳齿象", # 619
    "旋风乳齿象", # 61A
    "乳齿象之魂", # 61B
    "深山乳齿象", # 61C
    "洞窟乳齿象", # 61D
    "絶壁乳齿象", # 61E
    "魔境乳齿象", # 61F
    "象", # 620
    "象Ｒ", # 621
    "阿比西尼亚猫", # 622
    "阿比西尼亚猫Ｑ", # 623
    "阿比西尼亚猫Ｖ", # 624
    "阿比西尼亚猫Ｆ", # 625
    "阿比西尼亚猫Ｒ", # 626
    "斯特拉迪瓦里", # 627
    "斯特拉迪瓦里Ｔ", # 628
    "斯特拉迪瓦里Ｖ", # 629
    "斯特拉迪瓦里Ｆ", # 62A
    "斯特拉迪瓦里Ｒ", # 62B
    "虎", # 62C
    "虎Ｘ", # 62D
    "虎Ｖ", # 62E
    "虎Ｆ", # 62F
    "虎Ｒ", # 630
    "美洲豹", # 631
    "美洲豹Ｑ", # 632
    "美洲豹Ｖ", # 633
    "美洲豹Ｆ", # 634
    "美洲豹Ｒ", # 635
    "流浪狗", # 636
    "草原狼", # 637
    "非洲猎犬", # 638
    "狐狼", # 639
    "法外者", # 63A
    "违法之徒", # 63B
    "邦尼&amp;克莱德", # 63C
    "约翰迪林杰", # 63D
    "邪恶煞星", # 63E
    "传奇无赖", # 63F
    "白摩托", # 640
    "裁决Ｃ", # 641
    "裁决", # 642
    "裁决Ｓ", # 643
    "裁决ＣＳ", # 644
    "裁决Ｃ＋", # 645
    "裁决Ｓ＋", # 646
    "裁决ＳＷ", # 647
    "法官", # 648
    "证据", # 649
    "正义", # 64A
    "目击者", # 64B
    "目击者Ｓ", # 64C
    "审判", # 64D
    "钛白审判", # 64E
    "法官Ｓ", # 64F
    "法官＋", # 650
    "钛白审判Ｃ", # 651
    "申辩", # 652
    "判决", # 653
    "最终审判", # 654
    "钛白审判Ｓ", # 655
    "末日审判", # 656
    "玄幻", # 657
    "困境", # 658
    "悖论", # 659
    "流星", # 65A
    "光速流星", # 65B
    "爆速流星", # 65C
    "爆速流星ＢＢ", # 65D
    "光速流星ＢＭ", # 65E
    "爆速流星ＭＢ", # 65F
    "爆速流星ＭＭ", # 660
    "连星类星体Ｃ", # 661
    "连星类星体Ｓ", # 662
    "类星体ＫＢ", # 663
    "类星体ＫＭ", # 664
    "连星脉冲Ｃ", # 665
    "连星脉冲Ｓ", # 666
    "脉冲ＫＢ", # 667
    "脉冲ＫＭ", # 668
    "超光速ＳＣ", # 669
    "超光速ＳＳ", # 66A
    "超级赛车", # 66B
    "超级巡逻车", # 66C
    "狂战士", # 66D
    "大宝利卡", # 66E
    "巡逻龙卷风", # 66F
    "巡逻隆基努斯", # 670
    "狂战士＋", # 671
    "迪阿鲁威达", # 672
    "竞速兰博基尼", # 673
    "利卡DXＤＸ", # 674
    "萨菲罗斯", # 675
    "潘多拉", # 676
    "天蝎座", # 677
    "隆基努斯", # 678
    "竞速兰博基尼ＧＴ", # 679
    "决斗者", # 67A
    "狂战士ＸＸＸ", # 67B
    "竞速兰博基尼ＸＸ", # 67C
    "竞速兰博基尼ＳＴ", # 67D
    "魔界３０００", # 67E
    "漩涡雪铁龙", # 67F
    "法拉利", # 680
    "人马座", # 681
    "枪骑兵", # 682
    "兰斯洛特", # 683
    "曼德伯", # 684
    "隆基努斯ＳＲ", # 685
    "高文", # 686
    "二重奏兰博基尼", # 687
    "王权", # 688
    "王权Ｓ", # 689
    "二重奏兰博基尼Ｓ", # 68A
    "高文ＳＳＳ", # 68B
    "魔界４０００", # 68C
    "处女座", # 68D
    "零", # 68E
    "零号打击者", # 68F
    "零号元素", # 690
    "零号钻孔者", # 691
    "零号双臂", # 692
    "零号攻击者", # 693
    "零号强打者", # 694
    "零号粉碎者", # 695
    "零号元素改", # 696
    "零号元素Ｃ", # 697
    "零号元素Ｓ", # 698
    "零号钻孔者改", # 699
    "零号钻孔者Ｃ", # 69A
    "零号钻孔者Ｓ", # 69B
    "零号双臂改", # 69C
    "零号双臂Ｃ", # 69D
    "零号双臂Ｓ", # 69E
    "零热量", # 69F
    "最大限零", # 6A0
    "零冷处理", # 6A1
    "零热量ＥＥ", # 6A2
    "零之涌", # 6A3
    "零之火花", # 6A4
    "零热量ＤＤ", # 6A5
    "零号投手", # 6A6
    "零号毁灭者", # 6A7
    "零热量ＡＡ", # 6A8
    "零号商人", # 6A9
    "１１式雷神", # 6AA
    "零之魔法师", # 6AB
)


MONSTERS = (
    "空",
    "沙蚁",
    "影像蝙蝠",
    "聚焦鼠",
    "平原游击鼹",
    "激光蜂鸟",
    "公路枪手",
    "蚱蜢加农炮",
    "火神炮蜘蛛",
    "毒蝎炮",
    "掠夺者新兵",
    "炸弹毛毛",
    "沙蛟",
    "亡命贝罗衣德",
    "掠夺者",
    "掠夺者",
    "掠夺者坦克",
    "杀人变形虫",
    "彷徨油桶",
    "彷徨油桶",
    "空油桶",
    "飞行ＢＣＧ",
    "一发屋",
    "一发屋",
    "蜂巢加农炮",
    "拾荒鼠",
    "拾荒鼠",
    "小型拾荒鼠",
    "毒蛭",
    "胄甲炮",
    "蟹型炮",
    "沙鳄",
    "沙蚁后",
    "天蝎",
    "巡逻鼓槌蜂",
    "火箭杜宾",
    "传感三色堇",
    "ＡＴ独眼巨人",
    "酸蚁",
    "食铁蚁",
    "金蚁",
    "仿生金蚁",
    "巨蚁",
    "黑蚁毯",
    "黑蚁毯",
    "黄金食蚁兽",
    "激光猫头鹰",
    "切裂螳螂",
    "芋虫火神炮",
    "杀人蚁",
    "兵蚁",
    "亚当蚁",
    "最后的吉娃娃",
    "最后的兽仔",
    "千手沙华",
    "疾走加农炮",
    "修理直升机",
    "海鸥战轰机",
    "侦查ＵＦＯ",
    "软体加农炮",
    "寄居蟹炮",
    "寄居蟹炮",
    "电击钢球炮",
    "咏颂扩音器",
    "暗眼鼠",
    "防御垂蜘蛛",
    "防御垂蜘蛛",
    "络缲机巧金造",
    "络缲机巧物体",
    "无后坐力法兰西人偶",
    "监视摄像机",
    "监视摄像机",
    "防盗雷达",
    "蝮蛇炮孔",
    "机枪炮台",
    "机枪炮台",
    "彷徨装甲片",
    "彷徨装甲片",
    "金网导弹者",
    "采伐者",
    "推土机",
    "僵尸骑手",
    "陆生蝠鲼",
    "恶党战车",
    "爆射蠕虫",
    "复仇者猫头鹰",
    "开膛手・杰克",
    "巨型蝠鲼",
    "彼得・乔",
    "铁鲛",
    "铁鲛",
    "漫步者",
    "漫步者",
    "变种犀牛",
    "警备蚱蜢",
    "机械警察",
    "机械警察",
    "地狱斗牛犬",
    "掠夺者陆战队",
    "斯坎克斯",
    "啃食者",
    "噬鼠者",
    "暗黑鼹鼠",
    "暗黑鼹鼠",
    "暗黑鼹鼠",
    "洞穴盘踞者",
    "镜面蜗牛",
    "拦截碟",
    "地雷鼹鼠",
    "地雷鼹鼠",
    "鲜花巨口鲨",
    "ＡＴ巨灵神",
    "注射毒蝎",
    "烟蒲公英",
    "暗夜幽灵",
    "飞行药剂",
    "直升鸟",
    "游击蚁",
    "平原清道夫",
    "平原清道夫",
    "格林小姐",
    "唐纳德轰炸机",
    "金龟",
    "金龟",
    "游击夜莺",
    "火炎盔甲蟹",
    "金蚁毯",
    "金蚁毯",
    "野巴士",
    "狂暴野巴士",
    "机器出租车",
    "机器出租车",
    "人类式型",
    "铁金龟",
    "转铁者",
    "加油桶",
    "反射鼠",
    "铰刀汽车",
    "电网蜘蛛",
    "镭射花",
    "钻头玫瑰",
    "镭射蜂",
    "等离子甲虫",
    "杀手撕裂者",
    "狂犬",
    "魔犬贝罗",
    "天道机甲神話",
    "异形",
    "异形酱",
    "垃圾太郎法师",
    "赞扎兄",
    "赞扎弟",
    "门多萨",
    "门多萨",
    "波拉雷塔卡斯",
    "欧佛洛德塔",
    "幸运老鼠",
    "幸运老鼠",
    "幸运老鼠",
    "幸运老鼠",
    "泡沫蟹炮",
    "水行炮",
    "机雷水母",
    "电击水母",
    "吸血海参",
    "僵尸冲浪者",
    "海胆炮",
    "红色炸弹龟",
    "鱼雷鱼",
    "溺死鬼",
    "镭射藤壶",
    "蓝色炸弹龟",
    "翻车鱼导弹",
    "火箭芭蕉",
    "海坊主",
    "黑多斯拉",
    "光圈旗鱼",
    "究极玩偶",
    "水行长者",
    "托比翁飞鱼",
    "Ｕ－鲨鱼",
    "Ｕ－鲨鱼",
    "全武装海龟",
    "全武装海龟",
    "全武装海龟",
    "水间勇一僵尸",
    "机械蝠鲼",
    "汽油美人",
    "狂岚火箭炮",
    "钻头推土机",
    "钻头推土机",
    "地狱火炉",
    "Ｔ６９雪人",
    "巫毒废铁傀儡",
    "迷你巫毒傀儡",
    "迷你巫毒傀儡",
    "迷你巫毒傀儡",
    "迷你巫毒傀儡",
    "ＫＩＮＺＯ－０４",
    "黑帮老娘",
    "枪炮塔",
    "神风弹",
    "神风少女",
    "神风王",
    "笋弹发射井",
    "无差别螺",
    "吸血气球",
    "寄生水蛭",
    "萌手办",
    "复制玩偶",
    "亚马逊女战士",
    "美丽女忍者",
    "瘦身僵尸",
    "筋肉夫人",
    "食金虫",
    "达尼（善）",
    "达尼（悪）",
    "达尼（笑）",
    "达尼（悲）",
    "达尼（強）",
    "麻痹草",
    "摩斯基多拉",
    "毒芋虫加农炮",
    "孔雀明王",
    "贝希摩斯（巨鹿战车）",
    "地狱锯",
    "河马炮",
    "恐怖贝",
    "Ｂ５２信天翁",
    "Ｂ５２信天翁",
    "鲶鱼人",
    "隐者炮",
    "隐者炮",
    "隐者炮",
    "加西亚",
    "啸天炮",
    "纵火猴",
    "无后坐力４",
    "敏感兔",
    "放电野牛",
    "猛禽ＢＩＲＤ",
    "猛禽ＢＩＲＤ",
    "尘埃原人",
    "河马炮头目",
    "电魚人",
    "钻石寄居蟹",
    "钻石寄居蟹",
    "沙门氏菌一家",
    "带子的女将",
    "食尸蚁",
    "佩德罗",
    "白金蚁",
    "钟点工僵尸",
    "強力労动神话Ⅱ",
    "助杀者",
    "眼镜蛇炮孔",
    "巡逻机器鸟",
    "宇宙僵尸",
    "ＤＮＡ粘液怪",
    "ＤＮＡ粘液怪",
    "小型补丁",
    "骑士行者",
    "暗黑守望者",
    "罗恩蜈蚣",
    "人间大炮",
    "人间爆弾",
    "炸弹出租车",
    "巴尔干袋鼠",
    "解体直升机",
    "迎击装甲片",
    "死亡拖车",
    "巨大铁金龟",
    "巨大运铁者",
    "４６亿年金龟",
    "超级绞剪",
    "外道贩卖鬼",
    "白板",
    "发财",
    "红中",
    "幽灵床单",
    "壁橱杀手",
    "怪物闹钟",
    "凶暴面包机",
    "熨斗蝙蝠",
    "辛蒂蕾拉防御强",
    "金轮际亡灵",
    "桑达",
    "震荡针",
    "火神炮孔",
    "弹丸吸尘器",
    "保镖机器人",
    "布鲁掠夺者",
    "布鲁掠夺者",
    "布鲁掠夺者",
    "地狱斗牛犬２号",
    "荒野流浪犬",
    "布鲁弗洛克",
    "布鲁弗洛克の战车",
    "匈奴猫头鹰",
    "大型匈奴猫头鹰",
    "古洛文之眼",
    "古洛文之眼",
    "古洛文之牙",
    "古洛文神经元Ｘ",
    "古洛文神经Ｙ",
    "古洛文的蠕虫",
    "古洛文的皮肤",
    "古洛文的触手",
    "古洛文的触手",
    "古洛文的触手",
    "古洛文的触手",
    "古洛文的触手",
    "古洛文的触手",
    "古洛文的触手",
    "古洛文的触手",
    "古洛文的触手",
    "古洛文",
    "杰克",
    "蚱蜢火焰炮",
    "凯瑟琳·波恩",
    "火箭炮冲浪员",
    "电击水黾",
    "满仓水母",
    "突击翻车鱼",
    "超音波蝙蝠",
    "隐形吸血蚊",
    "果酱人",
    "海女僵尸",
    "贪吃獾",
    "冷冻蜘蛛",
    "橘色杀手",
    "卡里奥斯特罗",
    "卡里奥斯特罗战车",
    "冷感恐怖贝",
    "装甲伽尼米德",
    "神风長田",
    "超合金竹笋",
    "Ｐ３Ｃ蜂",
    "火炎章鱼",
    "斗牛士杀手",
    "狂战士战车",
    "ＭＬ鞭挞者",
    "坑道犬",
    "坑道犬",
    "坑道犬",
    "等离子坦克",
    "ＡＴ象式战车",
    "食人楼梯",
    "变种海星",
    "β类型",
    "燃烧螺壳蟹",
    "地狱救助队",
    "地狱救助队",
    "激光蚯蚓",
    "镜面胄甲",
    "钟乳弾",
    "僵尸猴",
    "机械杰森",
    "破界树",
    "嗜血草",
    "嗜血狂牙",
    "死神战车",
    "技师直升鸟",
    "滑沙僵尸",
    "红沙蛟",
    "红沙蛟",
    "ＡＴ灰熊",
    "死神古战车",
    "外景猎手",
    "蛋糕炮",
    "电波花",
    "极乐轰炸机",
    "号角盘踞者",
    "白金蚁幕",
    "巨大黄金食蚁兽",
    "人间地狱蜈蚣",
    "甜点梦露",
    "开心炮",
    "幸福的蓝色螃蟹",
    "沙漠大萝卜",
    "沙漠大萝卜",
    "戴达罗斯",
    "沙漠公子",
    "沙漠公子",
    "大胃王Ｘ",
    "团子怪",
    "失散金属吞噬者",
    "电击格斗家",
    "蒲公英女王",
    "蒲公英宝宝",
    "Ｔ９９进港式",
    "闪光炮塔",
    "不安定糊状物",
    "监狱守卫",
    "监狱守卫",
    "复制斯坎克斯",
    "突变ＯＸ",
    "变形怪",
    "百眼巨人",
    "废铁泰坦",
    "堤丰",
    "神风先生",
    "牛王",
    "镜面球",
    "炸弹运输者",
    "神风炸弹",
    "ＡＴ普罗米修斯",
    "超电磁战车",
    "大拾荒者",
    "大拾荒者",
    "大拾荒者",
    "白金漫步者",
    "巨型河马炮",
    "真空眼镜蛇",
    "波动海参",
    "波动海参",
    "波动海参",
    "波动海参",
    "超流动大布丁",
    "重机レックス",
    "等离子鲶鱼",
    "巨大寄居蟹炮",
    "巨大寄居蟹炮",
    "变异鳄鱼",
    "复制糊状物",
    "摩斯基多拉王",
    "芳香油桶",
    "斯特皮奇",
    "奥托皮奇",
    "军舰雷龙",
    "军舰雷龙",
    "军舰雷龙",
    "天空流浪犬",
    "天空流浪犬",
    "ＳＳ掠夺者",
    "掠夺者坦克Ⅱ",
    "巡逻机器鸟Ⅱ",
    "乔治",
    "满弹神医",
    "电气生命体Ｚ",
    "电气生命体Ｚ",
    "电气生命体Ｚ",
    "电气生命体Ｚ",
    "电气生命体Ｚ",
    "电气生命体Ｚ",
    "电气生命体Ｚ",
    "暗夜跟踪者",
    "激素虫",
    "梦想炮孔",
    "大脑守卫",
    "完美守卫",
    "图腾塔",
    "蝦蛄坦克",
    "连筒",
    "波动筒",
    "波动筒",
    "波动筒",
    "无人侦察机ＶＸ",
    "超级炮塔",
    "彷徨装甲片Ｌ",
    "ＡＴＶ美洲狮",
    "中性子射线炮",
    "超导虫Ｘ",
    "死神相机",
    "悬挂杀手",
    "悬挂杀手",
    "蝙蝠系统",
    "电气原人",
    "戈耳工炮台",
    "戈耳工炮台",
    "戈耳工炮台",
    "络缲机巧花魁",
    "食人楼梯２",
    "解脱战车",
    "守卫魔像",
    "泰德・布罗拉",
    "蜜瓜宝宝",
    "鬼蜜瓜",
    "大鬼蜜瓜",
    "迷你芋虫炮",
    "地狱来电",
    "骸骨军队",
    "僵尸救援队",
    "活动蛋白质",
    "融化女忍者",
    "镰刀杀手",
    "Ｕ‐Ｕ‐鲨鱼",
    "Ｕ‐Ｕ‐鲨鱼",
    "ＥＸ戴达罗斯",
    "母舰雷龙",
    "母舰雷龙",
    "诸神的黄昏",
    "巨大侦查ＵＦＯ",
    "军舰龙王",
    "掠夺者",
    "掠夺者坦克",
    "千手沙华",
    "千手沙华",
    "千手沙华",
    "千手沙华",
    "千手沙华",
    "千手沙华",
    "千手沙华",
    "天道机甲神話",
    "天道机甲神話",
    "天道机甲神話",
    "天道机甲神話",
    "天道机甲神話",
    "天道机甲神話",
    "百眼巨人部件",
    "百眼巨人部件",
    "百眼巨人部件",
    "百眼巨人部件",
    "百眼巨人部件",
    "垃圾太郎法师部件",
    "垃圾太郎法师部件",
    "垃圾太郎法师部件",
    "垃圾袋",
    "垃圾袋",
    "垃圾袋",
    "废铁巫毒傀儡部件",
    "废铁巫毒傀儡部件",
    "废铁巫毒傀儡部件",
    "变形怪部件",
    "变形怪部件",
    "变形怪部件",
    "微型变形怪",
    "微型变形怪",
    "微型变形怪",
    "餐具",
    "椅子",
    "桌子",
    "台灯",
    "诡异餐桌装饰",
    "诡异的椅子",
    "诡异的桌子",
    "诡异的台灯",
    "闪光炮塔部件",
    "闪光炮塔部件",
    "闪光炮塔部件",
    "闪光炮塔部件",
    "超级炮塔部件",
    "超级炮台部件",
    "超级炮台部件",
    "超级炮台部件",
    "图腾塔部件",
    "图腾塔部件",
    "图腾塔部件",
    "图腾塔部件",
    "图腾塔部件",
    "冰壁",
    "赛銭箱",
    "地面",
    "地面？",
    "废弃的大楼",
    "洞窟墙壁",
    "托比翁飞鱼",
    "托比翁飞鱼",
    "卡里奥斯特罗",
    "变种海星",
    "金轮际幽灵",
    "斯特皮奇",
    "奥托皮奇",
    "斯特皮奇",
    "奥托皮奇",
    "斯特皮奇",
    "奥托皮奇",
    "布鲁弗洛克",
    "泰德・布罗拉",
    "泰德・布罗拉",
    "亚巴斯・布拉德",
    "超越者布拉德",
    "布拉德等离子体",
    "布拉德等离子体",
    "调试君",
    "寄居蟹君",
    "调试君２",
    "作成ＷＡＮＴＥＤ用",
)


def itemof(start, end, can_empty=True):
    return ItemProvider(ITEMS, start, end, can_empty)


SPECIAL_BULLETS = itemof(0x01, 0x10)
HUMEN_ITEM = itemof(0x005A, 0x016F) # 道具
POTION = itemof(0x11, 0x2C) # 恢复道具
BATTLE_ITEM = itemof(0x2C, 0x59) # 战斗道具

EQUIP_HEAD = itemof(0x16F, 0x19B) # 头部装备
EQUIP_BODY = itemof(0x19B, 0x1D8) # 上身装备
EQUIP_HAND = itemof(0x1D8, 0x1F9) # 手部装备
EQUIP_FOOT = itemof(0x1F9, 0x222) # 脚部装备
EQUIP_ORN = itemof(0x222, 0x260) # 装饰
EQUIP_WEAPON = itemof(0x260, 0x2F4) # 武器
ALL_EQUIP = itemof(0x16F, 0x2F4) # 全部人类装备

CHARIOT_ITEM = itemof(0x2F4, 0x341) # 战车物品
CHARIOT_ENGINE = itemof(0x341, 0x3BC) # 引擎
CHARIOT_CONTROL = itemof(0x3BC, 0x3EF) # C装置
CHARIOT_CONTROL_ENGINE = itemof(0x341, 0x3EF) # C装置/引擎
CHARIOT_MAIN = itemof(0x3EF, 0x450) # 主炮
CHARIOT_GUNS = itemof(0x450, 0x483) # 机枪
CHARIOT_SE = itemof(0x483, 0x4DD) # SE
CHARIOT_FIXED = itemof(0x4DE, 0x543) # 固定武器
CHARIOT_CHASSIS = itemof(0x543, 0x6AC) # 底盘
CHARIOT_WEAPON = itemof(0x3EF, 0x543) # 全部战车武器
CHARIOT_ALL_ITEM = itemof(0x2F4, 0x4DD) # 全部战车物品