
STATUS_CHOICES = ('普通', '不减')
STATUS_VALUES = (5, 6)

BADASS_BONUSES = (
    "最大生命值",
    "护盾容量",
    "护盾充能速度",
    "护盾充能延迟",
    "近战伤害",
    "手雷伤害",
    "武器精准率",
    "枪械伤害",
    "射速",
    "后坐力减免",
    "元素效果几率",
    "装填速度",
    "元素效果伤害",
    "暴击伤害",
)

SKILL_NAMES = (
    ('雅典娜(角斗士)', '大力神盾', (
        ('Phalanx 坚盾系', ('永不言败(5)', '监察长官(5)', '开路先锋(5)', '顽强死守(5)', '五彩神盾(1)',
            '统一战线(5)', '宣告无罪(1)', '坚定拥趸(5)', '火力还击(5)', '为了荣耀(5)', '女神之怒(1)')),
        ('Xiphos 叶刃系', ('枪械格斗(5)', '果决意图(5)', '水星机变(5)', '终结感知(5)', '撕裂伤口(1)',
            '嗜血欲望(5)', '震中效应(1)', '弹片撕扯(5)', '血污满身(5)', '竞技狂怒(5)', '杀出血路(1)')),
        ('Ceraunic Storm 灼电系', ('风暴交织(4)', '动乱漩涡(1)', '暴风前夕(5)', '电能导管(5)', '惩戒之击(1)',
            '严惩不怠(5)', '超导作用(5)', '宙斯之怒(1)', '元素弹幕(5)', '过载电流(5)', '急速冻结(5)', '冥神镣铐(1)')),
    )),
    ('威尔海姆(刽子手)', '狼与圣徒', (
        ('Hunter Killer 猎杀系', ('后燃引擎(5)', '火力支援(5)', '毒液飞弹(5)', '火力压制(5)', '激光制导(1)',
            '滚雷行动(5)', '自杀按钮(1)', '紧急起飞(5)', '冷战时期(5)', '战争升级(5)', '终结打击(1)')),
        ('Cyber Commando 电子系', ('激光聚焦(5)', '人与机器(5)', '先头部队(5)', '目标锁定(5)', '动力拳套(1)',
            '应急响应(5)', '震荡吸收(1)', '能量转换(5)', '流星震击(5)', '枪械展览(5)', '复仇火炮(1)')),
        ('Dreadnought 无畏系', ('备用油箱(5)', '坚甲利兵(5)', '能量供给(5)', '散热通道(5)', '自毁程序(1)',
            '快速增援(5)', '生死时刻(1)', '危害控制(5)', '动能护甲(5)', '不死之躯(5)', '超量充能(1)')),
    )),
    ('妮莎(执法者)', '决一胜负', (
        ('Law & Order 执法系', ('严刑峻法(4)', '守序教化(1)', '刑讯逼供(5)', '狂野骑兵(1)', '通缉目标(5)',
            '裁决律令(1)', '法定程序(5)', '罪人之血(1)', '司法管辖(5)', '愈挫愈勇(5)', '迫不及待(5)', '雷霆镇压(1)')),
        ('Fan the Hammer 撞针系', ('快马加鞭(5)', '赶尽杀绝(5)', '奇妙六弹(5)', '勇气倍增(5)', '一点就着(1)',
            '领先一步(5)', '妙手空空(1)', '快枪少女(5)', '地狱使者(5)', '尖峰时刻(5)', '人人有份(1)')),
        ('Riflewoman 步枪系', ('子弹激射(5)', '有勇有谋(5)', '快速射击(5)', '无拘无束(5)', '子弹满装(1)',
            '爆裂射击(5)', '急不可耐(1)', '火热铅弹(5)', '花式射击(5)', '绝命终结(5)', '不可饶恕(1)')),
    )),
    ('小吵闹(杀戮机器)', '秘藏猎人.EXE', (
        ('Boomtrap 爆破系', ('开足马力(5)', '机器杀手(5)', '意外爆燃(5)', '令人厌恶(5)', '数码复构(1)',
            '装填爆炸(5)', '诅咒反弹(1)', '原初爆炸(5)', '巨神一击(5)', '最后心愿(5)', '生死边缘(1)')),
        ('I Love You Guys! 友爱系', ('最好朋友(5)', '疯狂笑声(5)', '同甘共苦(5)', '揍他丫的(1)', '十全十美(5)',
            '爱上我吧(1)', '反复打蜡(5)', '陷阱卡片(1)', '疼痛模拟(5)', '揍你丫的(5)', '组织有效(5)', '击掌哥们(1)')),
        ('Fragmented Fragtrap 插件系', ('枪械专精(1)', '模糊算法(3)', '安全第一(1)', '大勇若怯(5)', '盲冲绑定(1)',
            '蓝色贝壳(5)', '三倍钟控(1)', '手雷减压(5)', '元素专精(1)', '死亡机器(5)', '冻气排放(5)', '野蜂飞舞(5)', '彩虹冷却(1)')),
    )),
)
