from lib.hack.utils import ItemProvider


PERSONS = tuple("同伴%d" % i for i in range(1, 16))
CHARIOTS = tuple("No.%d" % i for i in range(1, 13))

RATE = ('1', '2', '4', '8', '16', '32', '64', '128')
RATE_VALUES = (100, 200, 400, 800, 1600, 3200, 6400, 12800)

DIFFICULTY = ("Normal", "Hurd", "Super", "God")

FIGURES = (
    "主角(男)", "猎人(男)", "机械师(男)", "战士(男)", "护士(男)", "摔跤手(男)", "艺术家(男)", "艾克赛尔",
    "主角(女)", "猎人(女)", "机械师(女)", "战士(女)", "护士(女)", "摔跤手(女)", "艺术家(女)",
    "波奇(狗)", "贝罗(狗)", "哈奇(狗)", "米西卡", "食金虫"
)

PROFS = ("猎人", "机械师", "士兵", "护士", "摔跤手", "艺术家", "狗")

HOLE_TYPES = ((
    (0x00, "关"),
    (0x01, "主炮类"),
    (0x11, "副炮类"),
    (0x13, "副炮类"),
    (0x1F, "S-E类"),
))

DOUBLE_TYPE = ("单引擎", "双引擎")

WANTED_STATUS = ("未发现", "逃走中", "击破", "已领赏金")
WANTED_LIST = WANTED_LIST = (
    "蟹挖掘机", "巨鹿战车", "多明戈斯", "超流动巨大布丁", "猴门氏车", "气象云", "火星水母", "水怪许德拉",
    "猴面包树", "保镖机器人", "巨茧怪", "蛾女", "阿尔梅达", "电子旗鱼", "穆加迪斯", "极速王者", "冥界列车", "神风女王", "奥罗克", "垃圾人",
    "变形虫兄弟", "激钢钻狮", "奥尔加·莫德", "变异萝卜", "凶鸟·死亡黛蒙娜", "阿拉莫", "变异萝卜2号", "风魔AH666", "土星水母", "激钢钻虎"
)

ORGANIZATION = ("瀑布守护人", "麦秆", "掩体要塞", "自由出租联合", "冷血党", "白煮稻草人", "换了神教", "贸易之风", "嚯嚯洞")

ITEMS = (
    "无",  # 000

    # 特殊炮弹
    "榴弹",  # 0001
    "凝固汽油弹",  # 0002
    "冷冻弹",  # 0003
    "毒气弹",  # 0004
    "催眠气体弹",  # 0005
    "麻痹气体弹",  # 0006
    "穿甲弹",  # 0007
    "聚能弹",  # 0008
    "ＡＰＦＳＤＳ弾",  # 0009
    "黏着弹",  # 000A
    "钻头弹",  # 000B
    "火箭弹",  # 000C
    "不发弹",  # 000D
    "狂乱弹",  # 000E

    # 人类恢复用道具
    "诅咒短信",  # 000F
    "垃圾短信",  # 0010
    "迷之请求书",  # 0011
    "变异萝卜的叶子",  # 0012
    "全恢复饮料",  # 0013
    "恢复饮料EX",  # 0014
    "能量注射器",  # 0015
    "能量胶囊",  # 0016
    "ＶＭ－Ｘ",  # 0017
    "恢复饮料",  # 0018
    "感克星Z",  # 0019
    "净化水",  # 001A
    "艾尔鲁斯的地下水",  # 001B
    "欢乐饮料",  # 001C
    "恢复胶囊",  # 001D
    "欢乐糖果",  # 001E
    "麻药胶囊",  # 001F
    "信天翁火锅",  # 0020
    "滑溜溜烧烤",  # 0021
    "大份玉米卷",  # 0022
    "三明治",  # 0023
    "郊游便当",  # 0024
    "烤鼠尾",  # 0025
    "油炸注射鸟翅",  # 0026
    "甜蜜瓜",  # 0027
    "圆南瓜",  # 0028
    "变异萝卜的根",  # 0029
    "再生胶囊",  # 002A
    "许德拉之泪",  # 002B
    "超级麻痹灵",  # 002C
    "硝酸甘油",  # 002D
    "许德拉精华液",  # 002E
    "麻痹灵",  # 002F
    "碱性石蜡",  # 0030
    "除酸喷雾",  # 0031
    "除酸乳液",  # 0032
    "许德拉水",  # 0033
    "咖啡因药剂",  # 0034
    "回復道具预备１",  # 0035

    # 人类战斗用道具
    "观察仪",  # 0036
    "侦察仪",  # 0037
    "蛾翅",  # 0038
    "DDT喷雾",  # 0039
    "浓缩甲基",  # 003A
    "冰冻酒瓶DX",  # 003B
    "冰冻酒瓶",  # 003C
    "硝化酒瓶DX",  # 003D
    "硝化酒瓶",  # 003E
    "火瓶",  # 003F
    "兴奋剂",  # 0040
    "极速丸",  # 0041
    "炎热克星",  # 0042
    "灭火器",  # 0043
    "寒冷克星",  # 0044
    "热电磁怀炉",  # 0045
    "奥尔加的发电机",  # 0046
    "便携保护罩L",  # 0047
    "便携保护罩S",  # 0048
    "烈性摇头丸",  # 0049
    "安眠药DX",  # 004A
    "强力造云素",  # 004B
    "发烟筒",  # 004C
    "造云素",  # 004D
    "烟幕烟花",  # 004E
    "ＲＰＧ７",  # 004F
    "DD菠萝炸弹",  # 0050
    "手榴弹",  # 0051
    "铅笔导弹",  # 0052
    "火箭烟花",  # 0053
    "小石子",  # 0054
    "大石头",  # 0055
    "轻石",  # 0056
    "奇怪海带",  # 0057
    "藤壶手枪",  # 0058
    "超级波奇能量瓶",  # 0059
    "波奇能量瓶",  # 005A
    "波奇骨头",  # 005B
    "汪汪能量剂",  # 005C
    "汪汪饮料",  # 005D
    "黄书",  # 005E
    "战斗道具准备１",  # 005F
    "战斗道具准备２",  # 0060
    "战斗道具准备３",  # 0061
    "战斗道具准备４",  # 0062

    # 人类用道具
    "i护镜",  # 0063
    "BS控制器",  # 0064
    "量子人偶1",  # 0065
    "量子人偶2",  # 0066
    "量子人偶3",  # 0067
    "量子人偶4",  # 0068
    "量子人偶5",  # 0069
    "量子人偶6",  # 006A
    "量子人偶7",  # 006B
    "量子人偶8",  # 006C
    "量子人偶9",  # 006D
    "量子人偶10",  # 006E
    "量子人偶11",  # 006F
    "量子人偶12",  # 0070
    "量子人偶13",  # 0071
    "量子人偶14",  # 0072
    "量子人偶15",  # 0073
    "量子人偶16",  # 0074
    "量子人偶17",  # 0075
    "量子人偶18",  # 0076
    "量子人偶19",  # 0077
    "量子人偶20",  # 0078
    "量子人偶21",  # 0079
    "量子人偶22",  # 007A
    "量子人偶23",  # 007B
    "量子人偶24",  # 007C
    "量子人偶25",  # 007D
    "量子人偶26",  # 007E
    "量子人偶27",  # 007F
    "量子人偶28",  # 0080
    "量子人偶29",  # 0081
    "量子人偶30",  # 0082
    "量子人偶31",  # 0083
    "量子人偶32",  # 0084
    "量子人偶33",  # 0085
    "量子人偶34",  # 0086
    "量子人偶35",  # 0087
    "量子人偶36",  # 0088
    "量子人偶37",  # 0089
    "量子人偶38",  # 008A
    "量子人偶39",  # 008B
    "量子人偶40",  # 008C
    "量子人偶41",  # 008D
    "量子人偶42",  # 008E
    "量子人偶43",  # 008F
    "量子人偶44",  # 0090
    "量子人偶45",  # 0091
    "量子人偶46",  # 0092
    "量子人偶47",  # 0093
    "量子人偶48",  # 0094
    "量子人偶49",  # 0095
    "量子人偶50",  # 0096
    "量子人偶51",  # 0097
    "量子人偶52",  # 0098
    "量子人偶53",  # 0099
    "量子人偶54",  # 009A
    "量子人偶55",  # 009B
    "量子人偶56",  # 009C
    "量子人偶57",  # 009D
    "量子人偶58",  # 009E
    "量子人偶59",  # 009F
    "量子人偶60",  # 00A0
    "量子人偶61",  # 00A1
    "量子人偶62",  # 00A2
    "量子人偶63",  # 00A3
    "量子人偶64",  # 00A4
    "量子人偶65",  # 00A5
    "量子人偶66",  # 00A6
    "量子人偶67",  # 00A7
    "量子人偶68",  # 00A8
    "量子人偶69",  # 00A9
    "量子人偶70",  # 00AA
    "量子人偶71",  # 00AB
    "量子人偶72",  # 00AC
    "量子人偶73",  # 00AD
    "量子人偶74",  # 00AE
    "量子人偶75",  # 00AF
    "量子人偶76",  # 00B0
    "量子人偶77",  # 00B1
    "量子人偶78",  # 00B2
    "量子人偶79",  # 00B3
    "超级金属探测器",  # 00B4
    "金属探测器",  # 00B5
    "电子锁破解器",  # 00B6
    "游戏君 ",  # 00B7
    "杰克BOY",  # 00B8
    "汪汪美食家",  # 00B9
    "界限突破因子",  # 00BA
    "纹身贴纸",  # 00BB
    "美肌乳液",  # 00BC
    "古旧硬币",  # 00BD
    "丢失的钱包",  # 00BE
    "绿色喷漆罐",  # 00BF
    "红色喷漆罐",  # 00C0
    "蓝色喷漆罐",  # 00C1
    "黄色喷漆罐",  # 00C2
    "粉色喷漆罐",  # 00C3
    "黑色喷漆罐",  # 00C4
    "黄金喷漆",  # 00C5
    "白金喷漆",  # 00C6
    "圣诞之吻贴纸",  # 00C7
    "君吻贴纸",  # 00C8
    "秘密贴纸",  # 00C9
    "欢乐贴纸",  # 00CA
    "豪华贴纸",  # 00CB
    "随意贴纸",  # 00CC
    "荒唐贴纸",  # 00CD
    "拍肩贴纸",  # 00CE
    "可爱贴纸",  # 00CF
    "黄金贴纸",  # 00D0
    "白金贴纸",  # 00D1
    "洗车拖把",  # 00D2
    "军号",  # 00D3
    "液体灭蚊灵",  # 00D4
    "灭蚊灵",  # 00D5
    "妹妹的毛巾",  # 00D6
    "内森的毛巾",  # 00D7
    "会员卡",  # 00D8
    "欢乐袋",  # 00D9
    "修理套装",  # 00DA
    "机械师套装",  # 00DB
    "●电子管",  # 00DC
    "乙女电子管",  # 00DD
    "◎电子管",  # 00DE
    "3电子管",  # 00DF
    "＄电子管",  # 00E0
    "×电子管",  # 00E1
    "心电子管",  # 00E2
    "炎电子管",  # 00E3
    "猫电子管",  # 00E4
    "微笑电子管",  # 00E5
    "波动缎带",  # 00E6
    "波动王冠",  # 00E7
    "波动礼貌",  # 00E8
    "波动童话帽",  # 00E9
    "波动鬼独角",  # 00EA
    "波动狮王毛发",  # 00EB
    "奇怪的枯木",  # 00EC
    "火箭燃料",  # 00ED
    "超级稀有金属",  # 00EE
    "稀有金属",  # 00EF
    "高纯度金属",  # 00F0
    "不纯金属",  # 00F1
    "硬弹壳",  # 00F2
    "软弹壳",  # 00F3
    "APFS箭壳",  # 00F4
    "锥形聚能弹壳",  # 00F5
    "金属弹壳",  # 00F6
    "钻头",  # 00F7
    "穿甲弹壳",  # 00F8
    "火箭弹壳",  # 00F9
    "炸药",  # 00FA
    "凝固汽油罐",  # 00FB
    "冷冻气体罐",  # 00FC
    "毒气罐",  # 00FD
    "催眠气体罐",  # 00FE
    "麻痹气体罐",  # 00FF
    "粘着剂罐",  # 0100
    "狂暴气体罐",  # 0101
    "近接保险丝",  # 0102
    "冲击保险丝",  # 0103
    "汇流环",  # 0104
    "门罗炸药",  # 0105
    "小塑料瓶",  # 0106
    "普通塑料瓶",  # 0107
    "大塑料瓶",  # 0108
    "碘海带",  # 0109
    "迷之橡胶气球",  # 010A
    "欢乐之壶",  # 010B
    "白金棒",  # 010C
    "金棒",  # 010D
    "银棒",  # 010E
    "超流动核心",  # 010F
    "铜棒",  # 0110
    "某种电子零件",  # 0111
    "红色吊架",  # 0112
    "茧怪纤维",  # 0113
    "陈年葡萄酒",  # 0114
    "陈年威士忌",  # 0115
    "陈年白兰地",  # 0116
    "陈年龙舌兰酒",  # 0117
    "陈年伏特加",  # 0118
    "陈年利口酒",  # 0119
    "魔芋",  # 011A
    "黄色青蛙",  # 011B
    "无眼鱼",  # 011C
    "滑溜溜细胞",  # 011D
    "冷冰冰细胞",  # 011E
    "兔肉",  # 011F
    "猪肉",  # 0120
    "蛇肉",  # 0121
    "蚂蚁腿",  # 0122
    "鳖肉",  # 0123
    "迷之肉",  # 0124
    "鼠肉",  # 0125
    "恐贝肉身",  # 0126
    "信天翁胸肉",  # 0127
    "信天翁翅",  # 0128
    "鳄鱼腿",  # 0129
    "注射鸟翅",  # 012A
    "巨大鱼翅",  # 012B
    "蓝鳄鱼之尾",  # 012C
    "滑溜溜黄金细胞",  # 012D
    "黄金兔肉",  # 012E
    "黄金猪肉",  # 012F
    "黄金蛇肉",  # 0130
    "黄金蚂蚁腿",  # 0131
    "黄金鳖肉",  # 0132
    "棒球集换卡",  # 0133
    "签名棒球",  # 0134
    "柔软棒球",  # 0135
    "坚硬棒球",  # 0136
    "破旧棒球",  # 0137
    "焦黑棒球",  # 0138
    "冷血党ID卡",  # 0139
    "老鼠ID卡",  # 013A
    "队长ID卡",  # 013B
    "研究所ID卡",  # 013C
    "大佐ID卡",  # 013D
    "稻草人通信机",  # 013E
    "抹布",  # 013F
    "点火钥匙",  # 0140
    "变形因子",  # 0141
    "金戒指",  # 0142
    "钻石戒指",  # 0143
    "银项链",  # 0144
    "红宝石戒指",  # 0145
    "浸满汗水的护身符",  # 0146
    "死去客人的行李",  # 0147
    "缪特香囊",  # 0148
    "破旧袋子",  # 0149
    "海珐的照片",  # 014A
    "金吊坠",  # 014B
    "金吊坠",  # 014C
    "图科的地图",  # 014D
    "走私浮标",  # 014E
    "事务室长的记录",  # 014F
    "尸体的纸片",  # 0150
    "密码的纸片",  # 0151
    "迷之纸片",  # 0152
    "舰长的记录",  # 0153
    "米格的记录",  # 0154
    "一叠信件",  # 0155
    "大佐的日记",  # 0156
    "深棕色的照片",  # 0157
    "深棕色的照片",  # 0158
    "变成白骨的男子的日记",  # 0159
    "情侣的遗书",  # 015A
    "科学家的记录",  # 015B
    "新药调和单",  # 015C
    "没署名的信",  # 015D
    "钥匙串",  # 015E
    "下水井的钥匙",  # 015F
    "冷血党钥匙",  # 0160
    "事务室长的钥匙",  # 0161
    "研究所的钥匙",  # 0162
    "特斯拉电池",  # 0163
    "双子莲",  # 0164

    # 人类头用防具
    "男人味头巾",  # 0165
    "藤壶眼镜",  # 0166
    "锅盖",  # 0167
    "野球帽",  # 0168
    "虎纹帽",  # 0169
    "波奇围巾",  # 016A
    "缪特假发",  # 016B
    "波奇护目镜",  # 016C
    "护目镜帽",  # 016D
    "焊接安全帽",  # 016E
    "战士头巾",  # 016F
    "护士帽",  # 0170
    "迷彩贝雷帽",  # 0171
    "VIP浴帽",  # 0172
    "埃及法老帽",  # 0173
    "护目镜帽Ⅱ",  # 0174
    "怪力包头巾",  # 0175
    "安全帽",  # 0176
    "防弹假发",  # 0177
    "多明毛",  # 0178
    "铁锅",  # 0179
    "医用面具",  # 017A
    "波奇面具",  # 017B
    "战国头盔",  # 017C
    "纤维头盔",  # 017D
    "波奇安全帽",  # 017E
    "CVC安全帽",  # 017F
    "英雄面具",  # 0180
    "蛾帽子",  # 0181
    "曲棍球面具",  # 0182
    "萨拉托加头盔",  # 0183

    # 人类体用防具
    "男人味围腰带",  # 0184
    "红裤衩",  # 0185
    "被烧过的罩衣",  # 0186
    "骷髅皮夹克",  # 0187
    "人妻连衣裙",  # 0188
    "运动短裤",  # 0189
    "豪华礼服",  # 018A
    "女仆装",  # 018B
    "皱巴巴的西装",  # 018C
    "缪特的皮",  # 018D
    "牛仔布工作服",  # 018E
    "人妻浴衣",  # 018F
    "防弹白衣",  # 0190
    "活力裤袜",  # 0191
    "黑色棒球运动装",  # 0192
    "人妻睡衣",  # 0193
    "精心缝制的衣服",  # 0194
    "蓝领布衣",  # 0195
    "迷彩服",  # 0196
    "皮制工作服",  # 0197
    "欢乐神教工作服",  # 0198
    "红色队服",  # 0199
    "波奇运动衣",  # 019A
    "VIP浴衣",  # 019B
    "欢乐神教长袍",  # 019C
    "桑拿连体衣",  # 019D
    "飞行服",  # 019E
    "安全服",  # 019F
    "波奇背心",  # 01A0
    "战斗连体衣",  # 01A1
    "潜水服",  # 01A2
    "医用服",  # 01A3
    "波奇夹克",  # 01A4
    "铁BRA",  # 01A5
    "迷彩装",  # 01A6
    "迷彩紧身衣",  # 01A7
    "消防服",  # 01A8
    "特技装",  # 01A9
    "高开叉装甲",  # 01AA
    "战国盔甲",  # 01AB
    "CVC服",  # 01AC
    "波奇服",  # 01AD
    "防弹旗袍",  # 01AE
    "护盾披风",  # 01AF
    "防虫装",  # 01B0
    "量子人偶",  # 01B1
    "金属外套",  # 01B2
    "量子人偶",  # 01B3
    "波奇金属",  # 01B4
    "炙烤行者",  # 01B5
    "量子人偶",  # 01B6
    "量子人偶",  # 01B7
    "阿尔梅达背心",  # 01B8
    "量子人偶",  # 01B9
    "波奇盔甲",  # 01BA
    "萨拉托加服装",  # 01BB
    "萨拉托加盔甲",  # 01BC
    "蒸镀盔甲",  # 01BD
    "镜面比基尼",  # 01BE
    "量子人偶",  # 01BF
    "量子人偶",  # 01C0

    # 人类腕用防具
    "男人味手套",  # 01C1
    "厨师手套",  # 01C2
    "橡胶手套",  # 01C3
    "军用手套",  # 01C4
    "格斗护手绷带",  # 01C5
    "欢乐神手套",  # 01C6
    "缪特的爪子",  # 01C7
    "皮革手套",  # 01C8
    "波奇铁爪",  # 01C9
    "银手套",  # 01CA
    "美式指套",  # 01CB
    "医用护盾",  # 01CC
    "艺术手套",  # 01CD
    "摔跤手套",  # 01CE
    "波奇钢爪",  # 01CF
    "重金属手套",  # 01D0
    "黄金手套",  # 01D1
    "驾驶员手套",  # 01D2
    "医用手套",  # 01D3
    "推手手套",  # 01D4
    "怪力手套",  # 01D5
    "CVC手套",  # 01D6
    "树怪护盾",  # 01D7
    "大关力士手套",  # 01D8
    "防弹手套",  # 01D9
    "手甲",  # 01DA
    "萨拉托加手套",  # 01DB
    "横纲力士手套",  # 01DC
    "三冠手套",  # 01DD

    # 人类足用防具
    "男人味袜子",  # 01DE
    "减肥拖鞋",  # 01DF
    "焦黑鞋子",  # 01E0
    "胶底袜子",  # 01E1
    "长满苔藓的凉鞋",  # 01E2
    "足球鞋",  # 01E3
    "海藻缠绕的凉鞋",  # 01E4
    "欢乐神鞋",  # 01E5
    "英式长靴",  # 01E6
    "缪特的脚",  # 01E7
    "橡胶长靴",  # 01E8
    "猎人靴",  # 01E9
    "焊接靴",  # 01EA
    "斗技场鞋子",  # 01EB
    "艺术鞋子",  # 01EC
    "人妻长筒袜",  # 01ED
    "西部牛仔靴",  # 01EE
    "铁束腰",  # 01EF
    "商人鞋",  # 01F0
    "厚底靴",  # 01F1
    "战斗钉鞋",  # 01F2
    "士兵长靴",  # 01F3
    "战斗长筒袜",  # 01F4
    "波奇紧身裤",  # 01F5
    "铁木屐",  # 01F6
    "安全鞋",  # 01F7
    "神风高跟鞋",  # 01F8
    "医用鞋",  # 01F9
    "鳄鱼长靴",  # 01FA
    "战国鞋",  # 01FB
    "波奇护腿",  # 01FC
    "金属护腿",  # 01FD
    "CVC靴",  # 01FE
    "多层靴子",  # 01FF
    "萨拉托加鞋",  # 0200
    "保镖鞋",  # 0201
    "太妹皮靴",  # 0202

    # 人类用装饰品
    "波奇摩托",  # 0203
    "波奇汽车",  # 0204
    "波奇坦克",  # 0205
    "超级波奇坦克",  # 0206
    "皱巴巴的领带",  # 0207
    "墨镜",  # 0208
    "宝石发饰",  # 0209
    "接地尾巴",  # 020A
    "发卡",  # 020B
    "防毒面具",  # 020C
    "钢之发饰",  # 020D
    "红色围巾",  # 020E
    "碳素纳米触角",  # 020F
    "纤维耳机",  # 0210
    "镜面面纱",  # 0211
    "缪特的尾巴",  # 0212
    "手织围巾",  # 0213
    "危险导火线",  # 0214
    "旗鱼眼玛瑙",  # 0215
    "欢乐神戒   ",  # 0216
    "波奇领结",  # 0217
    "猎人探测器",  # 0218
    "奥尔加的眼镜",  # 0219
    "治疗细胞",  # 021A
    "活体细胞",  # 021B
    "三冠腰带",  # 021C
    "欺骗披风",  # 021D

    # 人类用武器
    "徒手",  # 021E
    "弹弓",  # 021F
    "散射弩",  # 0220
    "铁管",  # 0221
    "铁凳子",  # 0222
    "弯掉的勺子",  # 0223
    "弩枪",  # 0224
    "铁鹿角",  # 0225
    "大马士革菜刀",  # 0226
    "燃烧炮",  # 0227
    "水用枪",  # 0228
    "危险的球棒",  # 0229
    "树怪棒槌",  # 022A
    "手枪",  # 022B
    "艺术麦克风",  # 022C
    "霰弹枪",  # 022D
    "蟹背喷火器",  # 022E
    "阿尔梅达钢爪",  # 022F
    "扳手回旋镖",  # 0230
    "巨大注射器",  # 0231
    "毒气枪",  # 0232
    "乌兹冲锋枪",  # 0233
    "波奇枪",  # 0234
    "危险的匕首",  # 0235
    "超合金椅子",  # 0236
    "萝卜棍",  # 0237
    "电击枪",  # 0238
    "激光枪",  # 0239
    "音波枪",  # 023A
    "危险的斧头",  # 023B
    "黄金麦克风",  # 023C
    "波奇火焰炮",  # 023D
    "火炎枪",  # 023E
    "手持火神炮",  # 023F
    "双管猎枪",  # 0240
    "绯牡丹短刀",  # 0241
    "波奇火神炮",  # 0242
    "超声波扩音器",  # 0243
    "44马格南枪",  # 0244
    "冷冷冻枪",  # 0245
    "遥控扳手",  # 0246
    "杀虫枪",  # 0247
    "多明戈斯机枪",  # 0248
    "高能镭射枪",  # 0249
    "龙息喷火器",  # 024A
    "电击鞭",  # 024B
    "８１mm战锤",  # 024C
    "火箭炮",  # 024D
    "超级扳手",  # 024E
    "波奇火箭炮",  # 024F
    "超级注射器",  # 0250
    "激光来复枪",  # 0251
    "青龙刀",  # 0252
    "喷射链锯",  # 0253
    "超级麦克风",  # 0254
    "爆裂弩",  # 0255
    "波奇镭射",  # 0256
    "暴雪枪",  # 0257
    "重金属枪",  # 0258
    "波奇超声波",  # 0259
    "火炎发射器",  # 025A
    "酸化枪",  # 025B
    "波奇之血",  # 025C
    "改良型边缘发火枪",  # 025D
    "SMG榴弹",  # 025E
    "波奇防护罩",  # 025F
    "象牙装饰的手枪",  # 0260
    "杀人电锯",  # 0261
    "波奇火箭发射器",  # 0262
    "介错刀",  # 0263
    "爆破锤",  # 0264
    "蜈蚣马格南",  # 0265
    "性感双剑",  # 0266
    "究极老鹰",  # 0267
    "130mm宙斯",  # 0268
    "火箭飞拳",  # 0269
    "波奇翼炮",  # 026A
    "特斯拉汽缸",  # 026B
    "量子人偶",  # 026C
    "保镖激光",  # 026D
    "超级杀虫枪",  # 026E
    "马赫声波枪",  # 026F
    "波奇闪电",  # 0270
    "ム蜈蚣火炬",  # 0271
    "汉子马格南",  # 0272
    "量子人偶",  # 0273
    "多弹发射暴动枪",  # 0274
    "往复式扳手",  # 0275
    "波奇暴风雪",  # 0276
    "量子人偶",  # 0277
    "绝命注射器",  # 0278
    "荒野烈火",  # 0279
    "寒冰巨龙",  # 027A
    "危险麦克风",  # 027B
    "光束军刀",  # 027C
    "音速扳手",  # 027D
    "量子人偶",  # 027E
    "浪潮针刺",  # 027F
    "空间麦克风",  # 0280
    "漫天火雨",  # 0281
    "量子人偶",  # 0282
    "电子旗鱼Mk50",  # 0283
    "ＴＮＴ炸弹魔",  # 0284
    "激光炮",  # 0285
    "波奇地狱业炎",  # 0286
    "电磁毁灭者",  # 0287
    "巫毒长枪",  # 0288
    "单手持突击步枪",  # 0289
    "光粒子电光",  # 028A
    "量子人偶",  # 028B
    "斩车刀",  # 028C
    "６６６蜂群炮",  # 028D
    "６６６火箭炮",  # 028E

    # 战车道具
    "空",  # 028F
    "传真系统",  # 0290
    "医疗箱ＤＸ",  # 0291
    "医疗箱",  # 0292
    "装甲包１００",  # 0293
    "装甲包２５０",  # 0294
    "装甲包５００",  # 0295
    "装甲包Ｌ",  # 0296
    "装甲包ＬＬ",  # 0297
    "露营好帮手",  # 0298
    "火箭加速器",  # 0299
    "伪装迷彩",  # 029A
    "碱性防护膜",  # 029B
    "镜面防护膜",  # 029C
    "隐形防护膜",  # 029D
    "防火防护膜",  # 029E
    "耐寒防护膜",  # 029F
    "接地链",  # 02A0
    "黑钢锁",  # 02A1
    "毛绒兔兔",  # 02A2
    "安全护身符",  # 02A3
    "邻居君",  # 02A4
    "增殖君",  # 02A5
    "废铁",  # 02A6
    "废铁",  # 02A7
    "废铁",  # 02A8
    "废铁",  # 02A9
    "废铁",  # 02AA
    "废铁",  # 02AB
    "废铁",  # 02AC
    "废铁",  # 02AD
    "废铁",  # 02AE
    "废铁",  # 02AF
    "生锈的铁轨",  # 02B0
    "梦幻铁块",  # 02B1
    "波波亚纳矿石",  # 02B2
    "高科技废铁",  # 02B3
    "高科技废铁",  # 02B4
    "高科技废铁",  # 02B5
    "高科技废铁",  # 02B6
    "高科技废铁",  # 02B7
    "冥界车轮",  # 02B8
    "金色头冠",  # 02B9
    "秘藏BOX",  # 02BA
    "铅化蘑菇",  # 02BB
    "巨大铅化蘑菇",  # 02BC
    "鸟粪",  # 02BD
    "信件印章",  # 02BE
    "クルマ道具预备１",  # 02BF
    "クルマ道具预备２",  # 02C0
    "迷之油桶",  # 02C1
    "沉重的水",  # 02C2
    "信仰铜像",  # 02C3
    "破烂",  # 02C4
    "迷之右前足",  # 02C5
    "迷之左前足",  # 02C6
    "迷之右後足",  # 02C7
    "迷之左後足",  # 02C8
    "迷之左半身",  # 02C9
    "迷之右半身",  # 02CA
    "迷之上半身",  # 02CB

    # 战车引擎
    "锨头引擎",  # 02CC
    "锨头引擎改",  # 02CD
    "锨头引擎Ｔ",  # 02CE
    "锨头引擎ＴＴ",  # 02CF
    "甲壳虫",  # 02D0
    "甲壳虫改",  # 02D1
    "涡轮甲壳虫",  # 02D2
    "涡轮甲壳虫Ⅱ",  # 02D3
    "强哥",  # 02D4
    "猛力强哥",  # 02D5
    "DOHC强哥",  # 02D6
    "电子控制强哥",  # 02D7
    "力士",  # 02D8
    "涡轮力士",  # 02D9
    "双驱动力士Ｔ",  # 02DA
    "三驱动力士Ｔ",  # 02DB
    "柴油3000",  # 02DC
    "公牛",  # 02DD
    "强力公牛",  # 02DE
    "欧米茄公牛",  # 02DF
    "神奇公牛",  # 02E0
    "龙卷",  # 02E1
    "龙卷Ⅱ",  # 02E2
    "龙卷Ⅲ",  # 02E3
    "龙卷Ⅳ",  # 02E4
    "龙卷Ⅴ",  # 02E5
    "苦力",  # 02E6
    "强力苦力",  # 02E7
    "最强苦力",  # 02E8
    "超绝苦力",  # 02E9
    "幼狮鱼涡轮",  # 02EA
    "小狮鱼涡轮",  # 02EB
    "中狮鱼涡轮",  # 02EC
    "成年狮鱼涡轮",  # 02ED
    "大狮鱼涡轮",  # 02EE
    "巨狮鱼涡轮",  # 02EF
    "千年狮鱼涡轮",  # 02F0
    "千年狮鱼涡轮Ｆ",  # 02F1
    "脉冲",  # 02F2
    "脉冲涡轮",  # 02F3
    "脉冲涡轮Ⅱ",  # 02F4
    "脉冲涡轮Ⅲ",  # 02F5
    "生物引擎",  # 02F6
    "生物涡轮",  # 02F7
    "生物DOHC",  # 02F8
    "电子控制生物",  # 02F9
    "喷气式生物",  # 02FA
    "欧米茄生物",  # 02FB
    "V24巨人",  # 02FC
    "V32巨人",  # 02FD
    "V48巨人",  # 02FE
    "V64巨人",  # 02FF
    "玄武涡轮",  # 0300
    "玄武双涡轮",  # 0301
    "玄武涡轮Ⅲ",  # 0302
    "玄武涡轮Ｚ",  # 0303
    "村正",  # 0304
    "涡轮村正",  # 0305
    "硝基村正",  # 0306
    "火箭村正",  # 0307
    "鲁道夫",  # 0308
    "鲁道夫涡轮",  # 0309
    "鲁道夫双驱动T",  # 030A
    "鲁道夫变气门引擎",  # 030B
    "风精灵α",  # 030C
    "风精灵β",  # 030D
    "风精灵γ",  # 030E
    "风精灵Ω",  # 030F
    "裸装卡门",  # 0310
    "OHC卡门",  # 0311
    "涡轮卡门",  # 0312
    "火箭卡门",  # 0313
    "二重火箭卡门",  # 0314
    "维纳斯喷气式",  # 0315
    "维纳斯喷气式Ｗ",  # 0316
    "维纳斯喷气式Ｓ",  # 0317
    "V48金刚",  # 0318
    "V66金刚",  # 0319
    "V100金刚",  # 031A
    "量子人偶",  # 031B
    "量子人偶",  # 031C
    "量子人偶",  # 031D
    "量子人偶",  # 031E
    "量子人偶",  # 031F
    "量子人偶",  # 0320
    "T-暴龙",  # 0321
    "陨石驱动",  # 0322
    "前兆",  # 0323
    "好朋友",  # 0324
    "生锈的引擎",  # 0325

    # 战车C装置
    "HAL800",  # 0326
    "感恩Ⅲ",  # 0327
    "艾米",  # 0328
    "沃兹尼亚克ＳⅠ",  # 0329
    "99式神话",  # 032A
    "拉克塔",  # 032B
    "诺伊曼加速器",  # 032C
    "所罗门３",  # 032D
    "出租系统",  # 032E
    "生物主脑",  # 032F
    "骑手主脑",  # 0330
    "无线警察",  # 0331
    "卡瓦耶罗2022",  # 0332
    "跳舞人偶",  # 0333
    "桑巴狂欢节",  # 0334
    "天空观查者",  # 0335
    "副炮核心",  # 0336
    "主炮核心",  # 0337
    "S-E核心",  # 0338
    "PAC3000",  # 0339
    "蜘蛛网",  # 033A
    "19式",  # 033B
    "泰坦巨人",  # 033C
    "阿波罗尼亚",  # 033D
    "埃及艳后",  # 033E
    "冥王星",  # 033F
    "AT打击者",  # 0340
    "塞纳2022",  # 0341
    "孤独杰克",  # 0342
    "天才777",  # 0343
    "量子人偶",  # 0344
    "量子人偶",  # 0345
    "量子人偶",  # 0346
    "量子人偶",  # 0347
    "量子人偶",  # 0348
    "量子人偶",  # 0349
    "HAL900",  # 034A
    "所罗门２",  # 034B
    "沃兹尼亚克Ⅱ",  # 034C
    "生锈的C装置",  # 034D

    # 战车主炮
    "４５mm炮",  # 034E
    "４８mm炮",  # 034F
    "５５mm炮",  # 0350
    "７５mm炮",  # 0351
    "８８mm炮",  # 0352
    "９０mm远程Ｔ型",  # 0353
    "火炉加农炮",  # 0354
    "８８mm火花炮",  # 0355
    "９５mm炮",  # 0356
    "９２mm火花炮",  # 0357
    "萌萌火炮",  # 0358
    "９８mm炮",  # 0359
    "１０５mm加农炮",  # 035A
    "吊车炮",  # 035B
    "１１０mm低位炮",  # 035C
    "１０５mm爆射炮",  # 035D
    "１１５mm远程Ｔ型",  # 035E
    "１２０mm加农炮",  # 035F
    "１２０mm远程Ｔ型",  # 0360
    "激光加农炮",  # 0361
    "１２５mm加农炮",  # 0362
    "１１５mm火花炮",  # 0363
    "火花巨角炮",  # 0364
    "１１５mm爆射炮",  # 0365
    "１２５mm远程Ｔ型",  # 0366
    "白金殿堂炮",  # 0367
    "量子人偶",  # 0368
    "１３５mm加农炮",  # 0369
    "１２０mm火花炮",  # 036A
    "１４０mm火花炮",  # 036B
    "１５５mm加农炮",  # 036C
    "猴子加农炮",  # 036D
    "钻头加农炮",  # 036E
    "１５５mm火花炮",  # 036F
    "八岐大蛇",  # 0370
    "超声波加农炮",  # 0371
    "火星爆射炮",  # 0372
    "土星爆射炮",  # 0373
    "１６５mm幽灵炮",  # 0374
    "１８０mm爆射炮",  # 0375
    "量子人偶",  # 0376
    "１６５mm远程Ｔ型",  # 0377
    "炸裂军刀炮",  # 0378
    "１７７mm非晶态炮",  # 0379
    "１９５mm爆射炮",  # 037A
    "１９５mm加农炮",  # 037B
    "量子人偶",  # 037C
    "电磁投射炮",  # 037D
    "２０５mm绯牡丹炮",  # 037E
    "特利昂炮",  # 037F
    "量子人偶",  # 0380
    "２０５mm加农炮",  # 0381
    "电击炮",  # 0382
    "２２５mm许德拉炮",  # 0383
    "噩运振动炮",  # 0384
    "导弹加农炮",  # 0385
    "２２０mm地母神炮",  # 0386
    "量子发电炮",  # 0387
    "灵子加农炮",  # 0388
    "杰克未完成炮",  # 0389
    "恐龙炮",  # 038A
    "怪兽炮",  # 038B
    "虎王旋风",  # 038C
    "量子人偶",  # 038D
    "量子人偶",  # 038E
    "雷电钻头",  # 038F
    "U鲨潜艇炮",  # 0390
    "生锈大炮",  # 0391
    "无",  # 0392
    "主炮类",  # 0393

    # 战车副炮
    "７mm机枪",  # 0394
    "７．７mm机枪",  # 0395
    "９mm机枪",  # 0396
    "格林炮",  # 0397
    "１３mm机枪",  # 0398
    "１１mm火神炮",  # 0399
    "冷气放射器",  # 039A
    "９mm重机枪",  # 039B
    "１５mm火神炮",  # 039C
    "芥子毒蛇",  # 039D
    "音痴扩音器",  # 039E
    "１６mm机枪",  # 039F
    "激光骑枪",  # 03A0
    "雷电炸裂炮",  # 03A1
    "爆炎喷射器",  # 03A2
    "１３mm重机枪",  # 03A3
    "２４mm机关炮",  # 03A4
    "巨炮",  # 03A5
    "重击角笛",  # 03A6
    "突击镭射枪",  # 03A7
    "时光停止器",  # 03A8
    "１８mm火神炮",  # 03A9
    "火焰枪",  # 03AA
    "破坏长笛",  # 03AB
    "冻结枪",  # 03AC
    "重型枪",  # 03AD
    "Mr.烟囱",  # 03AE
    "烈焰龙",  # 03AF
    "２２mm火神炮",  # 03B0
    "猛牛火神炮",  # 03B1
    "绯牡丹火神炮",  # 03B2
    "玫瑰火神炮",  # 03B3
    "雷电风暴",  # 03B4
    "杨贵妃火神炮",  # 03B5
    "土星冻结炮",  # 03B6
    "巨人炮",  # 03B7
    "杰克清道夫",  # 03B8
    "炫日光束",  # 03B9
    "生锈机枪",  # 03BA
    "副炮类",  # 03BB

    # 战车S-E
    "小型导弹",  # 03BC
    "光束抹杀炮",  # 03BD
    "导弹发射器",  # 03BE
    "扩散光束炮",  # 03BF
    "3的奇迹",  # 03C0
    "ATM恶魔",  # 03C1
    "踢踏舞者",  # 03C2
    "大蛇导弹",  # 03C3
    "高精度导弹",  # 03C4
    "爆炎炸裂者",  # 03C5
    "超级导弹1号",  # 03C6
    "诱导CAT",  # 03C7
    "棒球发球机",  # 03C8
    "疯狂厨师",  # 03C9
    "小型包装袋",  # 03CA
    "生化破坏者",  # 03CB
    "机械粉碎者",  # 03CC
    "轰天弹",  # 03CD
    "蜈蚣炸弹",  # 03CE
    "米加粒子炮",  # 03CF
    "沙门菌猿导弹",  # 03D0
    "铁球巨人",  # 03D1
    "LI花生仁",  # 03D2
    "火焰球",  # 03D3
    "圆周破坏者",  # 03D4
    "沙门菌猿导弹α",  # 03D5
    "硝基清道夫",  # 03D6
    "连续凤凰",  # 03D7
    "钢球巨人",  # 03D8
    "金珠Z",  # 03D9
    "一发逆转神话",  # 03DA
    "二重身",  # 03DB
    "疾风骤雨",  # 03DC
    "宇宙炸弹",  # 03DD
    "北极风",  # 03DE
    "红莲女武神",  # 03DF
    "雷电之冠",  # 03E0
    "DDT暴雨",  # 03E1
    "ATM绯牡丹",  # 03E2
    "高音暴风",  # 03E3
    "极光冻结者",  # 03E4
    "超越彩虹",  # 03E5
    "AT爱国者",  # 03E6
    "蛇女妖镭射",  # 03E7
    "扩散式密集阵系统",  # 03E8
    "闪光迎击神话",  # 03E9
    "超光速快子雷达",  # 03EA
    "S-龙卷",  # 03EB
    "生锈导弹",  # 03EC
    "S-E类",  # 03ED

    # 固定武器
    "二本角",  # 03EE
    "二连加农炮",  # 03EF
    "饿狼火花炮",  # 03F0
    "二本角Ⅱ",  # 03F1
    "二连加农炮Ⅱ",  # 03F2
    "饿狼火花炮Ⅱ",  # 03F3
    "究极加农炮",  # 03F4
    "究极加农炮Ⅱ",  # 03F5
    "究极加农炮Ⅲ",  # 03F6
    "究极加农炮Ⅳ",  # 03F7
    "越野摩托火神炮",  # 03F8
    "三管火神炮",  # 03F9
    "双管火神炮",  # 03FA
    "越野摩托炮Ⅱ",  # 03FB
    "二连骑射枪",  # 03FC
    "急速火神炮",  # 03FD
    "骑射枪",  # 03FE
    "越野摩托炮Ⅲ",  # 03FF
    "骑手激光",  # 0400
    "高精度导弹Ｒ",  # 0401
    "骑手导弹",  # 0402
    "坦克导弹",  # 0403
    "次元镭射炮",  # 0404
    "骑手火焰",  # 0405
    "火焰旋风",  # 0406
    "越野摩托导弹",  # 0407
    "四次元镭射炮",  # 0408
    "高精度导弹Ｘ",  # 0409
    "高爆导弹",  # 040A
    "异次元镭射炮",  # 040B
    "坦克导弹Ⅱ",  # 040C
    "高爆导弹Ⅱ",  # 040D
    "骑手翼炮",  # 040E
    "坦克翼炮",  # 040F
    "精准翼炮",  # 0410
    "巡逻车翼炮",  # 0411
    "坦克翼炮Ⅱ",  # 0412
    "精准翼炮Ⅱ",  # 0413
    "４０mm机关炮",  # 0414
    "４４mm机关炮",  # 0415
    "机炮四重奏",  # 0416
    "对空导弹炮",  # 0417
    "终极放射炮",  # 0418
    "PAC导弹炮",  # 0419
    "多弹头圣剑",  # 041A
    "ARH大蛇",  # 041B
    "钛合金钻头",  # 041C
    "尖刺保险杠",  # 041D
    "钛合金重剑",  # 041E
    "喷射钻头",  # 041F
    "大钻头",  # 0420
    "巨人钻头",  # 0421
    "巨大钻头",  # 0422
    "喷射钻头Ⅱ",  # 0423
    "双重钻头",  # 0424
    "独眼巨人钻头",  # 0425
    "超巨型钻头",  # 0426
    "鼻子加农炮",  # 0427
    "鼻子加农炮Ⅱ",  # 0428
    "鼻子加农炮Ⅲ",  # 0429
    "鼻子加农炮Ⅳ",  # 042A
    "鼻子加农炮Ⅴ",  # 042B
    "鼻子加农炮Ⅵ",  # 042C
    "鼻子加农炮Ⅶ",  # 042D
    "鼻子火焰",  # 042E
    "鼻子火焰Ⅱ",  # 042F
    "鼻子火焰Ⅲ",  # 0430
    "鼻子火焰Ⅳ",  # 0431
    "鼻子火焰Ⅴ",  # 0432
    "鼻子火焰Ⅵ",  # 0433
    "鼻子火焰Ⅶ",  # 0434
    "鼻子暴风雪",  # 0435
    "鼻子暴风雪Ⅱ",  # 0436
    "鼻子暴风雪Ⅲ",  # 0437
    "鼻子暴风雪Ⅳ",  # 0438
    "鼻子暴风雪Ⅴ",  # 0439
    "鼻子暴风雪Ⅵ",  # 043A
    "鼻子暴风雪Ⅶ",  # 043B
    "鼻子剧毒",  # 043C
    "鼻子剧毒Ⅱ",  # 043D
    "鼻子剧毒Ⅲ",  # 043E
    "鼻子剧毒Ⅳ",  # 043F
    "鼻子剧毒Ⅴ",  # 0440
    "鼻子剧毒Ⅵ",  # 0441
    "鼻子剧毒Ⅶ",  # 0442
    "长毛象之翼",  # 0443
    "长毛象之翼Ⅱ",  # 0444
    "长毛象之翼Ⅲ",  # 0445
    "长毛象之翼Ⅳ",  # 0446
    "生化导弹",  # 0447
    "生化导弹Ⅱ",  # 0448
    "生化导弹Ⅲ",  # 0449
    "生化导弹Ⅳ",  # 044A
    "巨角激光炮",  # 044B
    "巨角激光炮Ⅱ",  # 044C
    "巨角激光炮Ⅲ",  # 044D
    "巨角激光炮Ⅳ",  # 044E
    "巨角激光炮Ⅴ",  # 044F
    "巨角激光炮Ⅵ",  # 0450
    "巨角激光炮Ⅶ",  # 0451
    "音速巨角",  # 0452
    "音速巨角Ⅱ",  # 0453
    "音速巨角Ⅲ",  # 0454
    "音速巨角Ⅳ",  # 0455
    "音速巨角Ⅴ",  # 0456
    "音速巨角Ⅵ",  # 0457
    "音速巨角Ⅶ",  # 0458
    "雷暴巨角",  # 0459
    "雷暴巨角Ⅱ",  # 045A
    "雷暴巨角Ⅲ",  # 045B
    "雷暴巨角Ⅳ",  # 045C
    "雷暴巨角Ⅴ",  # 045D
    "雷暴巨角Ⅵ",  # 045E
    "雷暴巨角Ⅶ",  # 045F
    "钻头巨角",  # 0460
    "钻头巨角Ⅱ",  # 0461
    "钻头巨角Ⅲ",  # 0462
    "钻头巨角Ⅳ",  # 0463
    "钻头巨角Ⅴ",  # 0464
    "钻头巨角Ⅵ",  # 0465
    "钻头巨角Ⅶ",  # 0466
    "甲虫机枪",  # 0467
    "剧毒墨汁",  # 0468
    "剧毒墨汁Ⅱ",  # 0469
    "剧毒墨汁Ⅲ",  # 046A
    "剧毒墨汁Ⅳ",  # 046B
    "剧毒墨汁Ⅴ",  # 046C
    "剧毒墨汁Ⅵ",  # 046D
    "剧毒墨汁Ⅶ",  # 046E
    "音速喷射",  # 046F
    "音速喷射Ⅱ",  # 0470
    "音速喷射Ⅲ",  # 0471
    "音速喷射Ⅳ",  # 0472
    "音速喷射Ⅴ",  # 0473
    "音速喷射Ⅵ",  # 0474
    "音速喷射Ⅶ",  # 0475
    "寒冰喷射",  # 0476
    "寒冰喷射Ⅱ",  # 0477
    "寒冰喷射Ⅲ",  # 0478
    "寒冰喷射Ⅳ",  # 0479
    "寒冰喷射Ⅴ",  # 047A
    "寒冰喷射Ⅵ",  # 047B
    "寒冰喷射Ⅶ",  # 047C
    "火焰喷射",  # 047D
    "火焰喷射Ⅱ",  # 047E
    "火焰喷射Ⅲ",  # 047F
    "火焰喷射Ⅳ",  # 0480
    "火焰喷射Ⅴ",  # 0481
    "火焰喷射Ⅵ",  # 0482
    "火焰喷射Ⅶ",  # 0483
    "巨角加农炮",  # 0484
    "巨角加农炮Ⅱ",  # 0485
    "巨角加农炮Ⅲ",  # 0486
    "巨角加农炮Ⅳ",  # 0487
    "巨角加农炮Ⅴ",  # 0488
    "巨角加农炮Ⅵ",  # 0489
    "巨角加农炮Ⅶ",  # 048A
    "镭射巨角",  # 048B
    "镭射巨角Ⅱ",  # 048C
    "镭射巨角Ⅲ",  # 048D
    "镭射巨角Ⅳ",  # 048E
    "镭射巨角Ⅴ",  # 048F
    "镭射巨角Ⅵ",  # 0490
    "镭射巨角Ⅶ",  # 0491
    "电击巨角",  # 0492
    "电击巨角Ⅱ",  # 0493
    "电击巨角Ⅲ",  # 0494
    "电击巨角Ⅳ",  # 0495
    "电击巨角Ⅴ",  # 0496
    "电击巨角Ⅵ",  # 0497
    "电击巨角Ⅶ",  # 0498
    "钻头长枪",  # 0499
    "钻头长枪Ⅱ",  # 049A
    "钻头长枪Ⅲ",  # 049B
    "钻头长枪Ⅳ",  # 049C
    "钻头长枪Ⅴ",  # 049D
    "钻头长枪Ⅵ",  # 049E
    "钻头长枪Ⅶ",  # 049F
    "三角龙火神炮",  # 04A0
    "三角龙火神炮Ⅱ",  # 04A1
    "三角龙火神炮Ⅲ",  # 04A2
    "三角龙火神炮Ⅳ",  # 04A3
    "三角龙火神炮Ⅴ",  # 04A4
    "三角龙加农炮",  # 04A5
    "三角龙加农炮Ⅱ",  # 04A6
    "三角龙加农炮Ⅲ",  # 04A7
    "神龛发射器",  # 04A8
    "神龛导弹",  # 04A9
    "神龛之翼",  # 04AA
    "神龛导弹Ⅱ",  # 04AB
    "神龛大厅",  # 04AC
    "边车摩托",  # 04AD

    # 底盘
    "剃刀摩托",  # 04AE
    "加农炮骑手",  # 04AF
    "猎手",  # 04B0
    "加农炮钻机",  # 04B1
    "加农炮野猫",  # 04B2
    "蛮荒公牛",  # 04B3
    "牛仔",  # 04B4
    "空降Ｄ",  # 04B5
    "鱼雷Ｄ",  # 04B6
    "鱼雷Ｄ",  # 04B7
    "超级汽水Ｄ",  # 04B8
    "空降Ｃ",  # 04B9
    "鱼雷Ｃ",  # 04BA
    "加农炮汽水Ｃ",  # 04BB
    "超级汽水Ｃ",  # 04BC
    "空降Ｂ",  # 04BD
    "鱼雷Ｂ",  # 04BE
    "加农炮汽水Ｂ",  # 04BF
    "超级汽水Ｂ",  # 04C0
    "空降",  # 04C1
    "加农炮汽水",  # 04C2
    "鱼雷",  # 04C3
    "超级汽水",  # 04C4
    "巡逻车",  # 04C5
    "武装警察",  # 04C6
    "重装警察",  # 04C7
    "特攻警察",  # 04C8
    "武装警察2部",  # 04C9
    "重装警察2部",  # 04CA
    "特攻警察2部",  # 04CB
    "无敌警察",  # 04CC
    "武装警察3部",  # 04CD
    "重装警察3部",  # 04CE
    "特攻警察3部",  # 04CF
    "无敌警察2部",  # 04D0
    "武装警察4部",  # 04D1
    "重装警察4部",  # 04D2
    "特攻警察4部",  # 04D3
    "无敌警察3部",  # 04D4
    "空中武装警察",  # 04D5
    "地底武装警察",  # 04D6
    "突击武装警察",  # 04D7
    "空中重装警察",  # 04D8
    "地底重装警察",  # 04D9
    "突击重装警察",  # 04DA
    "空中特攻警察",  # 04DB
    "地底特攻警察",  # 04DC
    "突击特攻警察",  # 04DD
    "空中无敌警察",  # 04DE
    "地底无敌警察",  # 04DF
    "突击无敌警察",  # 04E0
    "轰天武装警察",  # 04E1
    "突击空中武装警察",  # 04E2
    "轰天重装警察",  # 04E3
    "突击空中重装警察",  # 04E4
    "轰天特攻警察",  # 04E5
    "突击空中特攻警察",  # 04E6
    "轰天无敌警察",  # 04E7
    "突击空中无敌警察",  # 04E8
    "越野摩托",  # 04E9
    "Ｘ射手",  # 04EA
    "Ｘ强打者",  # 04EB
    "Ｘ清道夫",  # 04EC
    "Ｘ独角兽",  # 04ED
    "Ｘ悍匪",  # 04EE
    "Ｘ地狱犬",  # 04EF
    "ＸＳ独角兽",  # 04F0
    "ＸＳ魔狼",  # 04F1
    "ＸＶ魔狼",  # 04F2
    "ＸＣ魔狼",  # 04F3
    "ＸＳ悍匪",  # 04F4
    "ＸＳ野蛮人",  # 04F5
    "ＸＶ野蛮人",  # 04F6
    "ＸＣ野蛮人",  # 04F7
    "ＸＳ地狱犬",  # 04F8
    "ＸＳ三头地狱犬",  # 04F9
    "ＸＶ三头地狱犬",  # 04FA
    "ＸＣ三头地狱犬",  # 04FB
    "Ｘ教父",  # 04FC
    "Ｘ堕天使",  # 04FD
    "Ｘ诱惑恶魔",  # 04FE
    "ＭＢＴ７７",  # 04FF
    "ＭＢＴ７７警长",  # 0500
    "ＭＢＴ７７游侠",  # 0501
    "ＭＢＴ７７征服",  # 0502
    "凯门鳄７７",  # 0503
    "野牛７７",  # 0504
    "犀牛７７",  # 0505
    "鸵鸟７７",  # 0506
    "美洲虎７７ＤＨ",  # 0507
    "美洲虎７７ＤＣ",  # 0508
    "半人马７７",  # 0509
    "刺猬７７",  # 050A
    "秃鹰７７ＤＨ",  # 050B
    "秃鹰７７ＤＣ",  # 050C
    "河豚７７",  # 050D
    "不死鸟Ｗ",  # 050E
    "不死鸟Ｓ",  # 050F
    "不死鸟Ｃ",  # 0510
    "不死鸟Ｖ",  # 0511
    "红狼",  # 0512
    "红狼ⅡＶ",  # 0513
    "红狼ⅡＳ",  # 0514
    "红狼Ⅲ",  # 0515
    "红狼ⅣＷ",  # 0516
    "红狼ⅣＭ",  # 0517
    "红狼ⅣＸ",  # 0518
    "红狼ⅤＷＸ",  # 0519
    "红狼ⅤＭＸ",  # 051A
    "红狼ⅥＷＷ",  # 051B
    "红狼ⅥＷＸ",  # 051C
    "红狼ⅥＭＷ",  # 051D
    "红狼ⅥＭＸ",  # 051E
    "红狼ⅦＷＷ",  # 051F
    "红狼ⅦＭＷ",  # 0520
    "侦察车",  # 0521
    "枪手",  # 0522
    "平衡者",  # 0523
    "武装侦察车",  # 0524
    "战略侦察车",  # 0525
    "魔术师",  # 0526
    "神枪手",  # 0527
    "魔术师",  # 0528
    "魔术师卡迪尼",  # 0529
    "魔术师霍迪尼",  # 052A
    "加农炮大师",  # 052B
    "枪王",  # 052C
    "荒野守卫",  # 052D
    "海市蜃楼",  # 052E
    "幻想",  # 052F
    "剑鱼",  # 0530
    "鲸鱼",  # 0531
    "金枪鱼",  # 0532
    "食人鱼",  # 0533
    "安康鱼",  # 0534
    "鬼韧鱼",  # 0535
    "大陆雄鹰",  # 0536
    "鲸鱼打击者",  # 0537
    "超级巨鲸",  # 0538
    "鲸鱼轰炸者",  # 0539
    "长毛象",  # 053A
    "热带长毛象",  # 053B
    "极地长毛象",  # 053C
    "毒沼长毛象",  # 053D
    "猛犸象",  # 053E
    "热带猛犸象",  # 053F
    "极地猛犸象",  # 0540
    "毒沼猛犸象",  # 0541
    "长牙猛犸象",  # 0542
    "炎天长牙猛犸象",  # 0543
    "极寒长牙猛犸象",  # 0544
    "浓雾长牙猛犸象",  # 0545
    "巨型猛犸象",  # 0546
    "炎天巨型猛犸象",  # 0547
    "极寒巨型猛犸象",  # 0548
    "浓雾巨型猛犸象",  # 0549
    "长毛猛犸",  # 054A
    "激情长毛猛犸",  # 054B
    "冷酷长毛猛犸",  # 054C
    "幻惑长毛猛犸",  # 054D
    "真猛犸",  # 054E
    "烈焰真猛犸",  # 054F
    "冰霜真猛犸",  # 0550
    "神秘真猛犸",  # 0551
    "象王",  # 0552
    "灼热象王",  # 0553
    "冰河象王",  # 0554
    "雾幻象王",  # 0555
    "大力神角虫",  # 0556
    "声波虫",  # 0557
    "电气虫",  # 0558
    "钻头甲虫",  # 0559
    "β大力神角虫",  # 055A
    "β声波虫",  # 055B
    "β电气虫",  # 055C
    "β钻头甲虫",  # 055D
    "γ大力神角虫",  # 055E
    "γ声波虫",  # 055F
    "γ电气虫",  # 0560
    "γ钻头甲虫",  # 0561
    "Δ大力神角虫",  # 0562
    "Δ声波虫",  # 0563
    "Δ电气虫",  # 0564
    "Δ钻头甲虫",  # 0565
    "ΣΣ大力神角虫",  # 0566
    "Σ声波虫",  # 0567
    "Σ电气虫",  # 0568
    "Σ钻头甲虫",  # 0569
    "Ζ大力神角虫",  # 056A
    "Ζ声波虫",  # 056B
    "Ζ电气虫",  # 056C
    "Ζ钻头甲虫",  # 056D
    "Ω大力神角虫",  # 056E
    "Ω声波虫",  # 056F
    "Ω电气虫",  # 0570
    "Ω钻头甲虫",  # 0571
    "章鱼章鱼",  # 0572
    "鸣动章鱼",  # 0573
    "结晶章鱼",  # 0574
    "红莲章鱼",  # 0575
    "章鱼２",  # 0576
    "鸣动章鱼２",  # 0577
    "结晶章鱼２",  # 0578
    "红莲章鱼２",  # 0579
    "触手海怪",  # 057A
    "鸣动触手海怪",  # 057B
    "结晶触手海怪",  # 057C
    "红莲触手海怪",  # 057D
    "触手海怪２",  # 057E
    "鸣动触手海怪２",  # 057F
    "结晶触手海怪２",  # 0580
    "红莲触手海怪２",  # 0581
    "克拉肯海怪",  # 0582
    "鸣动克拉肯海怪",  # 0583
    "结晶克拉肯海怪",  # 0584
    "红莲克拉肯海怪",  # 0585
    "克拉肯海怪２",  # 0586
    "鸣动克拉肯海怪２",  # 0587
    "结晶克拉肯海怪２",  # 0588
    "红莲克拉肯海怪２",  # 0589
    "海神",  # 058A
    "鸣动海神",  # 058B
    "结晶海神",  # 058C
    "红莲海神",  # 058D
    "三角龙",  # 058E
    "光能角龙",  # 058F
    "电气角龙",  # 0590
    "钻头角龙",  # 0591
    "击角龙",  # 0592
    "光角龙",  # 0593
    "雷角龙",  # 0594
    "掘角龙",  # 0595
    "突击角龙",  # 0596
    "闪光角龙",  # 0597
    "雷击角龙",  # 0598
    "回转角龙",  # 0599
    "恐龙战车",  # 059A
    "闪光龙机",  # 059B
    "电龙战车",  # 059C
    "地底龙机",  # 059D
    "恐龙突击炮",  # 059E
    "闪光强袭龙机",  # 059F
    "电龙驱逐战车",  # 05A0
    "地底特攻龙机",  # 05A1
    "V型恐龙突击炮",  # 05A2
    "闪光强袭龙机V",  # 05A3
    "V型电龙驱逐战车",  # 05A4
    "地底特攻龙机V",  # 05A5
    "无敌角龙",  # 05A6
    "无敌角龙光",  # 05A7
    "无敌角龙雷",  # 05A8
    "无敌角龙冲",  # 05A9
    "通古斯战车",  # 05AA
    "通古斯战车G",  # 05AB
    "通古斯战车S",  # 05AC
    "重装通古斯战车",  # 05AD
    "防空加农炮",  # 05AE
    "防空火神炮",  # 05AF
    "防空特攻炮",  # 05B0
    "防空加农炮Ｗ",  # 05B1
    "防空加农炮Ｄ",  # 05B2
    "防空加农炮Ｍ",  # 05B3
    "防空火神炮Ｗ",  # 05B4
    "防空火神炮Ｄ",  # 05B5
    "防空火神炮Ｍ",  # 05B6
    "防空特攻炮Ｗ",  # 05B7
    "防空特攻炮Ｄ",  # 05B8
    "防空特攻炮Ｍ",  # 05B9
    "驱逐穆罗梅茨",  # 05BA
    "对战车穆罗梅茨",  # 05BB
    "强袭穆罗梅茨",  # 05BC
    "对空穆罗梅茨",  # 05BD
    "特攻穆罗梅茨",  # 05BE
    "长射程穆罗梅茨",  # 05BF
    "科幻",  # 05C0
    "困境",  # 05C1
    "挬论",  # 05C2
    "流星",  # 05C3
    "光速流星",  # 05C4
    "爆速流星",  # 05C5
    "光速流星ＢＢ",  # 05C6
    "光速流星ＢＭ",  # 05C7
    "爆速流星ＭＢ",  # 05C8
    "爆速流星ＭＭ",  # 05C9
    "连星类星体Ｃ",  # 05CA
    "连星类星体Ｓ",  # 05CB
    "类星体ＫＢ",  # 05CC
    "类星体ＫＭ",  # 05CD
    "连星脉冲星Ｃ",  # 05CE
    "连星脉冲星Ｓ",  # 05CF
    "脉冲星ＫＢ",  # 05D0
    "脉冲星ＫＭ",  # 05D1
    "超快速光子Ｓ-Ｃ",  # 05D2
    "超快速光子Ｓ-Ｓ",  # 05D3
    "哦呀行者",  # 05D4
    "加农炮行者",  # 05D5
    "唉嗬行者",  # 05D6
    "嗨呀行者",  # 05D7
    "嘿哟行者",  # 05D8
    "哟呵行者",  # 05D9
    "喔唷行者",  # 05DA
    "魁行者",  # 05DB
    "祭行者",  # 05DC
    "天行者",  # 05DD
    "朝霞行者",  # 05DE
    "黄昏行者",  # 05DF
    "风神行者",  # 05E0
    "雷神行者",  # 05E1
    "阿修罗行者",  # 05E2
    "阿吽行者",  # 05E3
    "晓行者",  # 05E4
    "曙行者",  # 05E5
    "天神行者",  # 05E6
    "雷门行者",  # 05E7
    "夜空行者",  # 05E8
    "青空行者",  # 05E9
    "祇园行者",  # 05EA
    "浅草行者",  # 05EB
    "室戸行者",  # 05EC
    "涉谷行者",  # 05ED
    "梅田行者",  # 05EE
    "福冈行者",  # 05EF
    "土佐行者",  # 05F0
    "熊谷行者",  # 05F1
    "调布行者",  # 05F2
    "鸣子行者",  # 05F3
    "阿波行者",  # 05F4
    "富士行者",  # 05F5
    "驹込行者",  # 05F6
    "森下行者",  # 05F7
    "中野行者",  # 05F8
    "新宿行者",  # 05F9
    "六本木行者",  # 05FA
    "麻布行者",  # 05FB
    "冲绳行者",  # 05FC
    "札幌行者",  # 05FD
    "名古屋行者",  # 05FE
    "大阪行者",  # 05FF
    "东京行者",  # 0600
    "芝加哥行者",  # 0601
    "北京行者",  # 0602
    "希腊行者",  # 0603
    "巴黎行者",  # 0604
    "纽约行者",  # 0605
    "米兰行者",  # 0606
    "伦敦行者",  # 0607
    "首尔行者",  # 0608
    "开罗行者",  # 0609
    "罗马行者",  # 060A
    "多哈行者",  # 060B
    "曼谷行者",  # 060C
    "莫斯科行者",  # 060D
    "摩纳哥行者",  # 060E
    "维也纳行者",  # 060F
    "水星行者",  # 0610
    "金星行者",  # 0611
    "地球行者",  # 0612
    "火星行者",  # 0613
    "木星行者",  # 0614
    "土星行者",  # 0615
    "天王星行者",  # 0616
    "海王星行者",  # 0617
    "拉普斯金",  # 0618
    "赫德拉普斯金",  # 0619
    "达拉普斯金",  # 061A
    "沙皇",  # 061B
    "伊万",  # 061C
    "亚力山德罗",  # 061D
    "沙皇重战车",  # 061E
    "伊姆皮拉尔德",  # 061F
    "罗曼诺夫",  # 0620
    "叶卡捷琳娜女",  # 0621
    "恐腭猪",  # 0622
    "布鲁伽大师",  # 0623
    "奥米伽大师",  # 0624
    "卫星观察者",  # 0625
    "电子魔鬼鱼",  # 0626
    "半世纪寒武",  # 0627
    "历史熔炉",  # 0628
    "德赛尔棱镜",  # 0629
    "新吉拉斯",  # 062A
    "河马执政官",  # 062B
    "OZ・效应",  # 062C
    "奇虾",  # 062D
    "异次元三叶虫",  # 062E
    "双重拉格朗日",  # 062F
    "恐鱼",  # 0630
    "冰河巨蟹",  # 0631
    "神酒",  # 0632
    "三度空间",  # 0633
    "人造复仇者",  # 0634
    "ＫＴ边界线",  # 0635
    "审判图腾",  # 0636
    "回旋曲线",  # 0637
    "末次冰期",  # 0638
    "喀戎束胸",  # 0639
    "异次元行星",  # 063A
    "失落连锁",  # 063B
    "突击巨石像",  # 063C
    "出租战车",  # 063D
    "出租战车Ⅱ",  # 063E
    "出租战车Ⅲ",  # 063F
    "出租战车Ⅳ",  # 0640
    "出租警车",  # 0641
    "出租７７战车",  # 0642
    "出租火神炮战车",  # 0643
    "出租高射战车",  # 0644
    "出租刺猬战车",  # 0645
    "出租指挥车",  # 0646
)


MONSTERS = (
    "空",
    "钻头玫瑰",
    "烤面包龙",
    "声波孔雀",
    "蟹形发射井",
    "猪突炮",
    "小鬼蜜瓜",
    "毛虫炮",
    "流浪油桶",
    "流浪油桶",
    "空油桶",
    "数码僵尸",
    "激光蜗牛",
    "恶人电波",
    "强力劳动神话",
    "注射鸟",
    "人类杀手(0x010)",
    "无差别侦察",
    "一发屋",
    "旋风眼镜蛇",
    "声波花",
    "杀人变形虫",
    "杀人变形虫",
    "敏感兔",
    "巨蚁",
    "杀人出租车",
    "熨斗鹰",
    "酸蚁",
    "虹虫",
    "蜂巢炮",
    "巨鼠",
    "警备炮台",
    "美杜莎炮台(0x020)",
    "加农蚱蜢",
    "B52信天翁♀",
    "B52信天翁♀",
    "血蛭",
    "引擎凯门鳄",
    "幸福蓝鳄",
    "车居蟹",
    "B52信天翁♂",
    "B52信天翁♂",
    "火箭螃蟹",
    "软体加农炮",
    "恐贝",
    "斧头帮",
    "斧头帮",
    "小刀会",
    "拦路党(0x030)",
    "拦路党",
    "狙击狗",
    "冷血纵火狂",
    "暴走冷血",
    "暴走冷血",
    "钢之冷血",
    "钢之冷血",
    "飞行汤姆",
    "侦察UFO",
    "暴龙推土机",
    "坏掉的暴龙式",
    "僵尸骑手",
    "支援僵尸",
    "警备骷髅",
    "钟鸟",
    "死亡电话(0x040)",
    "僵尸盟员",
    "飞天护士",
    "DNA粘液怪",
    "拦截碟",
    "蜂巢加农炮",
    "坏掉的蜂巢式",
    "反坦克狗",
    "生化蜂(第二条狗)",
    "噪音器",
    "坏掉的噪音器",
    "98mm自走炮",
    "坏掉的自走炮",
    "恶魔车",
    "坏掉的恶魔车",
    "巨炮",
    "坏掉的巨炮(0x050)",
    "战车杀手",
    "坏掉的杀手",
    "噪音兔",
    "噪音兔",
    "运铁者",
    "铁球",
    "采伐者",
    "坏掉的采伐者",
    "等离子甲虫",
    "激光蜂",
    "惊吓花",
    "血玫瑰",
    "炸弹蒲公英",
    "火黑猪",
    "火黑猪",
    "凶暴小野猪(0x060)",
    "光束阀门",
    "毒虫炮",
    "毒虫炮",
    "食铁蚁",
    "食铁蚁",
    "金蚁",
    "金蚁",
    "河马炮",
    "光束直升机",
    "多炮塔战车",
    "坏掉的多炮塔",
    "黑蚁毯",
    "暗眼鼠",
    "恐怖人偶",
    "毒鳄",
    "金属发射井(0x070)",
    "诅咒手机",
    "吸血蝇",
    "火箭塔",
    "火箭塔",
    "导弹幽灵",
    "导弹幽灵",
    "九头蛇炮台",
    "九头蛇炮台",
    "警备蚱蜢",
    "黄金弹头",
    "黄金弹头",
    "激光蚓",
    "镜面蜗牛",
    "麻痹蚁",
    "激光海参",
    "炸弹龟(0x080)",
    "机器警察",
    "机器警察",
    "杀人助手",
    "巨蜈蚣",
    "炸弹钟",
    "钻头虫",
    "火蚁",
    "硝油桶",
    "死神战车",
    "坏掉的死神战车",
    "机械杰森",
    "麻痹蜂鸟",
    "爬虾坦克",
    "轰炸信天翁",
    "寄生海蛞蝓",
    "大胃王X(0x090)",
    "杀戮匪帮",
    "地狱营救队",
    "地狱营救队",
    "漫步者",
    "漫步者",
    "杀手壁橱",
    "暴走僵尸",
    "杀戮变形虫",
    "暴走疯子",
    "公路杀手",
    "幽灵化油器",
    "公路僵尸",
    "强袭蜂",
    "沙鲛",
    "暗黑破坏神",
    "暗黑破坏神(地下)(0x0A0)",
    "食人玫瑰",
    "地雷鼹鼠",
    "地雷鼹鼠",
    "弹丸吸尘器",
    "沙漠清扫兔",
    "沙漠梦露",
    "夜影",
    "沙魔巨像",
    "沙魔巨像",
    "陆生蝠鲼",
    "修理直升机",
    "地狱火炉",
    "人类地狱",
    "幻蝠鲼",
    "绿洲猪",
    "游击蚁(0x0B0)",
    "古典杰克",
    "格林虫",
    "正义塔",
    "地下指挥官",
    "光束鳗",
    "歼灭球",
    "零工僵尸",
    "火人",
    "僵尸狗",
    "僵尸变种人",
    "僵尸豹",
    "僵尸鲨",
    "僵尸猴",
    "僵尸花",
    "纵火人偶",
    "拟态盒(0x0C0)",
    "拟态盒",
    "金属隼",
    "疯狂警察",
    "破旧油桶",
    "垃圾巨人",
    "垃圾巨人",
    "垃圾巨人",
    "垃圾巨人",
    "垃圾矮人",
    "垃圾矮人",
    "垃圾矮人",
    "喧闹车",
    "AT大象",
    "T99猩猩",
    "AT灰熊",
    "炮弹屠杀者(0x0D0)",
    "炮弹屠杀者",
    "巨剪车",
    "僵尸技师",
    "白金蚁",
    "狂暴推土机",
    "喷火蚱蜢",
    "隐形蚊",
    "凶暴烤面包机",
    "46亿年巨龟",
    "等离子坦克",
    "解脱战车",
    "激微波炮",
    "荷尔蒙虫",
    "荷尔蒙虫",
    "恶臭柜子",
    "烧烤鼠(0x0E0)",
    "气球瓜",
    "党徒狗",
    "冷血屠夫",
    "冷血仮面",
    "漫步党徒",
    "漫步党徒",
    "巡回党徒",
    "巡回党徒",
    "冷血医生",
    "喧哗党徒",
    "献血蝙蝠",
    "投掷僵尸",
    "投掷僵尸",
    "猛打僵尸",
    "金蚁毯",
    "死亡迪桑(0x0F0)",
    "吸尘曼巴蛇",
    "恶魔电话",
    "怪物钟",
    "极乐轰炸机",
    "极乐轰炸机",
    "镜面球",
    "食蚁兽",
    "失散食客",
    "剧毒女仆",
    "错乱人偶",
    "号角响尾蛇",
    "弹丸乐园",
    "解体直升机",
    "无后座力炮",
    "地狱骑手",
    "白金蚁毯(0x100)",
    "临界等离子炮",
    "变形怪",
    "变形怪",
    "变形怪",
    "变形怪",
    "小变形怪",
    "小变形怪",
    "小变形怪",
    "原型蟹挖掘机",
    "原型猿门式车",
    "军刀哈根",
    "金蝇",
    "金龟",
    "杀人魔鹰",
    "图腾塔",
    "图腾塔(0x110)",
    "图腾塔",
    "图腾塔",
    "图腾塔",
    "图腾塔",
    "突变牛",
    "公路墨林",
    "说教阿修罗",
    "机械蝠鲼",
    "火焰章鱼",
    "美神蛋",
    "繁殖贝壳",
    "燃烧螺壳蟹",
    "纵火猴",
    "钻头列车",
    "钻头火车",
    "巨型河马(0x120)",
    "冷冻鳄",
    "无差别螺",
    "聚合蜈蚣",
    "充电虫",
    "电击斗虫",
    "死音雀",
    "巡逻蜂",
    "波动海参",
    "波动海参",
    "波动海参",
    "恐慌玫瑰",
    "卤素花",
    "炸弹蒲公女王",
    "炸弹蒲公宝宝",
    "恶魔瓜",
    "运瓜者(0x130)",
    "恶魔瓜",
    "实验体X",
    "恐慌头",
    "魅惑花",
    "鳄海参",
    "恐慌猴",
    "嚎叫戈耳工",
    "地狱锯",
    "杀人巡警",
    "雷电鼹鼠",
    "新式玉米头",
    "AT伊夫利特",
    "整备骸骨",
    "波动筒",
    "波动筒",
    "波动筒(0x140)",
    "白金行者",
    "鬼怪炮",
    "白骨凯瑟琳",
    "节食蛙",
    "闪光壁橱",
    "死二针",
    "极恶手机",
    "不安定粘液怪",
    "超导虫X",
    "独角虎",
    "变换塔",
    "守卫炮台",
    "无常戈耳工",
    "无常戈耳工",
    "无常戈耳工",
    "无常戈耳工(0x150)",
    "完美守卫",
    "反射激光炮",
    "撒旦Q",
    "地狱旋转门",
    "地狱旋转门",
    "地狱旋转门",
    "复制娃娃",
    "复制粘液怪",
    "守卫魔像",
    "全满医生",
    "僵尸棺材",
    "僵尸棺材",
    "重机暴龙",
    "光束飓风",
    "光束飓风",
    "光束飓风(0x160)",
    "光束飓风",
    "光束飓风",
    "金属吗啡冻",
    "金属吗啡冻",
    "金属吗啡冻",
    "金属吗啡冻",
    "金属吗啡冻",
    "金属吗啡冻",
    "沙萝卜",
    "沙萝卜",
    "大鬼蜜瓜",
    "小鬼蜜瓜",
    "小毛虫炮",
    "愤怒坦克",
    "壁橱怪",
    "鲨熊(0x170)",
    "守卫墙",
    "灰姑娘墙",
    "安全晶球",
    "布教炮",
    "旗鱼猎豹",
    "绿恶魔",
    "五右卫猴",
    "五右卫猴",
    "哈库里埃尔",
    "党徒巡逻队",
    "巨大鼠",
    "达摩炮",
    "达摩炮",
    "达摩炮",
    "达摩炮",
    "达摩炮(0x180)",
    "达摩炮",
    "地狱旋转门",
    "地狱旋转门",
    "地狱旋转门",
    "僵尸赌徒",
    "地狱清除者",
    "绝望使者",
    "电子管泰坦",
    "机动死刑台",
    "地狱门守卫",
    "劳尔",
    "卡洛斯",
    "哼弗莱",
    "迭戈",
    "掩体要塞兵",
    "拷问兵(0x190)",
    "拷问兵",
    "狱卒",
    "萨布罗密欧",
    "萨布罗密欧",
    "奥尔加・莫德",
    "巨蛋的墙壁?",
    "泥土墙壁",
    "岩石墙壁",
    "混凝土墙壁",
    "牢房的墙壁",
    "钟乳石墙壁",
    "绝望的墙壁",
    "最后的墙壁",
    "螃蟹吊车",
    "螃蟹吊车",
    "巨鹿战车(0x1A0)",
    "多明戈斯",
    "多明戈斯",
    "多明戈斯号",
    "多明戈斯号",
    "超流动巨大布丁",
    "猴门氏车",
    "猴门氏车",
    "气象云",
    "气象云",
    "火星水母",
    "火星水母",
    "火星水母",
    "火星水母",
    "猴面包树怪",
    "保镖机器人",
    "水怪许德拉(0x1B0)",
    "水怪许德拉",
    "水怪许德拉",
    "水怪许德拉",
    "水怪许德拉",
    "水怪许德拉",
    "水怪许德拉",
    "水怪许德拉",
    "水怪许德拉",
    "巨茧怪",
    "蛾女",
    "阿尔梅达",
    "阿尔梅达",
    "阿尔梅达号",
    "电子旗鱼",
    "穆加迪斯",
    "穆加迪斯(0x1C0)",
    "穆加迪斯号",
    "极速王者",
    "极速王者",
    "冥界列车",
    "冥界列车",
    "冥界列车",
    "神风女王",
    "垃圾人",
    "垃圾人",
    "垃圾人",
    "垃圾人",
    "小垃圾人",
    "小垃圾人",
    "小垃圾人",
    "小垃圾人",
    "杰克・变形虫(0x1D0)",
    "托尼・变形虫",
    "比尔・变形虫",
    "奥罗克",
    "奥罗克",
    "奥罗克号",
    "僵尸奥罗克",
    "奥尔加・莫德",
    "奥尔加・莫德",
    "奥尔加・莫德",
    "变异萝卜",
    "变异萝卜",
    "激钢钻狮",
    "凶鸟·死亡黛蒙娜",
    "凶鸟·死亡黛蒙娜",
    "露西",
    "改造露西(0x1E0)",
    "米库",
    "改造米库",
    "米库２号",
    "阿托克",
    "改造阿托克",
    "阿托克２号",
    "露西队号",
    "露西队号",
    "露西队车内待机",
    "风魔AH666",
    "古拉托诺斯(第一次)",
    "古拉托诺斯",
    "古拉托诺斯",
    "破坏神座",
    "希望炮",
    "绝望炮(0x1F0)",
    "古拉托诺斯(头形态)",
    "古拉托诺斯龙",
    "古拉托诺斯龙",
    "古拉托诺斯龙",
    "扎格",
    "纳特",
    "坷垃",
    "变异萝卜２",
    "变异萝卜３",
    "阿拉莫·杰克",
    "阿拉莫·杰克",
    "阿拉莫·杰克",
    "土星水母",
    "土星水母",
    "土星水母",
    "土星水母(0x200)",
    "激钢钻虎1",
    "作成ＷＡＮＴＥＤ１",
)


def itemof(start, end, can_empty=True):
    return ItemProvider(ITEMS, start, end, can_empty)


SPECIAL_BULLETS = itemof(0x01, 0x0F)  # 特殊炮弹
HUMEN_ITEM = itemof(0x0063, 0x0164)  # 道具
POTION = itemof(0x0F, 0x36)  # 恢复道具
BATTLE_ITEM = itemof(0x36, 0x63)  # 战斗道具

EQUIP_HEAD = itemof(0x0165, 0x0184)  # 头部装备
EQUIP_BODY = itemof(0x0184, 0x01C1)  # 上身装备
EQUIP_HAND = itemof(0x01C1, 0x01DE)  # 手部装备
EQUIP_FOOT = itemof(0x01DE, 0x0203)  # 脚部装备
EQUIP_ORN = itemof(0x0203, 0x021E)  # 装饰
EQUIP_WEAPON = itemof(0x021E, 0x028F)  # 武器
ALL_EQUIP = itemof(0x0165, 0x028F)  # 全部人类装备

# CHARIOT_ITEM = itemof(0x028F, 0x02CC)  # 战车物品
# CHARIOT_ENGINE = itemof(0x02CC, 0x0326)  # 引擎
# CHARIOT_CONTROL = itemof(0x0326, 0x034E)  # C装置
# CHARIOT_CONTROL_ENGINE = itemof(0x02CC, 0x034E)  # C装置/引擎
# CHARIOT_MAIN = itemof(0x034E, 0x0394)  # 主炮
# CHARIOT_GUNS = itemof(0x0394, 0x03BC)  # 机枪
# CHARIOT_SE = itemof(0x03BC, 0x03EE)  # SE
# CHARIOT_FIXED = itemof(0x03EE, 0x04AE)  # 固定武器
# CHARIOT_WEAPON = itemof(0x034E, 0x04AE)  # 全部战车武器
CHARIOT_ALL_ITEM = itemof(0x028F, 0x04AE)  # 全部战车物品
CHARIOT_CHASSIS = itemof(0x04AE, 0x0647)  # 底盘
