attr = ["无", "火", "雷", "风", "冰", "暗", "光", "理"]

attrs1 = [
    "救出",
    "再移动",
    "偷盗",
    "视野",
    "舞蹈",
    "演奏",
    "必杀加成",
    "驾驶弩车",
]

attrs2 = [
    "上位职业",
    "运输队",
    "战马",
    "飞龙",
    "飞马",
    "压制",
    "女性",
    "Boss",
]

attrs3 = [
    "罗伊专用",
    "剑士专用",
    "龙/魔物专用",
    "顶级10级",
    "无法查看能力",
    "三角攻击1",
    "三角攻击2",
]

attrs4 = [
    "[空]",
    "瞬杀",
    "封魔(敌专用)",
    "召唤",
    "艾瑞珂专用",
    "伊弗列姆专用",
    "琳专用",
    "阿特斯专用",
]